Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Beaglebone.po
Languages: hu

source: This document describes the process of running Klipper on a Beaglebone PRU.
hu: Ez a dokumentum a Klipper futtatásának folyamatát írja le egy Beaglebone PRU-n.

source: Building an OS image
hu: OS-képfájl készítése

source: Start by installing the [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images) image. One may run the image from either a micro-SD card or from builtin eMMC. If using the eMMC, install it to eMMC now by following the instructions from the above link.
hu: Kezdd a [Debian 9.9 2019-08-03 4GB SD IoT](https://beagleboard.org/latest-images) lemezkép telepítésével. A lemezképet futtathatjuk micro-SD kártyáról vagy beépített eMMC-ről is. Ha az eMMC-t használjuk, akkor most telepítsük az eMMC-re a fenti link utasításait követve.

source: Then ssh into the Beaglebone machine (`ssh debian@beaglebone` -- password is `temppwd`) and install Klipper by running the following commands:
hu: Ezután lépj be SSH-n a Beaglebone gépre (`ssh debian@beaglebone` -- a jelszó `temppwd`) és telepítsd a Klippert a következő parancsok futtatásával:

source: Install Octoprint
hu: Octoprint telepítése

source: One may then install Octoprint:
hu: Ezután telepíthetjük az Octoprintet:

source: And setup OctoPrint to start at bootup:
hu: És állítsd be az OctoPrintet úgy, hogy az indításkor elinduljon:

source: It is necessary to modify OctoPrint's **/etc/default/octoprint** configuration file. One must change the `OCTOPRINT_USER` user to `debian`, change `NICELEVEL` to `0`, uncomment the `BASEDIR`, `CONFIGFILE`, and `DAEMON` settings and change the references from `/home/pi/` to `/home/debian/`:
hu: Módosítani kell az OctoPrint **/etc/default/octoprint** konfigurációs fájlját. Meg kell változtatni a `OCTOPRINT_USER` felhasználót `debian`-ra, változtassuk meg a `NICELEVEL`-t `0`-ra, vegyük ki a `BASEDIR` megjegyzést, `CONFIGFILE`, és `DAEMON` beállításokat, és módosítsa a hivatkozásokat `/home/pi/`-ről `/home/debian/`-re:

source: Then start the Octoprint service:
hu: Ezután indítsa el az Octoprint szolgáltatást:

source: Make sure the OctoPrint web server is accessible - it should be at: <http://beaglebone:5000/>
hu: Győződjön meg róla, hogy az OctoPrint webszerver elérhető - a következő címen kell lennie: <http://beaglebone:5000/>

source: Building the micro-controller code
hu: A mikrokontroller kódjának elkészítése

source: To compile the Klipper micro-controller code, start by configuring it for the "Beaglebone PRU":
hu: A Klipper mikrokontroller kódjának lefordításához kezdjük a "Beaglebone PRU" konfigurálásával:

source: To build and install the new micro-controller code, run:
hu: Az új mikrokontroller kódjának elkészítéséhez és telepítéséhez futtassa a következőt:

source: It is also necessary to compile and install the micro-controller code for a Linux host process. Configure it a second time for a "Linux process":
hu: Szükséges továbbá a mikrokontroller kódjának lefordítása és telepítése egy Linux gazdafolyamathoz. Konfigurálja másodszor is egy "Linux folyamat" számára:

source: Then install this micro-controller code as well:
hu: Ezután telepítse ezt a mikrokontroller kódot is:

source: Remaining configuration
hu: Hátralevő konfiguráció

source: Complete the installation by configuring Klipper and Octoprint following the instructions in the main [Installation](Installation.md#configuring-klipper) document.
hu: Fejezze be a telepítést a Klipper és az Octoprint konfigurálásával a [Telepítés](Installation.md#configuring-klipper) fődokumentumban található utasítások szerint.

source: Printing on the Beaglebone
hu: Nyomtatás a Beaglebone-on

source: Unfortunately, the Beaglebone processor can sometimes struggle to run OctoPrint well. Print stalls have been known to occur on complex prints (the printer may move faster than OctoPrint can send movement commands). If this occurs, consider using the "virtual_sdcard" feature (see [Config Reference](Config_Reference.md#virtual_sdcard) for details) to print directly from Klipper.
hu: Sajnos a Beaglebone processzor néha nehezen tudja jól futtatni az OctoPrintet. Előfordult már, hogy összetett nyomtatásoknál a nyomtatás akadozott (a nyomtató gyorsabban mozog, mint ahogy az OctoPrint mozgatási parancsokat tud küldeni). Ha ez előfordul, fontolja meg a "virtual_sdcard" funkció használatát (a részletekért lásd a [konfigurációs hivatkozást](Config_Reference.md#virtual_sdcard)), hogy közvetlenül a Klipperből nyomtass.
