Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Code_Overview.po
Languages: hu, zh_hans

source: It is recommended to assign a value to all member variables in the Python constructor of Python classes. (And therefore avoid utilizing Python's ability to dynamically create new member variables.)
hu: Javasoljuk, hogy a Python osztályok Python konstruktorában minden tagváltozóhoz értéket rendeljen. (És ezért kerülje a Python azon képességének kihasználását, hogy dinamikusan hozzon létre új tagváltozókat.)
zh_hans: 推荐在类的工厂函数中将所有成员变量实例化（即避免使用Python的动态变动成员变量的功能）。

source: If a Python variable is to store a floating point value then it is recommended to always assign and manipulate that variable with floating point constants (and never use integer constants). For example, prefer `self.speed = 1.` over `self.speed = 1`, and prefer `self.speed = 2. * x` over `self.speed = 2 * x`. Consistent use of floating point values can avoid hard to debug quirks in Python type conversions.
hu: Ha egy Python változónak lebegőpontos értéket kell tárolnia, akkor ajánlott mindig lebegőpontos konstansokkal hozzárendelni és kezelni a változót (és soha ne használjunk egészértékű konstansokat). Például részesítsük előnyben a `self.speed = 1.` értéket a `self.speed = 1` értékkel szemben, és részesítsük előnyben a `self.speed = 2 értéket. * x` a `self.speed = 2 * x` helyett. A lebegőpontos értékek következetes használatával elkerülhetők a Python-típuskonverziók nehezen hibakereshető furcsaságai.
zh_hans: 若一Python变量存放有一浮点数，那么建议该变量应总赋予浮点类型的量，并仅使用浮点数常量进行值运算（并绝不使用整形常数进行运算）。例如，应使用`self.speed = 1.`而非`self.speed = 1`，并以`self.speed = 2. * x` 替代 ` self.speed = 2 *x`。一致地使用浮点值可以避免Python类型转换中难以调试的怪异现象。

source: The first main coding task is to bring up communication support to the target board. This is the most difficult step in a new port. Once basic communication is working, the remaining steps tend to be much easier. It is typical to use a UART type serial device during initial development as these types of hardware devices are generally easier to enable and control. During this phase, make liberal use of helper code from the src/generic/ directory (check how src/simulator/Makefile includes the generic C code into the build). It is also necessary to define timer_read_time() (which returns the current system clock) in this phase, but it is not necessary to fully support timer irq handling.
hu: Az első fő kódolási feladat a kommunikációs támogatás felállítása az alaplapnak. Ez a legnehezebb lépés egy új port esetében. Ha az alapvető kommunikáció már működik, a további lépések általában sokkal könnyebbek. A kezdeti fejlesztés során jellemzően UART típusú soros eszközt használunk, mivel az ilyen típusú hardvereszközöket általában könnyebb engedélyezni és vezérelni. Ebben a fázisban bőkezűen használja az src/generic/ könyvtárban található segédkódot (ellenőrizze, hogy az src/simulator/Makefile hogyan tartalmazza a generikus C kódot a felépítésben). Ebben a fázisban szükséges definiálni a timer_read_time() funkciót is (amely visszaadja az aktuális rendszerórát), de nem szükséges a timer irq kezelésének teljes támogatása.
zh_hans: 首要任务是在目标打印机主板上实现通讯。这是增加支持中最难的一步，实现该功能后一切将阔然开朗。在开荒时，一般使用串行总线进行开发，因为通常串行总线已于应用和控制。在此阶段，可大量使用 src/generic/ 目录中的中的辅助代码（可参考 src/simulator/Makefile 中如何将上述代码加入构建）。同时，需要在这阶段完成 timer_read_time() 的定义（用于获取现时系统时钟），但无需完全实现定时中断功能。

source: Additional coding tips:
hu: További kódolási tippek:
zh_hans: 还有一些tips：

source: Avoid using "C bitfields" to access IO registers; prefer direct read and write operations of 32bit, 16bit, or 8bit integers. The C language specifications don't clearly specify how the compiler must implement C bitfields (eg, endianness, and bit layout), and it's difficult to determine what IO operations will occur on a C bitfield read or write.
hu: Kerülje a "C bitfields" használatát az IO regiszterek eléréséhez; részesítse előnyben a 32 bites, 16 bites vagy 8 bites egész számok közvetlen olvasási és írási műveleteit. A C nyelvi specifikációk nem határozzák meg egyértelműen, hogy a fordítónak hogyan kell megvalósítania a C bitmezőket (pl. endianness és bitkiosztás), és nehéz meghatározni, hogy milyen IO műveletek történnek egy C bitmező olvasásakor vagy írásakor.
zh_hans: 避免使用“C位段”（C bitfield）访问IO寄存器；应使用直接对32位、16位和8位的整数读写代替。C语言规范中没有对位段操作进行清晰定义（例如端序、字布局等），且在IO操作时使用C段位读写，将难以确定具体进行了何种IO操作。

source: Prefer writing explicit values to IO registers instead of using read-modify-write operations. That is, if updating a field in an IO register where the other fields have known values, then it is preferable to explicitly write the full contents of the register. Explicit writes produce code that is smaller, faster, and easier to debug.
hu: Inkább írjon explicit értékeket az IO regiszterekbe, minthogy olvasás-módosítás-írás műveleteket használjon. Azaz, ha egy olyan IO-regiszterben frissítünk egy mezőt, ahol a többi mező értékei ismertek, akkor előnyösebb a regiszter teljes tartalmát explicit módon kiírni. Az explicit írások kisebb, gyorsabb és könnyebben hibakereshető kódot eredményeznek.
zh_hans: IO寄存器操作时应使用显式赋值，避免使用“读-改-写”。也就是说，如果在一个IO寄存器中更新一个字段，而其他字段的值是已知的，那么最好是显式地写入寄存器的全部内容。显式写入产生的代码更小，更快，更容易调试。

source: Task, init, and command functions always run with interrupts enabled (however, they can temporarily disable interrupts if needed). These functions should avoid long pauses, delays, or do work that lasts a significant time. (Long delays in these "task" functions result in scheduling jitter for other "tasks" - delays over 100us may become noticeable, delays over 500us may result in command retransmissions, delays over 100ms may result in watchdog reboots.) These functions schedule work at specific times by scheduling timers.
hu: A feladat-, init- és parancsfüggvények mindig engedélyezett megszakításokkal futnak (szükség esetén azonban ideiglenesen letilthatják a megszakításokat). Ezeknek a függvényeknek kerülniük kell a hosszú szüneteket, késleltetéseket, vagy olyan munkát kell végezniük, amely jelentős ideig tart. (A hosszú késleltetések ezekben a "task" függvényekben más "taskok" ütemezési zavarát eredményezik. A 100us-nál hosszabb késleltetések észrevehetővé válhatnak, az 500us-nál hosszabb késleltetésű parancsok újraküldése, a 100ms-nál hosszabb késleltetések pedig watchdog újraindításokat eredményezhetnek.) Ezek a funkciók időzítőkkel ütemezik a munkát meghatározott időpontokra.
zh_hans: 任务、初始化和命令函数始终在启用中断的情况下运行（但是，如果需要，它们可以暂时禁用中断）。这些函数应避免长时间的暂停、延迟或执行持续很长时间的工作。（这些“任务”功能中的长时间延迟会导致其他“任务”的调度抖动 - 超过100us的延迟可能会变得明显，超过500us的延迟可能导致命令重传，超过100ms的延迟可能导致看门狗触发重启。这些函数通过调度计时器在特定时间安排工作。
