Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Code_Overview.po
Languages: hu, zh_hans

source: Create a new architecture sub-directory in the src/ directory and add initial Kconfig and Makefile support. Use the existing architectures as a guide. The src/simulator provides a basic example of a minimum starting point.
hu: Hozzon létre egy új architektúra alkönyvtárat az src/ könyvtárban, és adjon hozzá kezdeti Config és Makefile támogatást. Használja a meglévő architektúrákat útmutatóként. Az src/simulator egy alapvető példát nyújt egy minimális kiindulási pontra.
zh_hans: 在src/下新建一个新架构的子目录，并创建对应的初始Kconfig和Makefile。以已有的架构作为模版，其中src/simulator给出了微控制器架构的基本需求。

source: Get familiar with the the console.py tool (as described in the [debugging document](Debugging.md)) and verify connectivity to the micro-controller with it. This tool translates the low-level micro-controller communication protocol to a human readable form.
hu: Ismerkedjen meg a console.py eszközzel (a [Hibakeresési dokumentumban](Debugging.md) leírtak szerint), és ellenőrizze vele a mikrokontrollerrel való kapcsolatot. Ez az eszköz lefordítja az alacsony szintű mikrokontroller kommunikációs protokollt ember által olvasható formára.
zh_hans: 依照[调试文档](Debugging.md)熟悉console.py工具，并使用该工具核实微控制器的连接。该工具将底层微控制器通讯协议转换为可读形式。

source: Create a sample Klipper config file in the config/ directory. Test the micro-controller with the main klippy.py program.
hu: Hozzon létre egy minta Klipper konfigurációs fájlt a config/ könyvtárban. Teszteljük a mikrokontrollert a klippy.py főprogrammal.
zh_hans: 在config/目录新建一个配置事例，并使用Klipper.py的主程序进行设置。

source: Consider adding build test cases in the test/ directory.
hu: Fontolja meg a test/ könyvtárban lévő build tesztesetek hozzáadását.
zh_hans: 考虑在test/目录加入构建测试的事例。

source: Coordinate Systems
hu: Koordináta rendszerek
zh_hans: 坐标系变换

source: Internally, Klipper primarily tracks the position of the toolhead in cartesian coordinates that are relative to the coordinate system specified in the config file. That is, most of the Klipper code will never experience a change in coordinate systems. If the user makes a request to change the origin (eg, a `G92` command) then that effect is obtained by translating future commands to the primary coordinate system.
hu: A Klipper belsőleg elsősorban a nyomtatófej helyzetét követi cartesian koordinátákban, amelyek a konfigurációs fájlban megadott koordináta rendszerhez viszonyítva vannak. Ez azt jelenti, hogy a Klipper kód nagy része soha nem tapasztal koordináta rendszer változást. Ha a felhasználó az origó megváltoztatását kéri (pl. egy `G92` parancsal), akkor ezt a hatást a jövőbeli parancsok elsődleges koordináta rendszerre történő átváltásával érjük el.
zh_hans: 内部而言，Klipper使用笛卡尔坐标系追踪打印头的位置，其坐标系设置相对于设置文件中的坐标系而变化。因此，KIlipper的执行在绝大部分情况下都不会变换坐标系。如果用户进行原点的变换（如执行`G92`命令），Klipper会将后续命令转化到原始坐标系上进行执行。

source: However, in some cases it is useful to obtain the toolhead position in some other coordinate system and Klipper has several tools to facilitate that. This can be seen by running the GET_POSITION command. For example:
hu: Bizonyos esetekben azonban hasznos, ha a nyomtatófej helyzetét más koordináta rendszerben szeretnénk megkapni, és a Klipper több eszközzel is megkönnyíti ezt. Ez a GET_POSITION parancs futtatásával látható. Például:
zh_hans: 然而，在部分情况下，需要获取其他坐标系中打印头的位置。Klipper提供数种工具以实现上述功能。运行GET_POSITION可以获得上述数据，如：

source: The "stepper" position (`stepper.get_commanded_position()`) is the position of the given stepper as tracked by the kinematics code. This generally corresponds to the position (in mm) of the carriage along its rail, relative to the position_endstop specified in the config file. (Some kinematics track stepper positions in radians instead of millimeters.) If the robot is in motion when the query is issued then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue. One may use the `toolhead.flush_step_generation()` or `toolhead.wait_moves()` calls to fully flush the look-ahead and step generation code.
hu: A "stepper" pozíció (`stepper.get_commanded_position()`) az adott léptető pozíciója, ahogyan azt a kinematikai kód követi. Ez általában megfelel a kocsinak a sín mentén a konfigurációs fájlban megadott position_endstop-hoz viszonyított pozíciójának (mm-ben). (Egyes kinematikák a léptetők pozícióját milliméter helyett radiánban követik.) Ha a gép a lekérdezéskor mozgásban van, akkor a jelentett érték tartalmazza a mikrokontrollerben pufferelt mozgásokat, de nem tartalmazza a look-ahead sorban lévő mozgásokat. Használhatjuk a `toolhead.flush_step_generation()` vagy `toolhead.wait_moves()` hívásokat a look-ahead és a lépésgeneráló kód teljes kiürítéséhez.
zh_hans: “步进电机”部分（`stepper.get_commanded_position()`）是运动学模型中记录的特定步进电机位置。通常是对应轨道的相对于设定中的position_endstop设定值的滑车位置（单位为毫米，但部分设定中使用的是弧度单位而非线性单位）。如果在机械运动时触发上述代码，则返回的值为微控制器中缓存的位置，而不包含预计队列（look-ahead queue）中的预计位置。可使用`toolhead.flush_step_generation()`或`toolhead.wati_moves()`调用完全刷新预计队列和步进脉冲生成代码。

source: The "kinematic" position (`kin.calc_position()`) is the cartesian position of the toolhead as derived from "stepper" positions and is relative to the coordinate system specified in the config file. This may differ from the requested cartesian position due to the granularity of the stepper motors. If the robot is in motion when the "stepper" positions are taken then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue. One may use the `toolhead.flush_step_generation()` or `toolhead.wait_moves()` calls to fully flush the look-ahead and step generation code.
hu: A "kinematic" pozíció (`kin.calc_position()`) a nyomtatófej "stepper" pozíciókból származtatott cartesian pozíciója, és a konfigurációs fájlban megadott koordinátarendszerhez képest relatív. Ez eltérhet a kért cartesian pozíciótól a léptetőmotorok szaggatottsága miatt. Ha a gép a "stepper" pozíciók felvételekor mozgásban van, akkor a jelentett érték tartalmazza a mikrokontrollerben pufferelt mozgásokat, de nem tartalmazza a look-ahead várólistán lévő mozgásokat. Használhatjuk a `toolhead.flush_step_generation()` vagy `toolhead.wait_moves()` hívásokat a look-ahead és a lépésgeneráló kód teljes kiürítéséhez.
zh_hans: 运动学位置（`kin.cal_position()`）是在笛卡尔坐标上的，衍生于步进电机位置的，相对于设置文件中position_endstop值的位置。由于步进电机的分辨率原因，这可能与请求的笛卡尔坐标值不一致。如果在机械运动时触发上述代码，则返回的值为微控制器中缓存的位置，而不包含预计队列（look-ahead queue）中的预计位置。可使用`toolhead.flush_step_generation()`或`toolhead.wati_moves()`调用完全刷新预计队列和步进脉冲生成代码。

source: The "toolhead" position (`toolhead.get_position()`) is the last requested position of the toolhead in cartesian coordinates relative to the coordinate system specified in the config file. If the robot is in motion when the query is issued then the reported value includes all requested moves (even those in buffers waiting to be issued to the stepper motor drivers).
hu: A "toolhead" pozíció (`toolhead.get_position()`) a nyomtatófej utolsó kért pozíciója cartesian koordinátákban a konfigurációs fájlban megadott koordinátarendszerhez képest. Ha a gép a lekérdezés kiadásakor mozgásban van, akkor a jelentett érték tartalmazza az összes kért mozgást (még azokat is, amelyek a pufferben vannak és a motorvezérlőknek való kiadásra várnak).
zh_hans: 打印头位置（`toolhead.get_position()`）是最后的运动请求对应的，相对于设置文件限位位置的，笛卡尔坐标上的打印头位置。如果在机械运动时触发上述代码，那么返回值会依据请求运动序列中的运动终点给出（尽管buffer中的运动还没由步进电机触发）。

source: The "gcode" position is the last requested position from a `G1` (or `G0`) command in cartesian coordinates relative to the coordinate system specified in the config file. This may differ from the "toolhead" position if a g-code transformation (eg, bed_mesh, bed_tilt, skew_correction) is in effect. This may differ from the actual coordinates specified in the last `G1` command if the g-code origin has been changed (eg, `G92`, `SET_GCODE_OFFSET`, `M221`). The `M114` command (`gcode_move.get_status()['gcode_position']`) will report the last g-code position relative to the current g-code coordinate system.
hu: A "gcode" pozíció a `G1` (vagy `G0`) parancs utolsó kért pozíciója cartesian koordinátákban, a konfigurációs fájlban megadott koordinátarendszerhez képest. Ez eltérhet a "toolhead" pozíciótól, ha egy G-kód transzformáció (pl. bed_mesh, bed_tilt, skew_correction) van érvényben. Ez eltérhet az utolsó `G1` parancsban megadott tényleges koordinátáktól, ha a G-kód origója megváltozott (pl, `G92`, `SET_GCODE_OFFSET`, `M221`). A `M114` parancs (`gcode_move.get_status()['gcode_position']`) az aktuális G-kód koordinátarendszerhez viszonyított utolsó G-kód pozíciót jelenti.
zh_hans: G代码位置时最后一次位置请求命令（`G1`或`G0`）对应的，在笛卡尔坐标系中相对设定文件中的设定原点的相对位置。这可能与“打印头位置”不一致，这是因为G代码修正的影响（比如床网，床倾角修正，调平螺母修正）。这也会因为G代码原点变更（如`G92`，`SET_GCODE_OFFSET`，`M221`）而导致返回值跟最后一次`G1`命令请求的位置不一致。`Ｍ114`命令（`gcode_move.get_status()[’gcode_position’]`）会返回现时G代码相对于此时的G代码原点的位置。

source: The "gcode base" is the location of the g-code origin in cartesian coordinates relative to the coordinate system specified in the config file. Commands such as `G92`, `SET_GCODE_OFFSET`, and `M221` alter this value.
hu: A "gcode base" a G-kód origójának helye cartesian koordinátákban a konfigurációs fájlban megadott koordinátarendszerhez képest. Az olyan parancsok, mint a `G92`, `SET_GCODE_OFFSET` és `M221` módosítják ezt az értéket.
zh_hans: G代码基准是笛卡尔坐标系中相对于设定文件中的设定原点的相对位置。诸如`G92`，`SET_GCODE_OFFSET`和`M221`会改变的返回值。

source: The "gcode homing" is the location to use for the g-code origin (in cartesian coordinates relative to the coordinate system specified in the config file) after a `G28` home command. The `SET_GCODE_OFFSET` command can alter this value.
hu: A "gcode homing" az a hely, amelyet a G-kód origójaként (a konfigurációs fájlban megadott koordinátarendszerhez viszonyított cartesian koordinátákban) a `G28` home parancs után használni kell. A `SET_GCODE_OFFSET` parancs megváltoztathatja ezt az értéket.
zh_hans: G代码回零点是在`G28`命令执行后G代码原点。同样，该位置是笛卡尔坐标系中，相对于设置文件原点的位置。`SET_GCODE_OFFSET`命令会改变该值。

source: Time
hu: Idő
zh_hans: 定时

source: Fundamental to the operation of Klipper is the handling of clocks, times, and timestamps. Klipper executes actions on the printer by scheduling events to occur in the near future. For example, to turn on a fan, the code might schedule a change to a GPIO pin in a 100ms. It is rare for the code to attempt to take an instantaneous action. Thus, the handling of time within Klipper is critical to correct operation.
hu: A Klipper működésének alapvető eleme az órák, időpontok és időbélyegek kezelése. A Klipper a nyomtatón végrehajtott műveleteket a közeljövőben bekövetkező események ütemezésével hajtja végre. Például egy ventilátor bekapcsolásához a kód ütemezheti egy GPIO-tű változását 100ms alatt. Ritkán fordul elő, hogy a kód azonnali műveletet próbál végrehajtani. Ezért az idő kezelése a Klipperben kritikus fontosságú a helyes működés szempontjából.
zh_hans: 该节将描述Klipper如何处理时钟，定时和时间戳。Klipper通过提前安排需要执行的行为事件从而执行动作。例如，要启动风扇，代码需要安排GPIO针脚在100ms后变化。代码立即执行动作反而是罕见的状况。因此，Klipper的正确运行离不开对时间的精确处理。

source: There are three types of times tracked internally in the Klipper host software:
hu: A Klipper gazdaszoftverben háromféle időtípust követhetünk nyomon:
zh_hans: Klipper内部使用三种不同的时间：

source: System time. The system time uses the system's monotonic clock - it is a floating point number stored as seconds and it is (generally) relative to when the host computer was last started. System times have limited use in the software - they are primarily used when interacting with the operating system. Within the host code, system times are frequently stored in variables named *eventtime* or *curtime*.
hu: Rendszeridő. A rendszeridő a rendszer monoton óráját használja. Ez egy lebegőpontos szám, amelyet másodpercként tárolnak, és (általában) a gazdaszámítógép utolsó indításakor. A rendszeridők korlátozottan használhatók a szoftverben. Elsősorban az operációs rendszerrel való interakció során használják őket. Az állomáskódon belül a rendszeridőket gyakran az *eventtime* vagy *curtime* nevű változók tárolják.
zh_hans: 系统时间（System time）。系统时间使用系统的单调时钟。这是一个以秒为单位储存的浮点数，在系统启动后开始累计。系统时钟的用途有限，通常只会在与操作系统进行互动时使用。在上位机中，系统时间保存在*eventtime*或*curtime*变量中。

source: Print time. The print time is synchronized to the main micro-controller clock (the micro-controller defined in the "[mcu]" config section). It is a floating point number stored as seconds and is relative to when the main mcu was last restarted. It is possible to convert from a "print time" to the main micro-controller's hardware clock by multiplying the print time by the mcu's statically configured frequency rate. The high-level host code uses print times to calculate almost all physical actions (eg, head movement, heater changes, etc.). Within the host code, print times are generally stored in variables named *print_time* or *move_time*.
hu: Nyomtatási idő. A nyomtatási idő a mikrokontroller fő órájához szinkronizálódik az ("[mcu]" config) szakaszban meghatározott mikrokontrollerhez. Ez egy másodpercben tárolt lebegőpontos szám, és a fő MCU utolsó újraindításának időpontjához viszonyítva van. Lehetőség van a "nyomtatási idő"-ről a fő mikrokontroller hardveres órájára való átváltásra. A nyomtatási időnek az MCU-val való megszorzásával a statikusan konfigurált frekvenciával. A magas szintű gazdakód szinte minden fizikai művelet (pl. fejmozgás, fűtésváltás stb.) kiszámításához nyomtatási időt használ. A gazdakódon belül a nyomtatási időket általában a *print_time* vagy *move_time* nevű változókban tárolják.
zh_hans: 打印时间（Print time）。打印时间会与主微控制器时钟同步（在“[MCU]”设置段中定义的微控制器。）这是一个以秒为单位储存的浮点数，并在主微控制最后一次启动后开始从0累加。通过乘以设定的微控制器频率，可以获得主微控制器内部硬件时钟值。上层应用可以通过打印时间计算几乎所有物理行为（比如打印头运动，加热器变动等）。在上位机代码中，打印时间通常保存在*print_time*和*move_time*变量中。

source: MCU clock. This is the hardware clock counter on each micro-controller. It is stored as an integer and its update rate is relative to the frequency of the given micro-controller. The host software translates its internal times to clocks before transmission to the mcu. The mcu code only ever tracks time in clock ticks. Within the host code, clock values are tracked as 64bit integers, while the mcu code uses 32bit integers. Within the host code, clocks are generally stored in variables with names containing *clock* or *ticks*.
hu: MCU óra. Ez az egyes mikrovezérlők hardveres óraszámlálója. Egész számként van tárolva, frissítési gyakorisága az adott mikrovezérlő frekvenciájához viszonyított. A gazdaszoftver belső idejét lefordítja órákra, mielőtt továbbítaná az MCU-nak. Az MCU kód mindig csak az óra ketyegésében követi az időt. A gazdagép kódon belül az óraértékeket 64 bites egész számként követi nyomon, míg az MCU kód 32 bites egész számokat használ. A gazdagép kódon belül az órák általában *clock* vagy *tick* nevet tartalmazó változókban tárolódnak.
zh_hans: MCU时钟，是各个微控制内部的硬件时钟累加器。它是基于微控制器设定频率为速率进行累加的，以整形保存的值。上位机软件将软件内部时间转换为mcu时间并将命令传输到微控制器上。微控制代码仅在时钟跳动时更新和追踪时间。在上位机代码中，时钟值以64位整形记录，而微控制代码则使用32位整形。在上位机代码中，时钟通常以*clock*或*tick*变量保存。

source: Conversion between the different time formats is primarily implemented in the **klippy/clocksync.py** code.
hu: A különböző időformátumok közötti konverzió elsősorban a **klippy/clocksync.py** kódban valósul meg.
zh_hans: 不同时钟格式的转换主要在**klipper/clocksync.py**中实现。

source: Some things to be aware of when reviewing the code:
hu: Néhány dolog, amire figyelni kell a kód áttekintésekor:
zh_hans: 在检查代码时需要注意：

source: 32bit and 64bit clocks: To reduce bandwidth and to improve micro-controller efficiency, clocks on the micro-controller are tracked as 32bit integers. When comparing two clocks in the mcu code, the `timer_is_before()` function must always be used to ensure integer rollovers are handled properly. The host software converts 32bit clocks to 64bit clocks by appending the high-order bits from the last mcu timestamp it has received - no message from the mcu is ever more than 2^31 clock ticks in the future or past so this conversion is never ambiguous. The host converts from 64bit clocks to 32bit clocks by simply truncating the high-order bits. To ensure there is no ambiguity in this conversion, the **klippy/chelper/serialqueue.c** code will buffer messages until they are within 2^31 clock ticks of their target time.
hu: 32 bites és 64 bites órajelek: A sávszélesség csökkentése és a mikrokontroller hatékonyságának javítása érdekében a mikrokontroller órajeleit 32 bites egész számokként követik. Két órajel összehasonlításakor az MCU kódban mindig a `timer_is_before()` függvényt kell használni, hogy az egész számok átfordítását megfelelően kezeljük. A gazdaszoftver a 32 bites órajeleket 64 bites órajelekké alakítja át azáltal, hogy hozzáadja az utolsó kapott MCU időbélyegző magasrendű bitjeit. Egyetlen MCU-tól érkező üzenet sem lehet 2^31 órajelnél több a jövőben vagy a múltban, így ez az átalakítás soha nem félreérthető. A gazdagép a 64 bites órajelekről 32 bites órajelekre konvertál a magasrendű bitek egyszerű lefaragásával. Annak érdekében, hogy ez az átalakítás ne legyen kétértelmű, a **klippy/chelper/serialqueue.c** kód addig puffereli az üzeneteket, amíg azok 2^31 órajelen belül vannak a célidőhöz képest.
zh_hans: 32位和64位时钟：为了降低带宽消耗和提高微控制器效率，微控制器时钟使用32位整形进行追踪。在微控制器代码中对比两个时钟时，应保持调用`time_is_before`以确定整形时钟没有出现溢出的情况。上位机软件通过将微控制器最后一次返回的时间戳累加到主机代码时钟的高位地址中，以实现32位时钟到64位时钟的转换，由于来自微控制器的信息不可能来自2^31个时间刻度的过去或未来，因此时间转换不会出现错误。主机通过简单截断高位中的值，实现64位到32位的转换。为了确保转换没有歧义，**klippy/chelper/serialqueque.c**代码会缓存信息直到代码目标时间的2^31个时间刻度内。

source: Multiple micro-controllers: The host software supports using multiple micro-controllers on a single printer. In this case, the "MCU clock" of each micro-controller is tracked separately. The clocksync.py code handles clock drift between micro-controllers by modifying the way it converts from "print time" to "MCU clock". On secondary mcus, the mcu frequency that is used in this conversion is regularly updated to account for measured drift.
hu: Több mikrovezérlő: A gazdaszoftver támogatja több mikrovezérlő használatát egyetlen nyomtatón. Ebben az esetben minden mikrokontroller "MCU órajelét" külön-külön követi. A clocksync.py kód kezeli a mikrovezérlők közötti óraeltolódást a "nyomtatási időről" az "MCU órára" történő átalakítás módjának módosításával. A másodlagos MCU-nál az ebben az átalakításban használt MCU frekvencia rendszeresen frissül, hogy figyelembe vedd a mért csúszást.
zh_hans: 复数微控制器的情况：上位机软件支持单体打印机使用复数微控制器。此时，各微控制器的“微控制器时钟”将被分开记录。clocksync.py处理微处理器之间的时间飘变，方法在“打印时间”和“微处理器时间”的转换方法上修改得出。在次要微处理上，微处理器频率被用于上述处理，并通过持续测量漂变对次要微控制器频率进行更新。

source: Code overview
hu: Kód áttekintése
zh_hans: 代码总览

source: The "mcu" position (`stepper.get_mcu_position()` in the code) is the total number of steps the micro-controller has issued in a positive direction minus the number of steps issued in a negative direction since the micro-controller was last reset. If the robot is in motion when the query is issued then the reported value includes moves buffered on the micro-controller, but does not include moves on the look-ahead queue.
hu: Az "MCU" pozíció (`stepper.get_mcu_position()` a kódban) a mikrokontroller által pozitív irányban kiadott lépések száma mínusz a mikrokontroller utolsó resetelése óta negatív irányban kiadott lépések száma. Ha a gép a lekérdezéskor mozgásban van, akkor a jelentett érték tartalmazza a mikrokontrollerben pufferelt lépéseket, de nem tartalmazza a look-ahead sorban lévő lépéseket.
zh_hans: “微控制器位置”（`stepper.get_mcu_position()`）是微控制器最后一次重置后执行的“正向”步数总数 - “负向”步数总数的值。如果设备处于机械运动时，该方法将返回包含运动缓冲区中的位置值，但不包含预计队列中的运动值。

source: Add support for timer dispatch from hardware interrupts. See Klipper [commit 970831ee](https://github.com/Klipper3d/klipper/commit/970831ee0d3b91897196e92270d98b2a3067427f) as an example of steps 1-5 done for the LPC176x architecture.
hu: A hardveres megszakításokból történő időzítő küldés támogatásának hozzáadása. Lásd a Klipper [commit 970831ee](https://github.com/Klipper3d/klipper/commit/970831ee0d3b91897196e92270d98b2a3067427f) példáját az LPC176x architektúra 1-5. lépéseivel.
zh_hans: 增加对硬件中断的定时器调度的支持。参见 Klipper [commit 970831ee](https://github.com/Klipper3d/klipper/commit/970831ee0d3b91897196e92270d98b2a3067427f)，作为针对LPC176x架构的步骤1-5的例子。

source: Bring up basic GPIO input and output support. See Klipper [commit c78b9076](https://github.com/Klipper3d/klipper/commit/c78b90767f19c9e8510c3155b89fb7ad64ca3c54) as an example of this.
hu: Alapvető GPIO bemeneti és kimeneti támogatás megjelenítése. Lásd a Klipper [commit c78b9076](https://github.com/Klipper3d/klipper/commit/c78b90767f19c9e8510c3155b89fb7ad64ca3c54) példáját erre.
zh_hans: 提供基本的 GPIO 输入和输出支持。参见 Klipper [commit c78b9076](https://github.com/Klipper3d/klipper/commit/c78b90767f19c9e8510c3155b89fb7ad64ca3c54) 作为一个例子。

source: Bring up additional peripherals - for example see Klipper commit [65613aed](https://github.com/Klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e773a02ef3c27), [c812a40a](https://github.com/Klipper3d/klipper/commit/c812a40a3782415e454b04bf7bd2158a6f0ec8b5), and [c381d03a](https://github.com/Klipper3d/klipper/commit/c381d03aad5c3ee761169b7c7bced519cc14da29).
hu: További perifériák felhozása. Lásd például a Klipper megbízásokat [65613aed](https://github.com/Klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e773a02ef3c27), [c812a40a](https://github.com/Klipper3d/klipper/commit/c812a40a3782415e454b04bf7bd2158a6f0ec8b5) és [c381d03a](https://github.com/Klipper3d/klipper/commit/c381d03aad5c3ee761169b7c7bced519cc14da29).
zh_hans: 启动其他外围设备-参阅Klipper提交[65613aed](https://github.com/Klipper3d/klipper/commit/65613aeddfb9ef86905cb1dade9e773a02ef3c27)，[c812a40a](https://github.com/Klipper3d/klipper/commit/c812a40a3782415e454b04bf7bd2158a6f0ec8b5)，和[c381d03a](https://github.com/Klipper3d/klipper/commit/c381d03aad5c3ee761169b7c7bced519cc14da29)的例子。

source: If the printer object defines a `get_status()` method then the module can export [status information](Status_Reference.md) via [macros](Command_Templates.md) and via the [API Server](API_Server.md). The `get_status()` method must return a Python dictionary with keys that are strings and values that are integers, floats, strings, lists, dictionaries, True, False, or None. Tuples (and named tuples) may also be used (these appear as lists when accessed via the API Server). Lists and dictionaries that are exported must be treated as "immutable" - if their contents change then a new object must be returned from `get_status()`, otherwise the API Server will not detect those changes.
hu: Ha a nyomtató objektum definiál egy `get_status()` metódust, akkor a modul [állapotinformációt](Status_Reference.md) exportálhat a [makrókon](Command_Templates.md) és az [API Szerveren](API_Server.md) keresztül. A `get_status()` metódusnak egy Python szótárat kell visszaadnia, amelynek kulcsai karakterláncok, értékei pedig egész számok, lebegő számok, karakterláncok, listák, szótárak, True, False vagy None. Használhatók tuplik (és nevesített tuplik) is (ezek az API-kiszolgálón keresztül történő eléréskor listaként jelennek meg). Az exportált "immutable" listákat és szótárakat. Ha tartalmuk megváltozik, akkor egy új objektumot kell visszaküldeni a `get_status()` parancsból, különben az API-kiszolgáló nem fogja észlelni a változásokat.
zh_hans: 如果打印机对象中定义了 `get_status()` 方法，则在模块中可以通过[宏](Command_Templates.md)或[API服务](API_Server.md)输出[状态信息](Status_Reference.md)。 `get_status()` 必须返回一个Python字典对象，其键需要为字符串，而值应为整形、浮点数、列表、字典、True、False或者None。元组（或命名元组）也可以作为值（它们在API服务中将被视为列表）。列表和字典的输出值必须为“不可变的（immutable）”，即在函数内，如果 `get_status()` 需要输出上述类型的实例，则需要新建或者进行深层复制，否则API服务会识别出输出值中的内容变更。
