Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Config_checks.po
Languages: cs

source: This document provides a list of steps to help confirm the pin settings in the Klipper printer.cfg file. It is a good idea to run through these steps after following the steps in the [installation document](Installation.md).
cs: Tento dokument obsahuje seznam kroků, které vám pomohou potvrdit nastavení pinů v souboru Klipper printer.cfg. Je dobré si projít tyto kroky po provedení kroků v [ instalační dokument]( Installation .md).

source: During this guide, it may be necessary to make changes to the Klipper config file. Be sure to issue a RESTART command after every change to the config file to ensure that the change takes effect (type "restart" in the Octoprint terminal tab and then click "Send"). It's also a good idea to issue a STATUS command after every RESTART to verify that the config file is successfully loaded.
cs: Během této příručky může být nutné provést změny v konfiguračním souboru Klipper . Ujistěte se, že po každé změně konfiguračního souboru vydáte příkaz RESTART , abyste zajistili, že se změna projeví ( na kartě terminálu Octoprint zadejte " restart " a poté klikněte na "Odeslat"). Je také dobré po každém RESTARTU zadat příkaz STATUS , abyste ověřili, že byl konfigurační soubor úspěšně načten.

source: Verify temperature
cs: Ověřte teplotu

source: Start by verifying that temperatures are being properly reported. Navigate to the Octoprint temperature tab.
cs: Začněte tím, že si ověříte, že jsou teploty správně hlášeny. Přejděte na kartu teploty Octoprint .

source: ![octoprint-temperature](img/octoprint-temperature.png)
cs: ! [oktotisk-teplota] (img/octoprint-teplota.png)

source: Verify that the temperature of the nozzle and bed (if applicable) are present and not increasing. If it is increasing, remove power from the printer. If the temperatures are not accurate, review the "sensor_type" and "sensor_pin" settings for the nozzle and/or bed.
cs: Ověřte, že teplota trysky a lože (je-li k dispozici) je přítomna a nezvyšuje se. Pokud se zvyšuje, odpojte napájení tiskárny. Pokud teploty nejsou přesné, zkontrolujte nastavení „sensor_type“ a „sensor_pin“ pro trysku a/nebo lože.

source: Verify M112
cs: Ověřte M112

source: Navigate to the Octoprint terminal tab and issue an M112 command in the terminal box. This command requests Klipper to go into a "shutdown" state. It will cause Octoprint to disconnect from Klipper - navigate to the Connection area and click on "Connect" to cause Octoprint to reconnect. Then navigate to the Octoprint temperature tab and verify that temperatures continue to update and the temperatures are not increasing. If temperatures are increasing, remove power from the printer.
cs: Přejděte na kartu Terminál Octoprint a zadejte příkaz M112 ve svorkovnici. Tento příkaz požaduje , aby Klipper přešel do stavu „vypnutí“. Způsobí to odpojení Octoprint od Klipper – přejděte do oblasti Připojení a klikněte na „Připojit“, aby se Octoprint znovu připojil. Poté přejděte na kartu teploty Octoprint a ověřte, zda se teploty nadále aktualizují a teploty se nezvyšují. Pokud se teploty zvyšují, odpojte napájení tiskárny.

source: The M112 command causes Klipper to go into a "shutdown" state. To clear this state, issue a FIRMWARE_RESTART command in the Octoprint terminal tab.
cs: Příkaz M112 způsobí , že Klipper přejde do stavu „vypnutí“. Chcete-li tento stav vymazat, zadejte příkaz FIRMWARE_RESTART na kartě terminálu Octoprint .

source: Verify heaters
cs: Ověření ohřívačů

source: Navigate to the Octoprint temperature tab and type in 50 followed by enter in the "Tool" temperature box. The extruder temperature in the graph should start to increase (within about 30 seconds or so). Then go to the "Tool" temperature drop-down box and select "Off". After several minutes the temperature should start to return to its initial room temperature value. If the temperature does not increase then verify the "heater_pin" setting in the config.
cs: Přejděte na kartu teploty Octoprint a zadejte 50 a poté zadejte do pole teploty "Nástroj". Teplota extrudéru v grafu by se měla začít zvyšovat (asi do 30 sekund). Poté přejděte do rozevíracího pole teploty „Nástroj“ a vyberte „Vypnuto“. Po několika minutách by se teplota měla začít vracet na původní hodnotu pokojové teploty. Pokud se teplota nezvýší, ověřte nastavení "heater_pin" v konfiguraci.

source: If the printer has a heated bed then perform the above test again with the bed.
cs: Pokud má tiskárna vyhřívané lůžko, proveďte výše uvedený test znovu s lůžkem.

source: Verify stepper motor enable pin
cs: Ověřte aktivační kolík krokového motoru

source: Verify that all of the printer axes can manually move freely (the stepper motors are disabled). If not, issue an M84 command to disable the motors. If any of the axes still can not move freely, then verify the stepper "enable_pin" configuration for the given axis. On most commodity stepper motor drivers, the motor enable pin is "active low" and therefore the enable pin should have a "!" before the pin (for example, "enable_pin: !ar38").
cs: Ověřte, že se všechny osy tiskárny mohou ručně volně pohybovat (krokové motory jsou deaktivovány). Pokud ne, zadejte příkaz M84 k deaktivaci motorů. Pokud se některá z os stále nemůže volně pohybovat, ověřte konfiguraci krokového ovladače "enable_pin" pro danou osu. Na většině běžných ovladačů krokových motorů je kolík aktivace motoru "aktivní nízko" a proto by měl mít kolík "!" před pin (například "enable_pin: !ar38").

source: Verify endstops
cs: Ověření koncovek

source: Manually move all the printer axes so that none of them are in contact with an endstop. Send a QUERY_ENDSTOPS command via the Octoprint terminal tab. It should respond with the current state of all of the configured endstops and they should all report a state of "open". For each of the endstops, rerun the QUERY_ENDSTOPS command while manually triggering the endstop. The QUERY_ENDSTOPS command should report the endstop as "TRIGGERED".
cs: Ručně posuňte všechny osy tiskárny tak, aby žádná z nich nebyla v kontaktu s koncovým dorazem. Odešlete příkaz QUERY_ENDSTOPS přes kartu terminálu Octoprint. Měl by reagovat aktuálním stavem všech nakonfigurovaných koncových zarážek a všechny by měly hlásit stav „otevřeno“. Pro každou z koncových zarážek znovu spusťte příkaz QUERY_ENDSTOPS a ručně spusťte koncovou zarážku. Příkaz QUERY_ENDSTOPS by měl hlásit koncovou zastávku jako "TRIGGERED".

source: If the endstop appears inverted (it reports "open" when triggered and vice-versa) then add a "!" to the pin definition (for example, "endstop_pin: ^!ar3"), or remove the "!" if there is already one present.
cs: Pokud se endstop jeví jako inverzní (při spuštění hlásí "open" a naopak), přidejte k definici pinu "!" (například "endstop_pin: ^!ar3") nebo odstraňte "!", pokud je již přítomen.

source: If the endstop does not change at all then it generally indicates that the endstop is connected to a different pin. However, it may also require a change to the pullup setting of the pin (the '^' at the start of the endstop_pin name - most printers will use a pullup resistor and the '^' should be present).
cs: Pokud se koncová zarážka vůbec nezmění, obecně to znamená, že koncová zarážka je připojena k jinému kolíku. Může však také vyžadovat změnu nastavení pullup pinu ('^' na začátku názvu endstop_pin - většina tiskáren bude používat pullup rezistor a '^' by mělo být přítomno).

source: Verify stepper motors
cs: Ověřte krokové motory

source: Use the STEPPER_BUZZ command to verify the connectivity of each stepper motor. Start by manually positioning the given axis to a midway point and then run `STEPPER_BUZZ STEPPER=stepper_x`. The STEPPER_BUZZ command will cause the given stepper to move one millimeter in a positive direction and then it will return to its starting position. (If the endstop is defined at position_endstop=0 then at the start of each movement the stepper will move away from the endstop.) It will perform this oscillation ten times.
cs: Pomocí příkazu STEPPER_BUZZ ověřte konektivitu každého krokového motoru. Začněte ručním umístěním dané osy do středního bodu a poté spusťte `STEPPER_BUZZ STEPPER=stepper_x`. Příkaz STEPPER_BUZZ způsobí, že se daný stepper posune o jeden milimetr kladným směrem a poté se vrátí do výchozí polohy. (Pokud je koncová zarážka definována jako position_endstop=0, pak se na začátku každého pohybu stepper odkloní od koncové zarážky.) Tuto oscilaci provede desetkrát.

source: If the stepper does not move at all, then verify the "enable_pin" and "step_pin" settings for the stepper. If the stepper motor moves but does not return to its original position then verify the "dir_pin" setting. If the stepper motor oscillates in an incorrect direction, then it generally indicates that the "dir_pin" for the axis needs to be inverted. This is done by adding a '!' to the "dir_pin" in the printer config file (or removing it if one is already there). If the motor moves significantly more or significantly less than one millimeter then verify the "rotation_distance" setting.
cs: Pokud se stepper vůbec nepohybuje, ověřte nastavení "enable_pin" a "step_pin" pro stepper. Pokud se krokový motor pohybuje, ale nevrátí se do své původní polohy, ověřte nastavení "dir_pin". Pokud krokový motor kmitá nesprávným směrem, pak to obecně znamená, že "dir_pin" pro osu je třeba převrátit. To se provádí přidáním '!' na "dir_pin" v konfiguračním souboru tiskárny (nebo jej odstraňte, pokud tam již nějaký je). Pokud se motor pohybuje výrazně více nebo výrazně méně než jeden milimetr, ověřte nastavení "rotation_distance".

source: Run the above test for each stepper motor defined in the config file. (Set the STEPPER parameter of the STEPPER_BUZZ command to the name of the config section that is to be tested.) If there is no filament in the extruder then one can use STEPPER_BUZZ to verify the extruder motor connectivity (use STEPPER=extruder). Otherwise, it's best to test the extruder motor separately (see the next section).
cs: Spusťte výše uvedený test pro každý krokový motor definovaný v konfiguračním souboru. (Nastavte parametr STEPPER příkazu STEPPER_BUZZ na název konfigurační sekce, která má být testována.) Pokud v extruderu není žádné vlákno, můžete použít STEPPER_BUZZ k ověření připojení motoru extrudéru (použijte STEPPER=extruder). V opačném případě je nejlepší vyzkoušet motor extrudéru samostatně (viz další část).

source: After verifying all endstops and verifying all stepper motors the homing mechanism should be tested. Issue a G28 command to home all axes. Remove power from the printer if it does not home properly. Rerun the endstop and stepper motor verification steps if necessary.
cs: Po ověření všech koncových dorazů a ověření všech krokových motorů by měl být otestován naváděcí mechanismus. Zadejte příkaz G28 pro návrat všech os. Pokud není tiskárna správně připojena, odpojte napájení. V případě potřeby zopakujte kroky ověření koncového dorazu a krokového motoru.

source: Verify extruder motor
cs: Ověřte motor extruderu

source: To test the extruder motor it will be necessary to heat the extruder to a printing temperature. Navigate to the Octoprint temperature tab and select a target temperature from the temperature drop-down box (or manually enter an appropriate temperature). Wait for the printer to reach the desired temperature. Then navigate to the Octoprint control tab and click the "Extrude" button. Verify that the extruder motor turns in the correct direction. If it does not, see the troubleshooting tips in the previous section to confirm the "enable_pin", "step_pin", and "dir_pin" settings for the extruder.
cs: Pro testování motoru extrudéru bude nutné zahřát extrudér na tiskovou teplotu. Přejděte na kartu Octoprint teplota a vyberte cílovou teplotu z rozevíracího pole teploty (nebo ručně zadejte vhodnou teplotu). Počkejte, až tiskárna dosáhne požadované teploty. Poté přejděte na kartu ovládání Octoprint a klikněte na tlačítko "Extrude". Ověřte, že se motor extrudéru otáčí správným směrem. Pokud ne, podívejte se na tipy pro odstraňování problémů v předchozí části a potvrďte nastavení „enable_pin“, „step_pin“ a „dir_pin“ pro extruder.

source: Calibrate PID settings
cs: Kalibrace nastavení PID

source: To calibrate the extruder, navigate to the OctoPrint terminal tab and run the PID_CALIBRATE command. For example: `PID_CALIBRATE HEATER=extruder TARGET=170`
cs: Chcete-li kalibrovat extruder, přejděte na kartu terminálu OctoPrint a spusťte příkaz PID_CALIBRATE. Například: `PID_CALIBRATE HEATER=extruder TARGET=170`

source: At the completion of the tuning test run `SAVE_CONFIG` to update the printer.cfg file the new PID settings.
cs: Po dokončení testu ladění spusťte `SAVE_CONFIG` a aktualizujte soubor printer.cfg na nové nastavení PID.

source: If the printer has a heated bed and it supports being driven by PWM (Pulse Width Modulation) then it is recommended to use PID control for the bed. (When the bed heater is controlled using the PID algorithm it may turn on and off ten times a second, which may not be suitable for heaters using a mechanical switch.) A typical bed PID calibration command is: `PID_CALIBRATE HEATER=heater_bed TARGET=60`
cs: Pokud má tiskárna vyhřívané lůžko a podporuje řízení pomocí PWM (Pulse Width Modulation), pak se doporučuje použít pro lůžko PID řízení. (Když je ohřívač postele řízen pomocí algoritmu PID, může se zapnout a vypnout desetkrát za sekundu, což nemusí být vhodné pro ohřívače používající mechanický spínač.) Typický příkaz pro kalibraci PID lůžka je: `PID_CALIBRATE HEATER=heater_bed CÍL=60`

source: Next steps
cs: Další kroky

source: This guide is intended to help with basic verification of pin settings in the Klipper configuration file. Be sure to read the [bed leveling](Bed_Level.md) guide. Also see the [Slicers](Slicers.md) document for information on configuring a slicer with Klipper.
cs: Tato příručka má pomoci se základním ověřením nastavení pinů v konfiguračním souboru Klipper. Nezapomeňte si přečíst průvodce [vyrovnání postele](Bed_Level.md). Viz také dokument [Slicers](Slicers.md) pro informace o konfiguraci sliceru pomocí Klipperu.

source: After one has verified that basic printing works, it is a good idea to consider calibrating [pressure advance](Pressure_Advance.md).
cs: Poté, co si ověříte, že základní tisk funguje, je dobré zvážit kalibraci [pressure advance] (Pressure_Advance.md).

source: It may be necessary to perform other types of detailed printer calibration - a number of guides are available online to help with this (for example, do a web search for "3d printer calibration"). As an example, if you experience the effect called ringing, you may try following [resonance compensation](Resonance_Compensation.md) tuning guide.
cs: Může být nutné provést další typy podrobné kalibrace tiskárny – online je k dispozici řada příruček, které vám s tím pomohou (například vyhledejte na webu „kalibrace 3D tiskárny“). Pokud například zaznamenáte efekt zvaný zvonění, můžete zkusit postupovat podle průvodce laděním [kompenzace rezonance](Resonance_Compensation.md).

source: Configuration checks
cs: Kontroly konfigurace

source: Klipper supports [PID control](https://en.wikipedia.org/wiki/PID_controller) for the extruder and bed heaters. In order to use this control mechanism, it is necessary to calibrate the PID settings on each printer (PID settings found in other firmwares or in the example configuration files often work poorly).
cs: Klipper podporuje [PID ovládání](https://en.wikipedia.org/wiki/PID_controller) pro extruder a ohřívače lože. Aby bylo možné použít tento kontrolní mechanismus, je nutné zkalibrovat nastavení PID na každé tiskárně (nastavení PID nalezená v jiných firmwarech nebo v příkladech konfiguračních souborů často fungují špatně).
