Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Contact.po
Languages: de, es

source: This document provides contact information for Klipper.
de: Dieses Dokument stellt Kontaktinformationen für Klipper zur Verfügung.
es: Este documento provee información de contacto para Klipper.

source: [Community Forum](#community-forum)
es: [Foro Comunitario](#community-forum)

source: [Discord Chat](#discord-chat)
es: [Chat de Discord](#discord-chat)

source: [I have a question about Klipper](#i-have-a-question-about-klipper)
de: [Ich habe eine Frage bzgl. Klipper](#i-have-a-question-about-klipper)
es: [Tengo una pregunta sobre Klipper](#i-have-a-question-about-klipper)

source: [I have a feature request](#i-have-a-feature-request)
de: [Ich habe eine Feature-Anfrage](#i-have-a-feature-request)
es: [Tengo un sugerencia sobre funcionalidades](#i-have-a-feature-request)

source: [Help! It doesn't work!](#help-it-doesnt-work)
de: [Hilfe! Es funktioniert nicht!](#help-it-doesnt-work)
es: [¡Ayuda! ¡No funciona!](#help-it-doesnt-work)

source: [I have diagnosed a defect in the Klipper software](#i-have-diagnosed-a-defect-in-the-klipper-software)
de: [Ich habe einen Defekt in der Klipper-Software diagnostiziert](#i-have-diagnosed-a-defect-in-the-klipper-software)
es: [He diagnosticado un defecto en software de Klipper](#i-have-diagnosed-a-defect-in-the-klipper-software)

source: [I am making changes that I'd like to include in Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)
de: [Ich mache Änderungen, die ich gerne in Klipper einbringen möchte](#i-am-making-changes-that-id-like-to-include-in-klipper)
es: [He realizado cambios que me gustaría añadir a Klipper](#i-am-making-changes-that-id-like-to-include-in-klipper)

source: Community Forum
es: Foro Comunitario

source: There is a [Klipper Community Discourse server](https://community.klipper3d.org) for discussions on Klipper.
de: Es gibt einen [Klipper Community Diskurs-Server](https://community.klipper3d.org) für Diskussionen über Klipper.
es: Hay un [servidor comunitario de Discourse para Klipper](https://community.klipper3d.org) para discutir sobre Klipper.

source: Discord Chat
es: Chat de Discord

source: This server is run by a community of Klipper enthusiasts dedicated to discussions on Klipper. It allows users to chat with other users in real-time.
de: Dieser Server wird von einer Community aus Klipper-Enthusiasten für Diskussionen über Klipper betrieben. Hiermit wird Nutzern ermöglicht, mit anderen in Echtzeit zu chatten.
es: Este servidor es administrado por una comunidad de entusiastas de Klipper dedicados a conversar sobre Klipper. Permite a los usuarios chatear con otros usuario en tiempo real.

source: I have a question about Klipper
de: Ich habe eine Frage über Klipper
es: Tengo una pregunta sobre Klipper

source: Many questions we receive are already answered in the [Klipper documentation](Overview.md). Please be sure to to read the documentation and follow the directions provided there.
de: Viele Fragen, die wir erhalten, sind bereits in der [Klipper Dokumentation](Overview.md) beantwortet. Bitte lies zuerst die Dokumentation und folge den Anweisungen in dieser.
es: Muchas de las preguntas que recibimos ya están respondiddas en la [documentación de Klipper](Overview.md). Por favor, asegúrese de leer la documentación y seguir las instrucciones que allí se indican.

source: It is also possible to search for similar questions in the [Klipper Community Forum](#community-forum).
de: Es ist auch möglich, nach ähnlichen Fragen im [Klipper Community Forum](#community-forum) zu suchen.
es: Es posible buscar preguntas similares en el [Foro Comunitario de Klipper](#community-forum).

source: Do not open a Klipper github issue to ask a question.
de: Öffne kein Klipper-GitHub-Issue, um eine Frage zu stellen.
es: No crees una Issue (reporte de problemas) en el GitHub de Klipper para realizar una pregunta.

source: I have a feature request
de: Ich habe eine Feature-Anfrage
es: Tengo una sugerencia para una nueva funcionalidad

source: All new features require someone interested and able to implement that feature. If you are interested in helping to implement or test a new feature, you can search for ongoing developments in the [Klipper Community Forum](#community-forum). There is also [Klipper Discord Chat](#discord-chat) for discussions between collaborators.
de: Alle neuen Features benötigen eine Person, die sich für dieses interessiert und implementiert. Wenn du Interesse daran hast, ein neues Feature zu implementieren oder zu testen, kannst du nach sich im Entwicklungsstadium befindenen Features im [Klipper Community Forum](#community-forum) erkundigen. Ebenfalls gibt es einen [Klipper Discord Chat](#discord-chat) für Diskussionen zwischen Mitbearbeitern.
es: Todas las nuevas funcionalidades requieren que alguien esté interesado y sea capaz de implementarlas. Si estás interesado en ayudar a implementar o probar una nueva funcionalidad, puedes buscar desarrollos que se están llevando a cabo ahora mismo en el [Foro Comunitario de Klipper](#community-forum). También hay un [Chat de Discord para Klipper](#discord-chat) para conversaciones entre colaboradores.

source: Do not open a Klipper github issue to request a feature.
de: Öffne kein Klipper-GitHub-Issue, um ein neues Feature anzufragen.
es: No abráis un fallo en el GitHub de Klipper para pedir una nueva funcionalidad.

source: Help! It doesn't work!
de: Hilfe! Es funktioniert nicht!
es: ¡Ayuda! ¡Esto no funciona!

source: Unfortunately, we receive many more requests for help than we could possibly answer. Most problem reports we see are eventually tracked down to:
de: Leider erhalten wir viel mehr Hilfeanfragen, als wir beantworten können. Die meisten gemeldeten Probleme führen auf folgende Ursachen hin:
es: Desafortunadamente, recibimos muchísimas más peticiones de ayuda de las que posiblemente podamos responder. La mayoría de los reportes de problemas que vemos se achican eventualmente a:

source: Subtle errors in the hardware, or
de: Kleine Fehler in der Hardware, oder
es: Errores sutiles en el hardware, o

source: Not following all the steps described in the Klipper documentation.
de: Das Nichtbefolgen aller Schritte, wie sie in der Klipper-Dokumentation beschrieben sind.
es: No seguir todos los pasos descritos en la documentación de Klipper.

source: If you are experiencing problems we recommend you carefully read the [Klipper documentation](Overview.md) and double check that all steps were followed.
de: Wenn bei dir Probleme auftreten, empfehlen wir, dass du zunächst gründlich die [Klipper-Dokumentation](Overview.md) liest und prüfst, ob alle Schritte richtig befolgt wurden.
es: Si estás experimentando problemas le recomendamos que lea cuidadosamente la [documentación de Klipper](Overview.md) y verifique por segunda vez que sigue todos los pasos.

source: It is also possible to search for similar issues in the [Klipper Community Forum](#community-forum).
de: Es ist außerdem möglich, das [Klipper Community Forum](#community-forum) nach ähnlichen Fragen bzw. Problemen zu durchsuchen.
es: También es posible buscar problemas similares en el [Foro de la Comunidad de Klipper](#community-forum).

source: Do not open a Klipper github issue to request help.
de: Öffne kein Klipper-GitHub-Issue um Hilfe anzufragen.
es: No abráis un fallo en el GitHub de Klipper para pedir ayuda.

source: I have diagnosed a defect in the Klipper software
de: Ich habe einen Defekt in der Klipper-Software diagnostiziert
es: He diagnosticado un defecto en el software de Klipper

source: Klipper is an open-source project and we appreciate when collaborators diagnose errors in the software.
de: Klipper ist ein open-source Projekt und wir freuen uns sehr, wenn Mitbearbeiter Fehler in der Software diagnostizieren.
es: Klipper es un proyecto de código libre y apreciamos cuando colaboradores diagnostican errores en el software.

source: There is important information that will be needed in order to fix a bug. Please follow these steps:
de: Wichtige Informationen werden benötigt, um einen Fehler zu beheben. Bitte befolge die folgenden Schritte:
es: Hay información importante que será necesaria para poder arreglar un error. Por favor siga los siguientes pasos:

source: The Klipper log file is located in `/tmp/klippy.log` on the Klipper "host" computer (the Raspberry Pi).
es: El archivo de registro de Klipper está localizado en `/tmp/klippy.log`en el ordenador "anfitrión" de Klipper (la Raspberry PI).

source: Copy the log file to your desktop so that it can be attached to an issue report.
es: Copia el archivo de registro a tu escritorio de tal manera que pueda ser adjuntado a su reporte de errores.

source: Do not modify the log file in any way; do not provide a snippet of the log. Only the full unmodified log file provides the necessary information.
es: No modifique el archivo de registro de ninguna forma; no provea un cacho del registro. Solamente el archivo de registro completo y sin modificar provee la información necesaria.

source: If the log file is very large (eg, greater than 2MB) then one may need to compress the log with zip or gzip.
es: Si el archivo de registro es muy grande (por ejemplo, mayor de 2MB de espacio) entonces uno puede necesitar comprimir el registro usando zip o gzip.

source: ![attach-issue](img/attach-issue.png)
es: ![adjuntar un reporte de errores](img/attach-issue.png)

source: I am making changes that I'd like to include in Klipper
es: Estoy realizando cambios que me gustaría que fueran incluidos en Klipper

source: Klipper is open-source software and we appreciate new contributions.
es: Klipper es un software de código libre y apreciamos nuevos contribuidores.

source: New contributions (for both code and documentation) are submitted via Github Pull Requests. See the [CONTRIBUTING document](CONTRIBUTING.md) for important information.
es: Nuevas contribuciones (tanto para código como documentación) son presentadas mediante Pull Requests de GitHub. Mirese el documento [CONTRIBUYENDO](CONTRIBUTING.md) para más información importante.

source: Contact
es: Contacto

source: There is a Discord server dedicated to Klipper at: <https://discord.klipper3d.org>.
es: Existe un servidor de Discord dedicado a Klipper en: <https://discord.klipper3d.org>.

source: If you are interested in sharing your knowledge and experience with other Klipper users then you can join the [Klipper Community Forum](#community-forum) or [Klipper Discord Chat](#discord-chat). Both are communities where Klipper users can discuss Klipper with other users.
de: Wenn du Interesse daran hast, dein Wissen und deine Erfahrung mit anderen Klipper-Nutzern zu teilen, kannst du dem [Klipper Community Forum](#community-forum) oder dem [Klipper Discord Chat](#discord-chat) beitreten. Beide sind Communities, wo Klipper-Nutzer mit anderen über Klipper diskutieren können.

source: Many questions we receive are general 3d-printing questions that are not specific to Klipper. If you have a general question or are experiencing general printing problems, then you will likely get a better response by asking in a general 3d-printing forum or a forum dedicated to your printer hardware.
de: Viele Fragen, die wir erhalten, sind generelle 3D-Druck-Fragen, die nicht Klipper-spezifisch sind. Wenn Du eine generelle Frage hast oder generelle Probleme auftreten, erhältst du wahrscheinlich eine bessere Antwort, indem du in generellen 3D-Druck-Foren oder einem Forum, welches auf deine Druckhardware spezifiziert ist, fragst.

source: If you are experiencing a printing problem, then we recommend carefully inspecting the printer hardware (all joints, wires, screws, etc.) and verify nothing is abnormal. We find most printing problems are not related to the Klipper software. If you do find a problem with the printer hardware then you will likely get a better response by searching in a general 3d-printing forum or in a forum dedicated to your printer hardware.
de: Wenn bei dir Druckprobleme auftreten, empfehlen wir, dass du zunächst gründlich deine Druckerhardware (alle Verbindungen, Kabel, Schrauben, etc.) prüfst und sicherstellst, dass nichts abnormal ist. Die meisten Druckprobleme hängen nicht mit der Klipper-Software zusammen. Wenn du ein Problem mit der Druckerhardware finden solltest, kann dir höchstwahrscheinlich eine bessere Antwort geliefert werden, wenn du in einem generellen 3D-Druck-Forum oder in einem Forum, was auf deinen Drucker spezialisiert ist, fragst.

source: Be sure the bug is in the Klipper software. If you are thinking "there is a problem, I can't figure out why, and therefore it is a Klipper bug", then **do not** open a github issue. In that case, someone interested and able will need to first research and diagnose the root cause of the problem. If you would like to share the results of your research or check if other users are experiencing similar issues then you can search the [Klipper Community Forum](#community-forum).
de: Stell sicher, dass der Fehler in der Klipper-Software liegt. Wenn du denkst "Ich kann nicht herausfinden, warum das so ist, also ist es ein Klipper-Fehler", dann **öffne kein** GitHub-Issue. In dem Fall sollte dir zunächst jemand interessiertes und fähiges dabei helfen, die Wurzel des Fehlers zu finden. Wenn du deinen Fortschritt bei der Forschung nach der Wurzel teilen willst oder prüfen willst, ob andere Benutzer ein ähnliches Problem haben, kannst du das [Klipper Community Forum](#community-forum) durschsuchen.

source: If possible, run an `M112` command in the OctoPrint terminal window immediately after the undesirable event occurs. This causes Klipper to go into a "shutdown state" and it will cause additional debugging information to be written to the log file.
de: Wenn möglich, setze einen `M112`-Befehl im OctoPrint-Terminalfenster direkt nach dem Auftreten des Fehlers ab. Dies setzt Klipper in einen heruntergefahrenen Status, welcher weitere Debugginginformationen in die Logdatei schreibt.
