Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Debugging.po
Languages: it

source: This document describes some of the Klipper debugging tools.
it: Questo documento descrive alcuni degli strumenti di debug di Klipper.

source: Translating gcode files to micro-controller commands
it: Traduzione di file gcode in comandi del microcontrollore

source: The Klippy host code can run in a batch mode to produce the low-level micro-controller commands associated with a gcode file. Inspecting these low-level commands is useful when trying to understand the actions of the low-level hardware. It can also be useful to compare the difference in micro-controller commands after a code change.
it: Il codice host Klippy può essere eseguito in modalità batch per produrre i comandi del microcontrollore di basso livello associati a un file gcode. L'ispezione di questi comandi di basso livello è utile quando si cerca di comprendere le azioni dell'hardware di basso livello. Può anche essere utile confrontare la differenza nei comandi del microcontrollore dopo una modifica del codice.

source: To run Klippy in this batch mode, there is a one time step necessary to generate the micro-controller "data dictionary". This is done by compiling the micro-controller code to obtain the **out/klipper.dict** file:
it: Per eseguire Klippy in questa modalità batch, è necessario un passaggio per generare il "dizionario dati" del microcontrollore. Questo viene fatto compilando il codice del microcontrollore per ottenere il file **out/klipper.dict**:

source: Once the above is done it is possible to run Klipper in batch mode (see [installation](Installation.md) for the steps necessary to build the python virtual environment and a printer.cfg file):
it: Una volta fatto quanto sopra è possibile eseguire Klipper in modalità batch (vedi [installazione](Installation.md) per i passaggi necessari per costruire l'ambiente virtuale python e un file printer.cfg):

source: The above will produce a file **test.serial** with the binary serial output. This output can be translated to readable text with:
it: Quanto sopra produrrà un file **test.serial** con output seriale binario. Questo output può essere tradotto in testo leggibile con:

source: The resulting file **test.txt** contains a human readable list of micro-controller commands.
it: Il file risultante **test.txt** contiene un elenco leggibile di comandi del microcontrollore.

source: The batch mode disables certain response / request commands in order to function. As a result, there will be some differences between actual commands and the above output. The generated data is useful for testing and inspection; it is not useful for sending to a real micro-controller.
it: La modalità batch disabilita alcuni comandi di risposta/richiesta per funzionare. Di conseguenza, ci saranno alcune differenze tra i comandi effettivi e l'output sopra. I dati generati sono utili per il test e l'ispezione; non è utile per l'invio a un vero microcontrollore.

source: Testing with simulavr
it: Test con simulavr

source: The [simulavr](http://www.nongnu.org/simulavr/) tool enables one to simulate an Atmel ATmega micro-controller. This section describes how one can run test gcode files through simulavr. It is recommended to run this on a desktop class machine (not a Raspberry Pi) as it does require significant cpu to run efficiently.
it: Lo strumento [simulavr](http://www.nongnu.org/simulavr/) consente di simulare un microcontrollore Atmel ATmega. Questa sezione descrive come eseguire test di file gcode tramite simulavr. Si consiglia di eseguirlo su una macchina di classe desktop (non un Raspberry Pi) poiché richiede una CPU significativa per funzionare in modo efficiente.

source: To compile Klipper for use in simulavr, run:
it: Per compilare Klipper per l'uso in simulavr, eseguire:

source: Then, with simulavr running in another window, one can run the following to read gcode from a file (eg, "test.gcode"), process it with Klippy, and send it to Klipper running in simulavr (see [installation](Installation.md) for the steps necessary to build the python virtual environment):
it: Quindi, con simulavr in esecuzione in un'altra finestra, è possibile eseguire quanto segue per leggere gcode da un file (ad es. "test.gcode"), elaborarlo con Klippy e inviarlo a Klipper in esecuzione in simulavr (vedere [installazione](Installazione .md) per i passaggi necessari per costruire l'ambiente virtuale Python):

source: Using simulavr with gtkwave
it: Utilizzo di simulavr con gtkwave

source: One useful feature of simulavr is its ability to create signal wave generation files with the exact timing of events. To do this, follow the directions above, but run avrsim.py with a command-line like the following:
it: Una caratteristica utile di simulavr è la sua capacità di creare file di generazione di onde di segnale con l'esatta sincronizzazione degli eventi. Per fare ciò, segui le istruzioni sopra, ma esegui avrsim.py con una riga di comando come la seguente:

source: The above would create a file **avrsim.vcd** with information on each change to the GPIOs on PORTA and PORTB. This could then be viewed using gtkwave with:
it: Quanto sopra creerebbe un file **avrsim.vcd** con informazioni su ogni modifica ai GPIO su PORTA e PORTB. Questo potrebbe quindi essere visualizzato usando gtkwave con:

source: Manually sending commands to the micro-controller
it: Invio manuale di comandi al microcontrollore

source: Normally, the host klippy.py process would be used to translate gcode commands to Klipper micro-controller commands. However, it's also possible to manually send these MCU commands (functions marked with the DECL_COMMAND() macro in the Klipper source code). To do so, run:
it: Normalmente, il processo host klippy.py verrebbe utilizzato per tradurre i comandi gcode in comandi del microcontrollore Klipper. Tuttavia, è anche possibile inviare manualmente questi comandi MCU (funzioni contrassegnate con la macro DECL_COMMAND() nel codice sorgente di Klipper). Per farlo, esegui:

source: See the "HELP" command within the tool for more information on its functionality.
it: Vedere il comando "HELP" all'interno dello strumento per ulteriori informazioni sulla sua funzionalità.

source: Some command-line options are available. For more information run: `~/klippy-env/bin/python ./klippy/console.py --help`
it: Sono disponibili alcune opzioni della riga di comando. Per ulteriori informazioni esegui: `~/klippy-env/bin/python ./klippy/console.py --help`

source: Generating load graphs
it: Generare di grafici di carico

source: The Klippy log file (/tmp/klippy.log) stores statistics on bandwidth, micro-controller load, and host buffer load. It can be useful to graph these statistics after a print.
it: Il file di registro di Klippy (/tmp/klippy.log) memorizza le statistiche sulla larghezza di banda, sul carico del microcontrollore e sul carico del buffer dell'host. Può essere utile rappresentare graficamente queste statistiche dopo una stampa.

source: To generate a graph, a one time step is necessary to install the "matplotlib" package:
it: Per generare un grafico, è necessario un passaggio una tantum per installare il pacchetto "matplotlib":

source: Then graphs can be produced with:
it: Quindi i grafici possono essere prodotti con:

source: One can then view the resulting **loadgraph.png** file.
it: Si può quindi visualizzare il file **loadgraph.png** risultante.

source: Different graphs can be produced. For more information run: `~/klipper/scripts/graphstats.py --help`
it: Possono essere prodotti diversi grafici. Per ulteriori informazioni esegui: `~/klipper/scripts/graphstats.py --help`

source: Extracting information from the klippy.log file
it: Estrazione di informazioni dal file klippy.log

source: The Klippy log file (/tmp/klippy.log) also contains debugging information. There is a logextract.py script that may be useful when analyzing a micro-controller shutdown or similar problem. It is typically run with something like:
it: Anche il file di registro di Klippy (/tmp/klippy.log) contiene informazioni di debug. Esiste uno script logextract.py che può essere utile quando si analizza l'arresto di un microcontrollore o un problema simile. In genere viene eseguito con qualcosa come:

source: The script will extract the printer config file and will extract MCU shutdown information. The information dumps from an MCU shutdown (if present) will be reordered by timestamp to assist in diagnosing cause and effect scenarios.
it: Lo script estrarrà il file di configurazione della stampante ed estrarrà le informazioni di arresto dell'MCU. I dump delle informazioni da un arresto dell'MCU (se presente) verranno riordinati in base al timestamp per facilitare la diagnosi degli scenari di causa ed effetto.

source: Running the regression tests
it: Esecuzione dei test di regressione

source: The main Klipper GitHub repository uses "github actions" to run a series of regression tests. It can be useful to run some of these tests locally.
it: Il repository principale di Klipper GitHub utilizza "github actions" per eseguire una serie di test di regressione. Può essere utile eseguire alcuni di questi test in locale.

source: The source code "whitespace check" can be run with:
it: Il sorgente "controllo spazi bianchi" può essere eseguito con:

source: Motion analysis and data logging
it: Analisi del movimento e registrazione dei dati

source: Klipper supports logging its internal motion history, which can be later analyzed. To use this feature, Klipper must be started with the [API Server](API_Server.md) enabled.
it: Klipper supporta la registrazione della cronologia dei movimenti interni, che può essere analizzata in seguito. Per utilizzare questa funzione, Klipper deve essere avviato con [Server API](API_Server.md) abilitato.

source: Data logging is enabled with the `data_logger.py` tool. For example:
it: La registrazione dei dati è abilitata con lo strumento `data_logger.py`. Per esempio:

source: This command will connect to the Klipper API Server, subscribe to status and motion information, and log the results. Two files are generated - a compressed data file and an index file (eg, `mylog.json.gz` and `mylog.index.gz`). After starting the logging, it is possible to complete prints and other actions - the logging will continue in the background. When done logging, hit `ctrl-c` to exit from the `data_logger.py` tool.
it: Questo comando si collegherà al Klipper API Server, sottoscriverà le informazioni sullo stato e sul movimento e registrerà i risultati. Vengono generati due file: un file di dati compresso e un file di indice (ad esempio, `mylog.json.gz` e `mylog.index.gz`). Dopo aver avviato la registrazione, è possibile completare le stampe e altre azioni: la registrazione continuerà in background. Al termine della registrazione, premi `ctrl-c` per uscire dallo strumento `data_logger.py`.

source: The resulting files can be read and graphed using the `motan_graph.py` tool. To generate graphs on a Raspberry Pi, a one time step is necessary to install the "matplotlib" package:
it: I file risultanti possono essere letti e rappresentati graficamente utilizzando lo strumento `motan_graph.py`. Per generare grafici su un Raspberry Pi, è necessario un passaggio per installare il pacchetto "matplotlib":

source: However, it may be more convenient to copy the data files to a desktop class machine along with the Python code in the `scripts/motan/` directory. The motion analysis scripts should run on any machine with a recent version of [Python](https://python.org) and [Matplotlib](https://matplotlib.org/) installed.
it: Tuttavia, potrebbe essere più conveniente copiare i file di dati su una macchina di classe desktop insieme al codice Python nella directory `scripts/motan/`. Gli script di analisi del movimento dovrebbero essere eseguiti su qualsiasi macchina con una versione recente di [Python](https://python.org) e [Matplotlib](https://matplotlib.org/) installata.

source: Graphs can be generated with a command like the following:
it: I grafici possono essere generati con un comando come il seguente:

source: The list of available datasets can be found using the `-l` option - for example:
it: L'elenco dei set di dati disponibili può essere trovato usando l'opzione `-l`, ad esempio:

source: It is also possible to specify matplotlib plot options for each dataset:
it: È anche possibile specificare le opzioni di stampa matplotlib per ogni set di dati:

source: Many matplotlib options are available; some examples are "color", "label", "alpha", and "linestyle".
it: Sono disponibili molte opzioni di matplotlib; alcuni esempi sono "color", "label", "alpha" e "linestyle".

source: The `motan_graph.py` tool supports several other command-line options - use the `--help` option to see a list. It may also be convenient to view/modify the [motan_graph.py](../scripts/motan/motan_graph.py) script itself.
it: Lo strumento `motan_graph.py` supporta molte altre opzioni della riga di comando: usa l'opzione `--help` per vedere un elenco. Può anche essere conveniente visualizzare/modificare lo stesso script [motan_graph.py](../scripts/motan/motan_graph.py).

source: and compile the micro-controller software for an AVR atmega644p and select SIMULAVR software emulation support. Then one can compile Klipper (run `make`) and then start the simulation with:
it: e compilare il software del microcontrollore per un AVR atmega644p e selezionare il supporto per l'emulazione del software SIMULAVR. Quindi si può compilare Klipper (eseguire `make`) e quindi avviare la simulazione con:

source: The Klippy regression test suite requires "data dictionaries" from many platforms. The easiest way to obtain them is to [download them from github](https://github.com/Klipper3d/klipper/issues/1438). Once the data dictionaries are downloaded, use the following to run the regression suite:
it: La suite di test di regressione Klippy richiede "dizionari di dati" da molte piattaforme. Il modo più semplice per ottenerli è [scaricarli da github](https://github.com/Klipper3d/klipper/issues/1438). Una volta scaricati i dizionari di dati, utilizzare quanto segue per eseguire la suite di regressione:

source: The raw data logs produced by the `data_logger.py` tool follow the format described in the [API Server](API_Server.md). It may be useful to inspect the data with a Unix command like the following: `gunzip < mylog.json.gz | tr '\03' '\n' | less`
it: I log di dati grezzi prodotti dallo strumento `data_logger.py` seguono il formato descritto in [Server API](API_Server.md). Può essere utile ispezionare i dati con un comando Unix come il seguente: `gunzip < mylog.json.gz | tr '\03' '\n' | less`

source: To use simulavr, download the simulavr package and compile with python support. Note that the build system may need to have some packages (such as swig) installed in order to build the python module.
it: Per utilizzare simulavr, scarica il pacchetto simulavr e compila con il supporto python. Nota che il sistema di build potrebbe aver bisogno di alcuni pacchetti (come swig) installati per costruire il modulo python.

source: Make sure a file like **./build/pysimulavr/_pysimulavr.*.so** is present after the above compilation:
it: Assicurati che un file come **./build/pysimulavr/_pysimulavr.*.so** sia presente dopo la compilazione di cui sopra:

source: This commmand should report a specific file (e.g. **./build/pysimulavr/_pysimulavr.cpython-39-x86_64-linux-gnu.so**) and not an error.
it: Questo comando dovrebbe segnalare un file specifico (ad es. **./build/pysimulavr/_pysimulavr.cpython-39-x86_64-linux-gnu.so**) e non un errore.

source: If you are on a Debian-based system (Debian, Ubuntu, etc.) you can install the following packages and generate *.deb files for system-wide installation of simulavr:
it: Se utilizzi un sistema basato su Debian (Debian, Ubuntu, ecc.) puoi installare i seguenti pacchetti e generare file *.deb per l'installazione di simulavr a livello di sistema:

source: Note that if you have installed python3-simulavr system-wide, you do not need to set `PYTHONPATH`, and can simply run the simulator as
it: Nota che se hai installato python3-simulavr a livello di sistema, non è necessario impostare `PYTHONPATH` e puoi semplicemente eseguire il simulatore come
