Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Example_Configs.po
Languages: it

source: This document contains guidelines for contributing an example Klipper configuration to the Klipper github repository (located in the [config directory](../config/)).
it: Questo documento contiene le linee guida per contribuire a creare un esempio di configurazione di Klipper nella repository github di Klipper (situato nella [directory config](../config/)).

source: Note that the [Klipper Community Discourse server](https://community.klipper3d.org) is also a useful resource for finding and sharing config files.
it: Nota che il [server Klipper Community Discourse](https://community.klipper3d.org) è anche una risorsa utile per trovare e condividere file di configurazione.

source: Guidelines
it: Linee guida

source: The `generic` prefix is used for a 3d printer board that may be used in many different types of printers.
it: Il prefisso `generic` viene utilizzato per una scheda per stampante 3d che può essere utilizzata in molti diversi tipi di stampanti.

source: The `kit` prefix is for 3d printers that are assembled according to a widely used specification. These "kit" printers are generally distinct from normal "printers" in that they are not sold by a manufacturer.
it: Il prefisso `kit` è per le stampanti 3d assemblate secondo una specifica ampiamente utilizzata. Queste stampanti "kit" sono generalmente distinte dalle normali "stampanti" in quanto non sono vendute da un produttore.

source: The `sample` prefix is used for config "snippets" that one may copy-and-paste into the main config file.
it: Il prefisso `sample` viene utilizzato per i "ritagli" di configurazione che è possibile copiare e incollare nel file di configurazione principale.

source: The `example` prefix is used to describe printer kinematics. This type of config is typically only added along with code for a new type of printer kinematics.
it: Il prefisso `example` viene utilizzato per descrivere la cinematica della stampante. Questo tipo di configurazione viene in genere aggiunto solo insieme al codice per un nuovo tipo di cinematica della stampante.

source: Klipper must be able to start `printer`, `generic`, and `kit` example config file without error. These config files should be added to the [test/klippy/printers.test](../test/klippy/printers.test) regression test case. Add new config files to that test case in the appropriate section and in alphabetical order within that section.
it: Klipper deve essere in grado di avviare il file di configurazione di esempio `printer`, `generic` e `kit` senza errori. Questi file di configurazione devono essere aggiunti al test di regressione [test/klippy/printers.test](../test/klippy/printers.test). Aggiungi nuovi file di configurazione a quel test case nella sezione appropriata e in ordine alfabetico all'interno di quella sezione.

source: The example configuration should be for the "stock" configuration of the printer. (There are too many "customized" configurations to track in the main Klipper repository.) Similarly, we only add example config files for printers, kits, and boards that have mainstream popularity (eg, there should be at least a 100 of them in active use). Consider using the [Klipper Community Discourse server](https://community.klipper3d.org) for other configs.
it: La configurazione di esempio dovrebbe essere per la configurazione "stock" della stampante. (Ci sono troppe configurazioni "personalizzate" da tenere traccia nel repository principale di Klipper.) Allo stesso modo, aggiungiamo solo file di configurazione di esempio per stampanti, kit e schede che hanno la popolarità principale (ad esempio, dovrebbero essercene almeno 100 in uso attivo). Prendi in considerazione l'utilizzo del [server Klipper Community Discourse](https://community.klipper3d.org) per altre configurazioni.

source: Only specify those devices present on the given printer or board. Do not specify settings specific to your particular setup.For `generic` config files, only those devices on the mainboard should be described. For example, it would not make sense to add a display config section to a "generic" config as there is no way to know if the board will be attached to that type of display. If the board has a specific hardware port to facilitate an optional peripheral (eg, a bltouch port) then one can add a "commented out" config section for the given device.
it: Specificare solo quei dispositivi presenti sulla stampante o scheda. Non specificare impostazioni specifiche per la tua configurazione particolare. Per i file di configurazione `generici`, dovrebbero essere descritti solo quei dispositivi sulla scheda madre. Ad esempio, non avrebbe senso aggiungere una sezione di configurazione del display a una configurazione "generica" poiché non c'è modo di sapere se la scheda sarà collegata a quel tipo di display. Se la scheda ha una porta hardware specifica per facilitare una periferica opzionale (ad esempio una porta bltouch), è possibile aggiungere una sezione di configurazione "commentata" per il dispositivo specificato.

source: Do not specify `pressure_advance` in an example config, as that value is specific to the filament, not the printer hardware. Similarly, do not specify `max_extrude_only_velocity` nor `max_extrude_only_accel` settings.
it: Non specificare `pressure_advance` in una configurazione di esempio, poiché quel valore è specifico del filamento, non dell'hardware della stampante. Allo stesso modo, non specificare le impostazioni `max_extrude_only_velocity` né `max_extrude_only_accel`.

source: Do not specify a config section containing a host path or host hardware. For example, do not specify `[virtual_sdcard]` nor `[temperature_host]` config sections.
it: Non specificare una sezione di configurazione contenente un percorso host o hardware host. Ad esempio, non specificare le sezioni di configurazione `[virtual_sdcard]` né `[temperature_host]`.

source: Only define macros that utilize functionality specific to the given printer or to define g-codes that are commonly emitted by slicers configured for the given printer.
it: Definire solo le macro che utilizzano funzionalità specifiche per la stampante specificata o per definire i G-code comunemente emessi dagli slicer configurati per la stampante specificata.

source: Where possible, it is best to use the same wording, phrasing, indentation, and section ordering as the existing config files.The top of each config file should list the type of micro-controller the user should select during "make menuconfig". It should also have a reference to "docs/Config_Reference.md".
it: Ove possibile, è meglio usare la stessa formulazione, fraseggio, indentazione e ordinamento delle sezioni dei file di configurazione esistenti. La parte superiore di ogni file di configurazione dovrebbe elencare il tipo di microcontrollore che l'utente dovrebbe selezionare durante "make menuconfig". Dovrebbe anche avere un riferimento a "docs/Config_Reference.md".

source: Do not copy the field documentation into the example config files. (Doing so creates a maintenance burden as an update to the documentation would then require changing it in many places.)
it: Non copiare la documentazione sul campo nei file di configurazione di esempio. (In questo modo si crea un onere di manutenzione poiché un aggiornamento della documentazione richiederebbe quindi la modifica in molti punti.)

source: Example config files should not contain a "SAVE_CONFIG" section. If necessary, copy the relevant fields from the SAVE_CONFIG section to the appropriate section in the main config area.
it: I file di configurazione di esempio non devono contenere una sezione "SAVE_CONFIG". Se necessario, copiare i campi rilevanti dalla sezione SAVE_CONFIG alla sezione appropriata nell'area di configurazione principale.

source: Use `field: value` syntax instead of `field=value`.
it: Usa la sintassi `field: value` invece di `field=value`.

source: Avoid defining field values that are set to their default value. For example, one should not specify `min_extrude_temp: 170` as that is already the default value.
it: Evitare di definire valori di campo impostati sul valore predefinito. Ad esempio, non si dovrebbe specificare `min_extrude_temp: 170` poiché questo è già il valore predefinito.

source: Where possible, lines should not exceed 80 columns.
it: Ove possibile, le righe non devono superare le 80 colonne.

source: Avoid adding attribution or revision messages to the config files. (For example, avoid adding lines like "this file was created by ...".) Place attribution and change history in the git commit message.
it: Evita di aggiungere messaggi di attribuzione o revisione ai file di configurazione. (Ad esempio, evita di aggiungere righe come "questo file è stato creato da...".) Inserisci l'attribuzione e cambia la cronologia nel messaggio di commit git.

source: Do not disable a default safety system in an example config file. For example, a config should not specify a custom `max_extrude_cross_section`. Do not enable debugging features. For example there should not be a `force_move` config section.
it: Non disabilitare un sistema di sicurezza predefinito in un file di configurazione di esempio. Ad esempio, una configurazione non dovrebbe specificare una `max_extrude_cross_section` personalizzata. Non abilitare le funzionalità di debug. Ad esempio, non dovrebbe esserci una sezione di configurazione `force_move`.

source: Example config files are submitted by creating a github "pull request". Please also follow the directions in the [contributing document](CONTRIBUTING.md).
it: I file di configurazione di esempio vengono inviati creando una "richiesta pull" di github. Si prega di seguire anche le indicazioni nel [documento per contributi](CONTRIBUTING.md).

source: The `printer` prefix is used for stock printers sold by a mainstream manufacturer.
it: Il prefisso `printer` viene utilizzato per le stampanti stock vendute da un produttore tradizionale.

source: Example configurations
it: Esempi di configurazioni

source: Select the appropriate config filename prefix:
it: Seleziona il prefisso del nome del file di configurazione appropriato:

source: All configuration files must end in a `.cfg` suffix. The `printer` config files must end in a year followed by `.cfg` (eg, `-2019.cfg`). In this case, the year is an approximate year the given printer was sold.
it: Tutti i file di configurazione devono terminare con un suffisso `.cfg`. I file di configurazione della `stampante` devono terminare con un anno seguito da `.cfg` (ad es. `-2019.cfg`). In questo caso, l'anno è un anno approssimativo in cui è stata venduta la stampante specificata.

source: Do not use spaces or special characters in the config filename. The filename should contain only characters `A-Z`, `a-z`, `0-9`, `-`, and `.`.
it: Non utilizzare spazi o caratteri speciali nel nome del file di configurazione. Il nome del file deve contenere solo i caratteri `A-Z`, `a-z`, `0-9`, `-` e `.`.

source: Do not use any deprecated features in the example config file.
it: Non utilizzare alcuna funzionalità deprecata nel file di configurazione di esempio.

source: When adding an extruder `rotation_distance` it is preferable to specify a `gear_ratio` if the extruder has a gearing mechanism. We expect the rotation_distance in the example configs to correlate with the circumference of the hobbed gear in the extruder - it is normally in the range of 20 to 35mm. When specifying a `gear_ratio` it is preferable to specify the actual gears on the mechanism (eg, prefer `gear_ratio: 80:20` over `gear_ratio: 4:1`). See the [rotation distance document](Rotation_Distance.md#using-a-gear_ratio) for more information.
it: Quando si aggiunge la `rotation_distance`a un estrusore è preferibile specificare un `gear_ratio` se l'estrusore ha un meccanismo di ingranaggi. Ci aspettiamo che la rotation_distance nelle configurazioni di esempio sia correlata alla circonferenza dell'ingranaggio nell'estrusore: normalmente è nell'intervallo da 20 a 35 mm. Quando si specifica un `gear_ratio` è preferibile specificare gli ingranaggi effettivi sul meccanismo (ad esempio, preferire `gear_ratio: 80:20` su `gear_ratio: 4:1`). Per ulteriori informazioni, vedere il [documento sulla distanza di rotazione](Rotation_Distance.md#using-a-gear_ratio).

source: All known boards that Klipper supports can use the default serial baud rate of 250000. Do not recommend a different baud rate in an example config file.
it: Tutte le schede note supportate da Klipper possono utilizzare la velocità di trasmissione seriale predefinita di 250000. Non consigliare una velocità di trasmissione diversa in un file di configurazione di esempio.
