Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Kinematics.po
Languages: it, ko

source: This document provides an overview of how Klipper implements robot motion (its [kinematics](https://en.wikipedia.org/wiki/Kinematics)). The contents may be of interest to both developers interested in working on the Klipper software as well as users interested in better understanding the mechanics of their machines.
it: Questo documento è una panoramica su come Klipper implementa la movimentazione del sistema meccanico(la sua [cinematica](https://en.wikipedia.org/wiki/Kinematics)). Questi contenuti potrebbero interessare sia gli sviluppatori che intendono lacorare sul software Klipper che gli utenti che desiderano comprendere meglio il funzionamento delle proprie macchine.
ko: 이 문서는 Klipper가 로봇 모션을 구현하는 방법에 대한 개요를 제공합니다 ([운동학](https://en.wikipedia.org/wiki/Kinematics)). 아래 내용은 Klipper 소프트웨어 작업에 관심이 있는 개발자와 기계의 역학을 더 잘 이해하는데 관심이 있는 사용자 모두에게 흥미로울 수 있습니다.

source: Acceleration
it: Accelerazione
ko: 가속도

source: Klipper implements a constant acceleration scheme whenever the print head changes velocity - the velocity is gradually changed to the new speed instead of suddenly jerking to it. Klipper always enforces acceleration between the tool head and the print. The filament leaving the extruder can be quite fragile - rapid jerks and/or extruder flow changes lead to poor quality and poor bed adhesion. Even when not extruding, if the print head is at the same level as the print then rapid jerking of the head can cause disruption of recently deposited filament. Limiting speed changes of the print head (relative to the print) reduces risks of disrupting the print.
it: Klipper utilizza uno schema ad accelerazione costrante ogni qualvolta la testa di stampa cambia velocità - la velocità viene gradualmente variata fino a raggiungere la nuova velocità invece di strattonare direttamente alla nuova velocità. Klipper mantiene sempre l'accelerazione tra la testa di stampa e la stampa. Il filamento in uscita dall'ugello può essere piuttosto fragile, rapidi sobbalzi e/o cambi di flusso di estrusione portano a cattiva qualità di stampa e bassa adesione al piano di stampa. Anche quando non viene estruso filamento, se l'ugello si trova allo stesso livello della stampa, un repentino cambio di velocità potrebbe disturbare il filamento appena depositato. Limitare i cambi di velocità della testa di stampa relativamente alla stampa riduce il rischio di rovinare la stampa.
ko: Klipper는 프린트 헤드가 속도를 변경할 때마다 일정한 가속을 합니다. 속도는 갑자기 급상승하지 않고 점진적으로 새로운 속도로 변경됩니다. Klipper는 항상 툴헤드와 인쇄물 사이에 가속을 적용합니다. 익스트루더를 떠나는 필라멘트는 매우 약할 수 있기 때문에 급격한 저크 및/또는 압출기 흐름 변화는 출력물의 품질과 베드 접착력을 저하시킵니다. 압출되지 않은 상태에서도 프린트 헤드가 프린트와 같은 높이에 있으면 헤드의 급격한 요동으로 최근에 출력된 필라멘트가 손상될 수 있습니다. 이 때 프린트 헤드의 속도 변경을 제한하면 출력이 실패할 위험이 줄어듭니다.

source: It is also important to limit acceleration so that the stepper motors do not skip or put excessive stress on the machine. Klipper limits the torque on each stepper by virtue of limiting the acceleration of the print head. Enforcing acceleration at the print head naturally also limits the torque of the steppers that move the print head (the inverse is not always true).
it: È anche importante limitare l'accelerazione in modo da evitare che i motori stepper perdano passi e per ridurre le sollecitazioni alla macchina. Klipper limita la coppia su ciascuno stepper mediante la limitazione dell'accelerazione sulla testina di stampa. Imporre l'accelerazione alla testa di stampa ha la conseguenza naturale di limitare la coppia degli stepper che la muovono (l'inverso non è sempre vero).
ko: 스테퍼 모터가 탈조하거나 기계에 과도한 스트레스를 주지 않도록 가속을 제한하는 것도 중요합니다. Klipper는 프린트 헤드의 가속을 제한함으로써 각 스테퍼의 토크를 제한합니다. 프린트 헤드에 가속을 적용하면 프린트 헤드를 움직이는 스테퍼의 토크도 자연스럽게 제한됩니다(반대의 경우가 항상 있는 것은 아닙니다).

source: Klipper implements constant acceleration. The key formula for constant acceleration is:
it: Klipper implementa l'accelerazione costante. La formula chiave per l'accelerazione costante è:
ko: Klipper는 일정한 가속을 구현합니다. 등가속도의 핵심 공식은 다음과 같습니다:

source: Trapezoid generator
it: Generatore di trapezoide
ko: 사다리꼴 생성기

source: Klipper uses a traditional "trapezoid generator" to model the motion of each move - each move has a start speed, it accelerates to a cruising speed at constant acceleration, it cruises at a constant speed, and then decelerates to the end speed using constant acceleration.
it: Klipper utilizza un "generatore di trapezoide" di tipo tradizionale per modellare il movimento - ogni movimento ha una velocità iniziale, accelera verso la velocità di crociera ad accelerazione costante, prosegue a velocità costante ed infine decelera fino alla velocità finale ad accelerazione costante.
ko: Klipper는 기존의 "사다리꼴 생성기"를 사용하여 각 동작의 동작을 모델링합니다. 각 동작에는 시작 속도가 있고, 일정한 가속에서 순항 속도로 가속하고, 일정한 속도로 순항한 다음, 일정한 가속을 사용하여 끝 속도로 감속합니다.

source: ![trapezoid](img/trapezoid.svg.png)
ko: ![사다리꼴](img/trapezoid.svg.png)

source: It's called a "trapezoid generator" because a velocity diagram of the move looks like a trapezoid.
it: Viene detto "generatore di trapezoide" perché il diagramma di velocità del movimento sembra un trapezoide.
ko: 움직임의 속도 다이어그램이 사다리꼴처럼 보이기 때문에 이것을 "사다리꼴 생성기" 이라고 합니다.

source: The cruising speed is always greater than or equal to both the start speed and the end speed. The acceleration phase may be of zero duration (if the start speed is equal to the cruising speed), the cruising phase may be of zero duration (if the move immediately starts decelerating after acceleration), and/or the deceleration phase may be of zero duration (if the end speed is equal to the cruising speed).
it: La velocità di crociera è sempre maggiore o uguale sia alla velocità iniziale che a quella finale. La fase di accelerazione potrebbe avere durata zero (se la velocità iniziale è uguale alla velocità di crociera), la fase di movimento a valocità costante potrebbe avere durata zero (se il movimento inizia a decelerare subito l'accelerazione) e/o la fase di decelerazione potrebbe avere durata zero (se la velocità finale è uguale alla velocità di crociera).
ko: 순항 속도는 항상 시작 속도와 끝 속도보다 크거나 같습니다. 가속 단계는 지속 시간이 0일 수 있고(시작 속도가 순항 속도와 동일한 경우) 순항 단계는 지속 시간이 0일 수 있으며(가속 후 즉시 감속이 시작되는 경우), 감속 단계는 0일 수 있습니다. 지속 시간(종료 속도가 순항 속도와 동일한 경우).

source: ![trapezoids](img/trapezoids.svg.png)
ko: ![사다리꼴](img/trapezoids.svg.png)

source: Look-ahead
it: Look-ahead (Precalcolo)
ko: 예측 (look-ahead)

source: The "look-ahead" system is used to determine cornering speeds between moves.
it: Il sistema di "look-ahead" (precalcolo) è usato per determinare le velocità nelle giunzioni tra movimenti (cornering speed).
ko: "예측" 시스템은 움직임 사이의 코너링 속도를 결정하는 데 사용됩니다.

source: Consider the following two moves contained on an XY plane:
it: Consideriamo questi due movimenti sul piano XY:
ko: XY 평면에서 일어날 수 있는 다음 두 가지 이동을 생각해 보십시오:

source: ![corner](img/corner.svg.png)
ko: ![코너](img/corner.svg.png)

source: In the above situation it is possible to fully decelerate after the first move and then fully accelerate at the start of the next move, but that is not ideal as all that acceleration and deceleration would greatly increase the print time and the frequent changes in extruder flow would result in poor print quality.
it: Nella situazione sopra descritta è possibile decelerare completamente dopo il primo movimento e poi accelerare all'inizio del movimento successivo; però questo non è un comportamento ideale dato che continue accelerazioni e decelerazioni aumentano il tempo di stampa e continue variazioni nel flusso dell'estrusore peggiorano la qualità di stampa.
ko: 위의 상황에서 첫 번째 이동 후에 완전히 감속한 후 다음 이동을 시작할 때 완전히 가속하는 것도 가능하지만, 이런 모든 가속과 감속이 출력 시간을 크게 증가시키고 압출기 흐름의 빈번한 변화를 증가시키므로 이상적이지 않습니다. 또한 이로인해 인쇄 품질도 떨어질 수 있습니다.

source: To solve this, the "look-ahead" mechanism queues multiple incoming moves and analyzes the angles between moves to determine a reasonable speed that can be obtained during the "junction" between two moves. If the next move is nearly in the same direction then the head need only slow down a little (if at all).
it: Per risolvere questo problema, la funzione "look-ahead" (precalcolo) accoda i movimenti da eseguire ed analizza gli angoli tra essi per calcolare la velocità da usare nella giunzione tra due movimenti. Se il prossimo movimento è all'incirca nella stessa direzione del precedente, la testina di stampa deve rallentare molto poco (se non per nulla).
ko: 이를 해결하기 위해 "예측" 메커니즘은 들어오는 여러 움직임을 대기열에 넣고 움직임 사이의 각도를 분석하여 두 움직임 사이의 "연결" 동안 얻을 수 있는 합리적인 속도를 결정합니다. 다음 움직임이 거의 같은 방향에 있으면 해드만 약간 느려지면 됩니다.

source: ![lookahead](img/lookahead.svg.png)
ko: ![예측](img/lookahead.svg.png)

source: However, if the next move forms an acute angle (the head is going to travel in nearly a reverse direction on the next move) then only a small junction speed is permitted.
it: Se però il prossimo movimento forma un angolo acuto (la testina deve praticamente invertire la direzione di marcia), la velocità alla giunzione sarà piccola.
ko: 그러나 다음 이동이 예각을 형성하는 경우(헤드가 다음 이동에서 거의 반대 방향으로 이동하게 됨) 작은 연결 속도만 허용됩니다.

source: ![lookahead](img/lookahead-slow.svg.png)
ko: ![예측](img/lookahead-slow.svg.png)

source: The junction speeds are determined using "approximated centripetal acceleration". Best [described by the author](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/). However, in Klipper, junction speeds are configured by specifying the desired speed that a 90° corner should have (the "square corner velocity"), and the junction speeds for other angles are derived from that.
it: Le velocità di giunzione sono determinate utilizzando "accelerazione centripeta approssimata". Meglio su [descritto dall'autore](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/). Tuttavia, in Klipper, le velocità di giunzione sono configurate specificando la velocità desiderata che dovrebbe avere un angolo di 90° (la "velocità dell'angolo retto") e da quella vengono derivate le velocità di giunzione per altri angoli.
ko: 연결 속도는 "approximated centripetal acceleration"를 사용하여 결정됩니다. [저자 설명](https://onehossshay.wordpress.com/2011/09/24/improving_grbl_cornering_algorithm/)을 참고. 그러나 Klipper에서 연결 속도는 90° 모서리가 가져야 하는 원하는 속도("정사각형 모서리 속도")를 지정하여 구성되며 다른 각도에 대한 접합 속도는 여기서 파생됩니다.

source: Key formula for look-ahead:
it: Formula chiave per il look-ahead:
ko: 예측을 위한 핵심 공식:

source: Smoothed look-ahead
it: Look-ahead ammorbidito
ko: 부드러운 예측 (Smoothed Look-ahed)

source: Klipper also implements a mechanism for smoothing out the motions of short "zigzag" moves. Consider the following moves:
it: Klipper implementa anche un meccanismo per smussare i movimenti di brevi movimenti a "zigzag". Considera i seguenti movimenti:
ko: Klipper는 또한 짧은 "지그재그" 동작을 부드럽게 하는 메커니즘을 구현합니다. 다음 동작을 살펴보세요:

source: ![zigzag](img/zigzag.svg.png)
ko: ![지그재그](img/zigzag.svg.png)

source: In the above, the frequent changes from acceleration to deceleration can cause the machine to vibrate which causes stress on the machine and increases the noise. To reduce this, Klipper tracks both regular move acceleration as well as a virtual "acceleration to deceleration" rate. Using this system, the top speed of these short "zigzag" moves are limited to smooth out the printer motion:
it: In quanto sopra, i frequenti passaggi dall'accelerazione alla decelerazione possono causare vibrazioni della macchina che provocano sollecitazioni e aumentano la rumorosità. Per ridurre questo, Klipper tiene traccia sia dell'accelerazione di movimento regolare che di una velocità virtuale di "accelerazione alla decelerazione". Utilizzando questo sistema, la velocità massima di questi brevi movimenti a "zigzag" è limitata per rendere più fluido il movimento della stampante:
ko: 위의 경우 가속에서 감속으로의 빈번한 변화는 기계를 진동시켜 기계에 스트레스를 일으키고 소음을 증가시킬 수 있습니다.이를 줄이기 위해 Klipper는 일반적인 이동 가속과 가상 "가속에서 감속" 비율을 모두 추적합니다. 이 시스템을 사용하면 이러한 짧은 "지그재그" 이동의 최고 속도는 프린터 동작을 부드럽게 하기 위해 제한됩니다:

source: Specifically, the code calculates what the velocity of each move would be if it were limited to this virtual "acceleration to deceleration" rate (half the normal acceleration rate by default). In the above picture the dashed gray lines represent this virtual acceleration rate for the first move. If a move can not reach its full cruising speed using this virtual acceleration rate then its top speed is reduced to the maximum speed it could obtain at this virtual acceleration rate. For most moves the limit will be at or above the move's existing limits and no change in behavior is induced. For short zigzag moves, however, this limit reduces the top speed. Note that it does not change the actual acceleration within the move - the move continues to use the normal acceleration scheme up to its adjusted top-speed.
it: In particolare, il codice calcola quale sarebbe la velocità di ogni mossa se fosse limitata a questa velocità di "accelerazione alla decelerazione" virtuale (la metà della velocità di accelerazione normale per impostazione predefinita). Nell'immagine sopra le linee grigie tratteggiate rappresentano questa velocità di accelerazione virtuale per il primo movimento. Se un movimento non può raggiungere la sua piena velocità di crociera usando questa velocità di accelerazione virtuale, la sua velocità massima viene ridotta alla velocità massima che potrebbe ottenere a questa velocità di accelerazione virtuale. Per la maggior parte dei movimenti il limite sarà pari o superiore ai limiti esistenti del movimento e non verrà indotto alcun cambiamento nel comportamento. Per brevi movimenti a zigzag, tuttavia, questo limite riduce la velocità massima. Nota che non cambia l'accelerazione effettiva all'interno del movimento: Il movimento continua a utilizzare lo schema di accelerazione normale fino alla sua velocità massima regolata.
ko: 특히 코드는 이 가상 "가감속 가속" 비율 (기본적으로 정상 가속 비율의 절반)로 제한되는 경우 각 이동의 속도를 계산합니다. 위의 그림에서 회색 점선은 첫 번째 이동에 대한 가상 가속도를 나타냅니다. 이동이 이 가상 가속도를 사용하여 최대 순항 속도에 도달할 수 없는 경우 최고 속도는 이 가상 가속도에서 얻을 수 있는 최대 속도로 감소됩니다. 대부분의 동작에 대해 제한은 이동의 기존 제한 이상이며 동작의 변화가 생기지 않습니다. 그러나 짧은 지그재그 이동의 경우 이 제한으로 인해 최고 속도가 감소합니다. 이동 내 실제 가속은 변경되지 않습니다. 이동은 조정된 최고 속도까지 일반 가속 계획을 계속 사용합니다.

source: Generating steps
it: Generazione di passi
ko: step 생성

source: Once the look-ahead process completes, the print head movement for the given move is fully known (time, start position, end position, velocity at each point) and it is possible to generate the step times for the move. This process is done within "kinematic classes" in the Klipper code. Outside of these kinematic classes, everything is tracked in millimeters, seconds, and in cartesian coordinate space. It's the task of the kinematic classes to convert from this generic coordinate system to the hardware specifics of the particular printer.
it: Una volta completato il processo di look-ahead, il movimento della testina di stampa per il dato spostamento è completamente noto (tempo, posizione iniziale, posizione finale, velocità in ogni punto) ed è possibile generare i tempi di passaggio per lo spostamento. Questo processo viene eseguito all'interno di "classi cinematiche" nel codice di Klipper. Al di fuori di queste classi cinematiche, tutto viene tracciato in millimetri, secondi e nello spazio delle coordinate cartesiane. È compito delle classi cinematiche convertire da questo sistema di coordinate generico alle specifiche hardware di una particolare stampante.
ko: 예측 프로세스가 완료되면 주어진 이동에 대한 프린트 헤드 이동이 완전히 정해지고 (시간, 시작 위치, 종료 위치, 각 지점의 속도) 이동에 대한 step 시간을 생성할 수 있습니다. 이 프로세스는 Klipper 코드의 "운동학 클래스" 내에서 수행됩니다. 이러한 운동학 클래스 외부에서 모든 것은 밀리미터, 초 및 데카르트 좌표 공간에서 추적됩니다. 일반 좌표계에서 특정 프린터의 하드웨어 특성으로 변환하는 것은 운동학 클래스의 작업입니다.

source: Klipper uses an [iterative solver](https://en.wikipedia.org/wiki/Root-finding_algorithm) to generate the step times for each stepper. The code contains the formulas to calculate the ideal cartesian coordinates of the head at each moment in time, and it has the kinematic formulas to calculate the ideal stepper positions based on those cartesian coordinates. With these formulas, Klipper can determine the ideal time that the stepper should be at each step position. The given steps are then scheduled at these calculated times.
it: Klipper utilizza un [risolutore iterativo](https://en.wikipedia.org/wiki/Root-finding_algorithm) per generare i tempi dei passo per ogni stepper. Il codice contiene le formule per calcolare le coordinate cartesiane ideali della testa in ogni momento e ha le formule cinematiche per calcolare le posizioni ideali dello stepper in base a quelle coordinate cartesiane. Con queste formule, Klipper può determinare il tempo ideale in cui lo stepper dovrebbe trovarsi in ogni posizione del passo. I passaggi indicati vengono quindi programmati in questi orari calcolati.
ko: Klipper는 [iterative solver](https://en.wikipedia.org/wiki/Root-finding_algorithm) 를 사용하여 각 스테퍼에 대한 step 시간을 생성합니다. 코드에는 매순간 헤드의 이상적인 직교 좌표를 계산하는 공식이 포함되어 있으며 이러한 직교 좌표를 기반으로 이상적인 스테퍼 위치를 계산하는 운동학 공식이 있습니다.이 공식을 사용하여 Klipper는 스테퍼가 각 step 위치에 있어야 하는 이상적인 시간을 결정할 수 있습니다. 그런 다음 주어진 step이 계산된 시간에 스케줄링됩니다.

source: The key formula to determine how far a move should travel under constant acceleration is:
it: La formula chiave per determinare la distanza che un movimento deve percorrere con un'accelerazione costante è:
ko: 일정한 가속도에서 이동해야 하는 거리를 결정하는 핵심 공식은 다음과 같습니다:

source: and the key formula for movement with constant velocity is:
it: e la formula chiave per il movimento a velocità costante è:
ko: 등속 운동의 핵심 공식은 다음과 같습니다:

source: The key formulas for determining the cartesian coordinate of a move given a move distance is:
it: Le formule chiave per determinare la coordinata cartesiana di un movimento data una distanza di movimento sono:
ko: 이동 거리가 주어진 이동의 직교 좌표를 결정하는 주요 공식은 다음과 같습니다:

source: Cartesian Robots
it: Robot Cartesiani
ko: 직교 로봇

source: Generating steps for cartesian printers is the simplest case. The movement on each axis is directly related to the movement in cartesian space.
it: La generazione di passaggi per stampanti cartesiane è il caso più semplice. Il movimento su ciascun asse è direttamente correlato al movimento nello spazio cartesiano.
ko: 직교 프린터에 대한 step을 생성하는 것이 가장 간단한 경우입니다. 각 축의 움직임은 데카르트 좌표계의 움직임과 직접 관련이 있습니다.

source: Key formulas:
it: Formule chiave:
ko: 주요 공식:

source: CoreXY Robots
it: Robot CoreXY
ko: 코어XY 로봇

source: Generating steps on a CoreXY machine is only a little more complex than basic cartesian robots. The key formulas are:
it: La generazione di passaggi su una macchina CoreXY è solo un po' più complessa dei robot cartesiani di base. Le formule chiave sono:
ko: CoreXY 기계에서 step을 생성하는 것은 기본 직교 로봇보다 약간 더 복잡합니다. 주요 공식은 다음과 같습니다:

source: Delta Robots
it: Robot Delta
ko: 델타 로봇

source: Step generation on a delta robot is based on Pythagoras's theorem:
it: La generazione di passi su un robot delta si basa sul teorema di Pitagora:
ko: 델타 로봇의 step 생성은 피타고라스의 정리를 기반으로 합니다:

source: Stepper motor acceleration limits
it: Limiti di accelerazione del motore passo-passo
ko: 스테퍼 모터 가속 제한

source: With delta kinematics it is possible for a move that is accelerating in cartesian space to require an acceleration on a particular stepper motor greater than the move's acceleration. This can occur when a stepper arm is more horizontal than vertical and the line of movement passes near that stepper's tower. Although these moves could require a stepper motor acceleration greater than the printer's maximum configured move acceleration, the effective mass moved by that stepper would be smaller. Thus the higher stepper acceleration does not result in significantly higher stepper torque and it is therefore considered harmless.
it: Con la cinematica delta è possibile che un movimento che sta accelerando nello spazio cartesiano richieda un'accelerazione su un particolare motore passo-passo maggiore dell'accelerazione del movimento. Ciò può verificarsi quando un braccio dello stepper è più orizzontale che verticale e la linea di movimento passa vicino alla torre dello stepper. Sebbene questi movimenti possano richiedere un'accelerazione del motore passo-passo maggiore dell'accelerazione di movimento massima configurata della stampante, la massa effettiva spostata da quel passo-passo sarebbe inferiore. Pertanto la maggiore accelerazione stepper non si traduce in una coppia stepper significativamente più elevata ed è quindi considerata innocua.
ko: 델타 운동학을 사용하면 직교 방식 운동학 가속도보다 더 큰 스테퍼 모터의 가속도를 요구할 수 있습니다. 이것은 스테퍼 암이 수직보다 수평이고 이동 선이 스테퍼 타워 근처를 지날 때 발생할 수 있습니다. 이러한 이동에는 프린터의 구성된 최대 이동 가속보다 더 큰 스테퍼 모터 가속이 필요할 수 있지만 해당 스테퍼에 의해 이동되는 유효 질량은 더 작습니다. 따라서 더 높은 스테퍼 가속은 훨씬 더 높은 스테퍼 토크를 초래하지 않으므로 무해한 것으로 간주됩니다.

source: However, to avoid extreme cases, Klipper enforces a maximum ceiling on stepper acceleration of three times the printer's configured maximum move acceleration. (Similarly, the maximum velocity of the stepper is limited to three times the maximum move velocity.) In order to enforce this limit, moves at the extreme edge of the build envelope (where a stepper arm may be nearly horizontal) will have a lower maximum acceleration and velocity.
it: Tuttavia, per evitare casi estremi, Klipper impone un limite massimo all'accelerazione stepper di tre volte l'accelerazione di movimento massima configurata della stampante. (Allo stesso modo, la velocità massima dello stepper è limitata a tre volte la velocità massima di spostamento.) Per far rispettare questo limite, i movimenti sul bordo estremo dell'inviluppo (dove un braccio dello stepper può essere quasi orizzontale) avranno un massima accelerazione e velocità.
ko: 그러나 극단적인 경우를 피하기 위해 Klipper는 프린터에 구성된 최대 이동 가속도의 3배로 스테퍼 가속에 대한 최대 상한을 적용합니다. (마찬가지로 스테퍼의 최대 속도는 최대 이동 속도의 3배로 제한됩니다.) 이 제한을 적용하기 위해 빌드 엔벨로프의 끝단 (스테퍼 암이 거의 수평일 수 있는 곳) 에서의 최대 가속도와 속도가 더 낮아집니다.

source: Extruder kinematics
it: Cinematica dell'estrusore
ko: 익스트루더 운동학

source: Klipper implements extruder motion in its own kinematic class. Since the timing and speed of each print head movement is fully known for each move, it's possible to calculate the step times for the extruder independently from the step time calculations of the print head movement.
it: Klipper implementa il movimento dell'estrusore nella propria classe cinematica. Poiché i tempi e la velocità di ogni movimento della testina di stampa sono completamente noti per ogni movimento, è possibile calcolare i tempi di passaggio per l'estrusore indipendentemente dai calcoli del tempo di passaggio del movimento della testina di stampa.
ko: Klipper는 자체 운동학 클래스에서 익스트루더 동작을 구현합니다. 각 프린트 헤드 움직임의 타이밍과 속도는 이미 결정되었기 때문에 프린트 헤드 움직임의 step 시간 계산과 독립적으로 익스트루더의 step 시간을 계산할 수 있습니다.

source: Basic extruder movement is simple to calculate. The step time generation uses the same formulas that cartesian robots use:
it: Il movimento di base dell'estrusore è semplice da calcolare. La generazione del tempo di passaggio utilizza le stesse formule utilizzate dai robot cartesiani:
ko: 기본적인 익스트루더 움직임은 계산하기 쉽습니다. step 시간 생성은 직교 로봇이 사용하는 것과 동일한 공식을 사용합니다:
