Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Kinematics.po
Languages: it, ko

source: Experimentation has shown that it's possible to improve the modeling of the extruder beyond the basic extruder formula. In the ideal case, as an extrusion move progresses, the same volume of filament should be deposited at each point along the move and there should be no volume extruded after the move. Unfortunately, it's common to find that the basic extrusion formulas cause too little filament to exit the extruder at the start of extrusion moves and for excess filament to extrude after extrusion ends. This is often referred to as "ooze".
it: La sperimentazione ha dimostrato che è possibile migliorare la modellazione dell'estrusore oltre la formula di base dell'estrusore. Nel caso ideale, mentre un movimento di estrusione avanza, lo stesso volume di filamento dovrebbe essere depositato in ogni punto lungo il movimento e non dovrebbe esserci volume estruso dopo il movimento. Sfortunatamente, è comune scoprire che le formule di estrusione di base fanno sì che una quantità insufficiente di filamento fuoriesca dall'estrusore all'inizio dei movimenti di estrusione e che il filamento in eccesso venga estruso al termine dell'estrusione. Questo è spesso indicato come "melma" "ooze".
ko: 실험을 통해 기본 익스트루더 공식 이상으로 익스트루더의 모델링을 개선할 수 있음이 나타났습니다. 이상적인 경우 익스트루더 이동이 진행됨에 따라 각 지점에 동일한 부피의 필라멘트가 쌓여야 하며 이동 후 압출되는 부피가 없어야 합니다. 불행히도, 기본 익스트루더 공식으로 인해 이동이 시작될 때 익스트루더를 빠져나가는 필라멘트가 너무 적고 압출 종료 후에 과도한 필라멘트가 압출된다는 사실을 발견하는 것이 일반적입니다. 이것을 흔히 "ooze"라고 합니다.

source: The "pressure advance" system attempts to account for this by using a different model for the extruder. Instead of naively believing that each mm^3 of filament fed into the extruder will result in that amount of mm^3 immediately exiting the extruder, it uses a model based on pressure. Pressure increases when filament is pushed into the extruder (as in [Hooke's law](https://en.wikipedia.org/wiki/Hooke%27s_law)) and the pressure necessary to extrude is dominated by the flow rate through the nozzle orifice (as in [Poiseuille's law](https://en.wikipedia.org/wiki/Poiseuille_law)). The key idea is that the relationship between filament, pressure, and flow rate can be modeled using a linear coefficient:
it: Il sistema di "pressure advance" tenta di spiegare ciò utilizzando un modello diverso per l'estrusore. Invece di credere ingenuamente che ogni mm^3 di filamento alimentato nell'estrusore comporterà l'uscita immediata di quella quantità di mm^3 dall'estrusore, utilizza un modello basato sulla pressione. La pressione aumenta quando il filamento viene spinto nell'estrusore (come in [Legge di Hook](https://en.wikipedia.org/wiki/Hooke%27s_law)) e la pressione necessaria per estrudere è dominata dalla portata attraverso l'orifizio dell'ugello (come nella [legge di Poiseuille](https://en.wikipedia.org/wiki/Poiseuille_law)). L'idea chiave è che la relazione tra filamento, pressione e portata può essere modellata utilizzando un coefficiente lineare:
ko: "pressure advance" 시스템은 익스트루더에 대해 다른 모델을 사용하여 이를 설명하려고 시도합니다. 익스트루더로 공급되는 필라멘트의 각 mm^3가 익스트루더에서 즉시 나오는 mm^3의 양을 초래할 것이라고 순진하게 믿는 대신 압력을 기반으로 한 모델을 사용합니다. 필라멘트가 익스트루더로 밀릴 때 압력이 증가하고 ([Hooke의 법칙](https://en.wikipedia.org/wiki/Hooke%27s_law)에서와 같이) 압출에 필요한 압력은 노즐 오리피스를 통한 유량에 의해 지배됩니다. ([Poiseuille의 법칙](https://en.wikipedia.org/wiki/Poiseuille_law) 에서와 같이). 핵심 아이디어는 필라멘트, 압력 및 유속 간의 관계를 선형 계수를 사용하여 모델링할 수 있다는 것입니다:

source: See the [pressure advance](Pressure_Advance.md) document for information on how to find this pressure advance coefficient.
it: Per informazioni su come trovare questo coefficiente di anticipo della pressione, vedere il documento [Pressure Advance](Pressure_Advance.md).
ko: 이 압력 조절 계수를 찾는 방법에 대한 정보는 [pressure advance](Pressure_Advance.md) 문서를 참조하십시오.

source: The basic pressure advance formula can cause the extruder motor to make sudden velocity changes. Klipper implements "smoothing" of the extruder movement to avoid this.
it: La formula di base del pressure advance può far sì che il motore dell'estrusore apporti improvvisi cambiamenti di velocità. Klipper implementa la "smussatura" del movimento dell'estrusore per evitarlo.
ko: 기본 압력 조절 공식으로 인해 익스트루더 모터가 급격한 속도 변화를 일으킬 수 있습니다. Klipper는 이를 피하기 위해 익스트루더 움직임의 "smoothing"를 구현합니다.

source: The above graph shows an example of two extrusion moves with a non-zero cornering velocity between them. Note that the pressure advance system causes additional filament to be pushed into the extruder during acceleration. The higher the desired filament flow rate, the more filament must be pushed in during acceleration to account for pressure. During head deceleration the extra filament is retracted (the extruder will have a negative velocity).
it: Il grafico sopra mostra un esempio di due movimenti di estrusione con una velocità in curva diversa da zero tra di loro. Si noti che il sistema di pressure advance fa sì che il filamento aggiuntivo venga spinto nell'estrusore durante l'accelerazione. Maggiore è la portata del filamento desiderata, più filamento deve essere spinto durante l'accelerazione per tenere conto della pressione. Durante la decelerazione della testa il filamento extra viene retratto (l'estrusore avrà una velocità negativa).
ko: 위의 그래프는 0이 아닌 코너링 속도가 있는 두 개의 돌출 움직임의 예를 보여줍니다. pressure advance 시스템은 가속 중에 추가 필라멘트를 압출기로 밀어 넣습니다. 원하는 필라멘트 유속이 높을수록 압력에 대응하기 위해 가속 중에 더 많은 필라멘트를 밀어 넣어야 합니다. 헤드 감속 중에 추가 필라멘트가 리트렉션 됩니다. (익스트루더는 음의 속도를 가짐).

source: The "smoothing" is implemented using a weighted average of the extruder position over a small time period (as specified by the `pressure_advance_smooth_time` config parameter). This averaging can span multiple g-code moves. Note how the extruder motor will start moving prior to the nominal start of the first extrusion move and will continue to move after the nominal end of the last extrusion move.
it: Lo "smussamento" viene implementato utilizzando una media pesata della posizione dell'estrusore in un breve periodo di tempo (come specificato dal parametro di configurazione `pressure_advance_smooth_time`). Questa media può estendersi su più mosse del codice G. Notare come il motore dell'estrusore inizierà a muoversi prima dell'inizio nominale del primo movimento di estrusione e continuerà a muoversi dopo la fine nominale dell'ultimo movimento di estrusione.
ko: "smoothing"은 짧은 기간 동안 익스트루더 위치의 가중 평균을 사용하여 구현됩니다 (`pressure_advance_smooth_time` config 매개변수로 결정됨). 이 평균화는 여러 g-code 이동에 걸쳐 있을 수 있습니다. 압출기 모터가 첫 번째 압출 이동의 시작 이전에 어떻게 움직이기 시작하고 마지막 압출 이동의 종료 후에도 계속 움직이는지 확인하십시오.

source: Key formula for "smoothed pressure advance":
it: Formula chiave per "smoothed pressure advance":
ko: "smoothed pressure advance"의 핵심 공식:

source: Kinematics
it: Cinematica
ko: 운동학

source: Pressure advance
it: Anticipo di pressione

source: velocity(time) = start_velocity + accel*time
it: velocità(tempo) = velocità_inizio + accelerazione*tempo

source: end_velocity^2 = start_velocity^2 + 2*accel*move_distance
it: velocità_finale^2 = velocità_iniziale^2 + 2*accelerazione*distanza_movimento

source: move_distance = (start_velocity + .5 * accel * move_time) * move_time
it: distanza_movimento = (velocita_iniziale + .5 * accelerazione *durata_movimento) * durata_movimento

source: move_distance = cruise_velocity * move_time
it: distanza_movimento = velocità_crociera * durata_movimento
