Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Manual_Level.po
Languages: hu, it

source: The `DIRECTION` parameter is useful if you can turn your bed adjustment screws in one direction only. For example, you might have screws that start tightened in their lowest (or highest) possible position, which can only be turned in a single direction, to raise (or lower) the bed. If you can only turn the screws clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CW`. If you can only turn them counter-clockwise, run `SCREWS_TILT_CALCULATE DIRECTION=CCW`. A suitable reference point will be chosen such that the bed can be leveled by turning all the screws in the given direction.
hu: A `DIRECTION` paraméter akkor hasznos, ha a tárgyasztal szintező csavarjait csak egy irányba tudja elfordítani. Például lehetnek olyan csavarjai, amelyek a lehető legalacsonyabb (vagy legmagasabb) pozícióban vannak meghúzva, és csak egy irányba forgathatók a tárgyasztal emeléséhez (vagy süllyesztéséhez). Ha a csavarokat csak az óramutató járásával megegyező irányban tudja elfordítani, futtassa a `SCREWS_TILT_CALCULATE DIRECTION=CW` parancsot. Ha csak az óramutató járásával ellentétes irányban tudja elforgatni őket, futtassa a `SCREWS_TILT_CALCULATE DIRECTION=CCW` parancsot. A program kiválaszt egy megfelelő referenciapontot, hogy a tárgyasztalt az összes csavar adott irányba történő elfordításával szintezhesse.
it: Il parametro `DIRECTION` è utile se puoi ruotare le viti di regolazione del piatto in una sola direzione. Ad esempio, potresti avere viti che iniziano a stringere nella posizione più bassa (o più alta) possibile, che possono essere ruotate solo in una sola direzione, per alzare (o abbassare) il piatto. Se puoi girare le viti solo in senso orario, esegui `SCREWS_TILT_CALCULATE DIRECTION=CW`. Se puoi ruotarli solo in senso antiorario, esegui `SCREWS_TILT_CALCULATE DIRECTION=CCW`. Verrà scelto un punto di riferimento idoneo in modo tale che il piatto possa essere livellato ruotando tutte le viti nella direzione indicata.

source: Manual leveling
hu: Kézi szintezés
it: Livellamento manuale

source: front left screw is the reference point you must not change it.
hu: a bal első csavar a referenciapont, nem szabad megváltoztatni.
it: la vite anteriore sinistra è il punto di riferimento non devi cambiarla.

source: front right screw must be turned clockwise 1 full turn and a quarter turn
hu: a jobb első csavart az óramutató járásával megegyező irányban kell elfordítani 1 teljes és negyed fordulatot
it: la vite anteriore destra deve essere ruotata in senso orario di 1 giro completo e un quarto di giro

source: rear right screw must be turned counter-clockwise 50 minutes
hu: a jobb hátsó csavart az óramutató járásával ellentétes irányba kell forgatni 50 percnyi fordulatot
it: la vite posteriore destra deve essere ruotata in senso antiorario per '50 minuti'

source: rear left screw must be turned clockwise 2 minutes (not need it's ok)
hu: bal hátsó csavart az óramutató járásával megegyező irányba kell forgatni 2 percnyit (nem kell tökéletesnek lennie)
it: la vite posteriore sinistra deve essere ruotata in senso orario '2 minuti' (non serve va bene)

source: Note that "minutes" refers to "minutes of a clock face". So, for example, 15 minutes is a quarter of a full turn.
hu: Vedd figyelembe, hogy a "percek" az "óra számlapjának perceire" utalnak. Így például 15 perc egy teljes fordulat negyedének felel meg.
it: Si noti che "minuti" si riferisce ai "minuti di un quadrante". Quindi, ad esempio, 15 minuti sono un quarto di giro completo.
