Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/MCU_Commands.po
Languages: it, zh_hant

source: This document provides information on the low-level micro-controller commands that are sent from the Klipper "host" software and processed by the Klipper micro-controller software. This document is not an authoritative reference for these commands, nor is it an exclusive list of all available commands.
it: Questo documento fornisce informazioni sui comandi di basso livello del microcontrollore che sono inviati dal software "host" Klipper e processati dal software del microcontrollore Klipper. Questo documento non è un riferimento autorevole per questi comandi, né una lista esclusiva di tutti i comandi disponibili.
zh_hant: 該文件介紹了Klipper上位機軟體發送到微控制器的，並由微處理器負責執行的底層命令。該文件不是這些命令的權威文件，也並未包含所有命令。

source: This document may be useful for developers interested in understanding the low-level micro-controller commands.
it: Questo documento può essere utile per gli sviluppatori interessati a comprendere i comandi di basso livello del microcontrollore.
zh_hant: 若想深入瞭解底層微處理器命令，該文件是不錯的入門材料。

source: See the [protocol](Protocol.md) document for more information on the format of commands and their transmission. The commands here are described using their "printf" style syntax - for those unfamiliar with that format, just note that where a '%...' sequence is seen it should be replaced with an actual integer. For example, a description with "count=%c" could be replaced with the text "count=10". Note that parameters that are considered "enumerations" (see the above protocol document) take a string value which is automatically converted to an integer value for the micro-controller. This is common with parameters named "pin" (or that have a suffix of "_pin").
it: Vedere il documento [protocol](Protocol.md) per ulteriori informazioni sul formato dei comandi e sulla loro trasmissione. I comandi qui sono descritti usando la loro sintassi di stile "printf" - per chi non ha familiarità con quel formato, basta notare che dove si vede una sequenza '%...' dovrebbe essere sostituita con un intero reale. Ad esempio, una descrizione con "count=%c" potrebbe essere sostituita con il testo "count=10". Si noti che i parametri considerati "enumerazioni" (vedere il documento di protocollo sopra) assumono un valore stringa che viene automaticamente convertito in un valore intero per il microcontrollore. Questo è comune con i parametri denominati "pin" (o che hanno il suffisso "_pin").
zh_hant: 關於命令的格式和傳輸的更多資訊，見[protocol](Protocol.md)檔案。這裡的命令是使用其 "printf "風格的語法描述的--對於那些不熟悉這種格式的人來說，只需注意在看到'%...'序列時，應該用一個實際的整數來代替。例如，"count=%c "的描述可以被替換為 "count=10"。請注意，那些被認為是 "enumerations "的參數（見上述協議檔案）採取的是一個字串值，對於微控制器來說，它被自動轉換為一個整數值。這在名為 "pin"（或後綴為"_pin"）的參數中很常見。

source: Startup Commands
it: Comandi di avvio
zh_hant: 啟動命令

source: It may be necessary to take certain one-time actions to configure the micro-controller and its peripherals. This section lists common commands available for that purpose. Unlike most micro-controller commands, these commands run as soon as they are received and they do not require any particular setup.
it: Potrebbe essere necessario eseguire determinate azioni una tantum per configurare il microcontrollore e le sue periferiche. Questa sezione elenca i comandi comuni disponibili a tale scopo. A differenza della maggior parte dei comandi del microcontrollore, questi comandi vengono eseguiti non appena vengono ricevuti e non richiedono alcuna configurazione particolare.
zh_hant: 可能需要採取某些一次性的命令來配置微控制器及其片上外備。本節列出了可用於該目的的常用命令。與大多數微控制器的命令不同，這些命令在收到后立即執行，它們不需要任何特殊的設定。

source: Common startup commands:
it: Comandi di avvio comuni:
zh_hant: 常見的啟動命令：

source: `set_digital_out pin=%u value=%c` : This command immediately configures the given pin as a digital out GPIO and it sets it to either a low level (value=0) or a high level (value=1). This command may be useful for configuring the initial value of LEDs and for configuring the initial value of stepper driver micro-stepping pins.
it: `set_digital_out pin=%u value=%c` : Questo comando configura immediatamente il pin dato come un GPIO di uscita digitale e lo imposta su un livello basso (valore=0) o alto (valore=1). Questo comando può essere utile per configurare il valore iniziale dei LED e per configurare il valore iniziale dei pin micro-stepping del driver stepper.
zh_hant: `set_digital_out pin=%u value=%c`：該命令立即將指定的引腳配置為數字輸出GPIO，並將其設定為低電平（value=0）或高電平（value=1）。這條命令對於配置LED的初始值和配置步進驅動器微步進引腳的初始值很有用。

source: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : This command will immediately configure the given pin to use hardware based pulse-width-modulation (PWM) with the given number of cycle_ticks. The "cycle_ticks" is the number of MCU clock ticks each power on and power off cycle should last. A cycle_ticks value of 1 can be used to request the fastest possible cycle time. The "value" parameter is between 0 and 255 with 0 indicating a full off state and 255 indicating a full on state. This command may be useful for enabling CPU and nozzle cooling fans.
it: `set_pwm_out pin=%u cycle_ticks=%u value=%hu` : Questo comando configurerà immediatamente il pin dato per utilizzare la modulazione di larghezza di impulso (PWM) basata sull'hardware con il numero specificato di cycle_tick. Il "cycle_ticks" è il numero di tick di clock dell'MCU per cui ogni ciclo di accensione e spegnimento dovrebbe durare. È possibile utilizzare un valore cycle_ticks pari a 1 per richiedere il tempo di ciclo più rapido possibile. Il parametro "value" è compreso tra 0 e 255 con 0 che indica uno stato completamente spento e 255 indica uno stato completamente acceso. Questo comando può essere utile per abilitare le ventole di raffreddamento della CPU e degli ugelli.
zh_hant: `set_pwm_out pin=%u cycle_ticks=%u value=%hu`：該命令將立即配置指定的引腳，使其使用硬體的脈寬調製（PWM）和給定的cycle_ticks。「cycle_ticks」是指每個通電和斷電週期應該持續的MCU時鐘數。cycle_ticks的值為1表示使用最短的週期時間。「value」參數在0-255之間，0表示完全關閉狀態，255表示完全開啟狀態。該命令對啟用CPU和噴嘴冷卻風扇很有用。

source: Low-level micro-controller configuration
it: Configurazione di basso livello del microcontrollore
zh_hant: 底層微控制器配置

source: Most commands in the micro-controller require an initial setup before they can be successfully invoked. This section provides an overview of the configuration process. This section and the following sections are likely only of interest to developers interested in the internal details of Klipper.
it: La maggior parte dei comandi nel microcontrollore richiede una configurazione iniziale prima di poter essere richiamati correttamente. Questa sezione fornisce una panoramica del processo di configurazione. Questa sezione e le sezioni seguenti sono probabilmente di interesse solo per gli sviluppatori interessati ai dettagli interni di Klipper.
zh_hant: 微控制器中的大多數命令在成功呼叫之前需要進行初始設定。本節提供了一個配置過程的概述。本節和下面的章節適用於對Klipper的內部細節感興趣的開發者。

source: When the host first connects to the micro-controller it always starts by obtaining a data dictionary (see [protocol](Protocol.md) for more information). After the data dictionary is obtained the host will check if the micro-controller is in a "configured" state and configure it if not. Configuration involves the following phases:
it: Quando l'host si connette per la prima volta al microcontrollore, inizia sempre ottenendo un dizionario di dati (vedi [protocol](Protocol.md) per ulteriori informazioni). Dopo aver ottenuto il dizionario dei dati, l'host verificherà se il microcontrollore è in uno stato "configurato" e in caso contrario lo configurerà. La configurazione prevede le seguenti fasi:
zh_hant: 當主機第一次連線到微控制器時，它總是從獲得一個數據字典開始（更多資訊見[protocol](Protocol.md)）。獲得數據字典后，主機將檢查微控制器是否處於 "已配置 "狀態，如果不是，就進行配置。配置包括以下幾個階段：

source: `get_config` : The host starts by checking if the micro-controller is already configured. The micro-controller responds to this command with a "config" response message. The micro-controller software always starts in an unconfigured state at power-on. It remains in this state until the host completes the configuration processes (by issuing a finalize_config command). If the micro-controller is already configured from a previous session (and is configured with the desired settings) then no further action is needed by the host and the configuration process ends successfully.
it: `get_config` : L'host si avvia controllando se il microcontrollore è già configurato. Il microcontrollore risponde a questo comando con un messaggio di risposta "config". Il software del microcontrollore si avvia sempre in uno stato non configurato all'accensione. Rimane in questo stato fino a quando l'host non completa i processi di configurazione (emettendo un comando finalize_config). Se il microcontrollore è già configurato da una sessione precedente (ed è configurato con le impostazioni desiderate), non sono necessarie ulteriori azioni da parte dell'host e il processo di configurazione termina correttamente.
zh_hant: `get_config`：主機首先檢查微控制器是否已經被配置。微控制器用一個 "config "的響應資訊來回應這個命令。微控制器軟體在上電時總是以未配置的狀態啟動。在主機完成配置過程之前（通過發出finalize_config命令），它一直處於這種狀態。如果微控制器已經在前一個會話中進行了配置（並且配置了所需的設定），那麼主機就不需要進一步的操作，配置過程成功結束。

source: `allocate_oids count=%c` : This command is issued to inform the micro-controller of the maximum number of object-ids (oid) that the host requires. It is only valid to issue this command once. An oid is an integer identifier allocated to each stepper, each endstop, and each schedulable gpio pin. The host determines in advance the number of oids it will require to operate the hardware and passes this to the micro-controller so that it may allocate sufficient memory to store a mapping from oid to internal object.
it: `allocate_oids count=%c` : Questo comando viene emesso per informare il microcontrollore del numero massimo di ID oggetto (oid) che l'host richiede. È valido solo per emettere questo comando una volta. Un oid è un identificatore intero allocato a ogni stepper, ogni endstop e ogni pin gpio schedulabile. L'host determina in anticipo il numero di oid necessari per far funzionare l'hardware e lo passa al microcontrollore in modo che possa allocare memoria sufficiente per memorizzare una mappatura dall'oid all'oggetto interno.
zh_hant: `allocate_oids count=%c`：這條命令是用來通知微控制器主機所需的對象標識（oid）的最大數量。這條命令只有效一次。oid是分配給每個步進電機、每個限位開關和每個可排程的gpio引腳的一個整數標識。主機事先確定操作硬體所需的oid數量，並將其傳遞給微控制器，以便它可以分配足夠的記憶體來儲存從oid到內部對象的對映。

source: `config_XXX oid=%c ...` : By convention any command starting with the "config_" prefix creates a new micro-controller object and assigns the given oid to it. For example, the config_digital_out command will configure the specified pin as a digital output GPIO and create an internal object that the host can use to schedule changes to the given GPIO. The oid parameter passed into the config command is selected by the host and must be between zero and the maximum count supplied in the allocate_oids command. The config commands may only be run when the micro-controller is not in a configured state (ie, prior to the host sending finalize_config) and after the allocate_oids command has been sent.
it: `config_XXX oid=%c ...` : Per convenzione qualsiasi comando che inizia con il prefisso "config_" crea un nuovo oggetto microcontrollore e gli assegna l'oid dato. Ad esempio, il comando config_digital_out configurerà il pin specificato come GPIO di output digitale e creerà un oggetto interno che l'host può utilizzare per pianificare le modifiche al GPIO specificato. Il parametro oid passato al comando config viene selezionato dall'host e deve essere compreso tra zero e il conteggio massimo fornito nel comando allocate_oids. I comandi di configurazione possono essere eseguiti solo quando il microcontrollore non è in uno stato configurato (cioè prima dell'invio da parte dell'host di finalize_config) e dopo che è stato inviato il comando allocate_oids.
zh_hant: `config_XXX oid=%c ...`：按照慣例，任何以 "config_"開頭的命令都會建立一個新的微控制器對象，並將給定的oid賦予它。例如，config_digital_out命令將把指定的引腳配置為數字輸出GPIO，並建立一個內部對象，主機可以用它來安排改變指定的GPIO的輸出。傳入config命令的oid參數由主機選擇，必須介於0和allocate_oids命令中提供的最大計數之間。config命令只能在微控制器不處於已配置狀態時（即在主機發送finalize_config之前）和allocate_oids命令被髮送之後執行。

source: `finalize_config crc=%u` : The finalize_config command transitions the micro-controller from an unconfigured state to a configured state. The crc parameter passed to the micro-controller is stored and provided back to the host in "config" response messages. By convention, the host takes a 32bit CRC of the configuration it will request and at the start of subsequent communication sessions it checks that the CRC stored in the micro-controller exactly matches its desired CRC. If the CRC does not match then the host knows the micro-controller has not been configured in the state desired by the host.
it: `finalize_config crc=%u` : Il comando finalize_config trasferisce il microcontrollore da uno stato non configurato a uno stato configurato. Il parametro crc passato al microcontrollore viene archiviato e restituito all'host nei messaggi di risposta "config". Per convenzione, l'host prende un CRC a 32bit della configurazione che richiederà e all'avvio delle successive sessioni di comunicazione verifica che il CRC memorizzato nel microcontrollore corrisponda esattamente al CRC desiderato. Se il CRC non corrisponde, l'host sa che il microcontrollore non è stato configurato nello stato desiderato dall'host.
zh_hant: `finalize_config crc=%u`：finalize_config命令將微控制器從未配置狀態轉換為已配置狀態。傳遞給微控制器的crc參數被儲存起來，並在 "config "響應資訊中反饋給主機。按照慣例，主機對它所要求的配置採取32位的CRC，並在隨後的通訊會話開始時，檢查儲存在微控制器中的CRC是否與它所希望的CRC正確匹配。如果CRC不匹配，那麼主機就知道微控制器還沒有被配置到主機所希望的狀態。

source: Common micro-controller objects
it: Oggetti comuni del microcontrollore
zh_hant: 常見的微控制器對像

source: This section lists some commonly used config commands.
it: Questa sezione elenca alcuni comandi di configurazione comunemente usati.
zh_hant: 本節列出了一些常用的配置命令。

source: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : This command creates an internal micro-controller object for the given GPIO 'pin'. The pin will be configured in digital output mode and set to an initial value as specified by 'value' (0 for low, 1 for high). Creating a digital_out object allows the host to schedule GPIO updates for the given pin at specified times (see the queue_digital_out command described below). Should the micro-controller software go into shutdown mode then all configured digital_out objects will be set to 'default_value'. The 'max_duration' parameter is used to implement a safety check - if it is non-zero then it is the maximum number of clock ticks that the host may set the given GPIO to a non-default value without further updates. For example, if the default_value is zero and the max_duration is 16000 then if the host sets the gpio to a value of one then it must schedule another update to the gpio pin (to either zero or one) within 16000 clock ticks. This safety feature can be used with heater pins to ensure the host does not enable the heater and then go off-line.
it: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u` : Questo comando crea un oggetto microcontrollore interno per il dato 'pin' GPIO. Il pin verrà configurato in modalità di uscita digitale e impostato su un valore iniziale come specificato da 'value' (0 per basso, 1 per alto). La creazione di un oggetto digital_out consente all'host di pianificare gli aggiornamenti GPIO per il pin specificato a orari specificati (consultare il comando queue_digital_out descritto di seguito). Se il software del microcontrollore entra in modalità di spegnimento, tutti gli oggetti digital_out configurati verranno impostati su 'default_value'. Il parametro 'max_duration' viene utilizzato per implementare un controllo di sicurezza: se è diverso da zero, è il numero massimo di tick di clock che l'host può impostare il GPIO specificato su un valore non predefinito senza ulteriori aggiornamenti. Ad esempio, se default_value è zero e max_duration è 16000, se l'host imposta gpio su un valore di uno, deve pianificare un altro aggiornamento del pin gpio (su zero o su uno) entro 16000 tick di clock. Questa funzione di sicurezza può essere utilizzata con i pin del riscaldatore per garantire che l'host non abiliti il riscaldatore e quindi vada offline.
zh_hant: `config_digital_out oid=%c pin=%u value=%c default_value=%c max_duration=%u`：該命令為給定的GPIO'pin'建立一個內部微控制器對象。該引腳將被配置為數字輸出模式，並被設定為'value'指定的初始值（0為低，1為高）。建立一個digital_out對像允許主機在指定的時間內對指定引腳重新整理GPIO輸出狀態（見下面描述的queue_digital_out命令）。如果微控制器軟體進入關機模式，那麼所有配置的digital_out對像將被設定為'default_value'。max_duration "參數用於實現安全檢查--如果它是非零，那麼它代表主機可以將指定的GPIO設為非預設值而不需要重新整理的最大時鐘數。例如，如果default_value是0，max_duration是16000，那麼如果主機將gpio設定為1，它必須在16000個時鐘刻度內重新整理gpio引腳的輸出（為0或1）。這個安全功能可用於加熱器引腳，以確保主機不會啟用加熱器后離線。

source: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : This command creates an internal object for hardware based PWM pins that the host may schedule updates for. Its usage is analogous to config_digital_out - see the description of the 'set_pwm_out' and 'config_digital_out' commands for parameter description.
it: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u` : Questo comando crea un oggetto interno per i pin PWM hardware per i quali l'host può pianificare gli aggiornamenti. Il suo utilizzo è analogo a config_digital_out - vedere la descrizione dei comandi 'set_pwm_out' e 'config_digital_out' per la descrizione dei parametri.
zh_hant: `config_pwm_out oid=%c pin=%u cycle_ticks=%u value=%hu default_value=%hu max_duration=%u`：該命令為基於硬體的PWM引腳建立一個內部對象，主機可以定期重新整理。它的用法與config_digital_out類似--參數說明見'set_pwm_out'和'config_digital_out'命令的描述。

source: `config_analog_in oid=%c pin=%u` : This command is used to configure a pin in analog input sampling mode. Once configured, the pin can be sampled at regular interval using the query_analog_in command (see below).
it: `config_analog_in oid=%c pin=%u` : Questo comando viene utilizzato per configurare un pin nella modalità di campionamento analogico. Una volta configurato, il pin può essere campionato a intervalli regolari utilizzando il comando query_analog_in (vedi sotto).
zh_hant: `config_analog_in oid=%c pin=%u`：該命令用於將一個引腳配置為模擬輸入採樣模式。一旦配置完成，就可以使用query_analog_in命令（見下文）以固定的時間間隔對該引腳進行採樣。

source: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : This command creates an internal "endstop" object. It is used to specify the endstop pins and to enable "homing" operations (see the endstop_home command below). The command will configure the specified pin in digital input mode. The 'pull_up' parameter determines whether hardware provided pullup resistors for the pin (if available) will be enabled. The 'stepper_count' parameter specifies the maximum number of steppers that this endstop may need to halt during a homing operation (see endstop_home below).
it: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : Questo comando crea un oggetto "finecorsa" interno. Viene utilizzato per specificare i relativi pin e per abilitare le operazioni di "homing" (vedere il comando endstop_home di seguito). Il comando configurerà il pin specificato nella modalità di input digitale. Il parametro 'pull_up' determina se i resistori pullup forniti dall'hardware per il pin (se disponibili) saranno abilitati. Il parametro 'stepper_count' specifica il numero massimo di stepper che potrebbe essere necessario arrestare questo endstop durante un'operazione di homing (vedere endstop_home di seguito).
zh_hant: `config_endstop oid=%c pin=%c pull_up=%c stepper_count=%c` : 該命令建立一個內部的 "endstop"對象。它用於指定限位開關的引腳，並啟用 "homing "操作（見下面的endstop_home命令）。該命令將把指定的引腳配置為數字輸入模式。『pull_up』參數決定是否啟用硬體為引腳提供的上拉電阻（如果有的話）。『stepper_count』參數規定了在歸零操作中，該限位開關觸發器可能需要的最大步進數（見下文endstop_home）。

source: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : This command creates an internal SPI object. It is used with spi_transfer and spi_send commands (see below). The "bus" identifies the SPI bus to use (if the micro-controller has more than one SPI bus available). The "pin" specifies the chip select (CS) pin for the device. The "mode" is the SPI mode (should be between 0 and 3). The "rate" parameter specifies the SPI bus rate (in cycles per second). Finally, the "shutdown_msg" is an SPI command to send to the given device should the micro-controller go into a shutdown state.
it: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s` : Questo comando crea un oggetto SPI interno. Viene utilizzato con i comandi spi_transfer e spi_send (vedi sotto). Il "bus" identifica il bus SPI da utilizzare (se il microcontrollore ha più di un bus SPI disponibile). Il "pin" specifica il pin di selezione del chip (CS) per il dispositivo. La "modalità" è la modalità SPI (dovrebbe essere compresa tra 0 e 3). Il parametro "rate" specifica la velocità del bus SPI (in cicli al secondo). Infine, "shutdown_msg" è un comando SPI da inviare al dispositivo specificato se il microcontrollore entra in uno stato di spegnimento.
zh_hant: `config_spi oid=%c bus=%u pin=%u mode=%u rate=%u shutdown_msg=%*s`：該命令建立了一個內部SPI對象。它與spi_transfer和spi_send命令一起使用（見下文）。"bus"標識了要使用的SPI匯流排（如果微控制器有一個以上的SPI匯流排可用）。"pin"指定了裝置的片選（CS）引腳。"mode"指定SPI模式（應該在0到3之間）。"rate "參數指定了SPI匯流排的速率（以每秒週期為單位）。最後，"shutdown_msg "是在微控制器進入關機狀態時向給定裝置發送的SPI命令。

source: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : This command is similar to config_spi, but without a CS pin definition. It is useful for SPI devices that do not have a chip select line.
it: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : Questo comando è simile a config_spi, ma senza una definizione di pin CS. È utile per i dispositivi SPI che non dispongono di una linea di selezione del chip.
zh_hant: `config_spi_without_cs oid=%c bus=%u mode=%u rate=%u shutdown_msg=%*s` : 這個命令類似於config_spi，但是沒有CS引腳的定義。它對沒有晶片選擇線的SPI裝置很有用。

source: Common commands
it: Comandi comuni
zh_hant: 常用命令

source: This section lists some commonly used run-time commands. It is likely only of interest to developers looking to gain insight into Klipper.
it: Questa sezione elenca alcuni comandi comunemente usati durante il run-time. È probabilmente di interesse solo per gli sviluppatori che cercano di ottenere informazioni su Klipper.
zh_hant: 本節列出了一些常用的執行時命令。對希望深入瞭解Klipper的開發者可能會感興趣。

source: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : This command configures a digital output pin (as created by config_digital_out) to use "software PWM". The 'cycle_ticks' is the number of clock ticks for the PWM cycle. Because the output switching is implemented in the micro-controller software, it is recommended that 'cycle_ticks' correspond to a time of 10ms or greater.
it: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u` : Questo comando configura un pin come uscita digitale (come creato da config_digital_out) per usare "software PWM". 'cycle_ticks' è il numero di tick di clock per il ciclo PWM. Poiché la commutazione dell'uscita è implementata nel software del microcontrollore, si consiglia che 'cycle_ticks' corrisponda a un tempo di 10 ms o superiore.
zh_hant: `set_digital_out_pwm_cycle oid=%c cycle_ticks=%u`：該命令將數字輸出引腳（由config_digital_out建立）配置為使用 "軟體PWM"。'cycle_ticks' 是PWM週期的時鐘數。因為輸出切換是在微控制器軟體中實現的，建議把'cycle_ticks'對應的時間設為10ms或更大。
