Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/MCU_Commands.po
Languages: it, zh_hant

source: `queue_digital_out oid=%c clock=%u on_ticks=%u` : This command will schedule a change to a digital output GPIO pin at the given clock time. To use this command a 'config_digital_out' command with the same 'oid' parameter must have been issued during micro-controller configuration. If 'set_digital_out_pwm_cycle' has been called then 'on_ticks' is the on duration (in clock ticks) for the pwm cycle. Otherwise, 'on_ticks' should be either 0 (for low voltage) or 1 (for high voltage).
it: `queue_digital_out oid=%c clock=%u on_ticks=%u` : Questo comando pianificherà una modifica a un pin GPIO dell'uscita digitale per un orario specifico. Per utilizzare questo comando è necessario che durante la configurazione del microcontrollore sia stato emesso un comando 'config_digital_out' con lo stesso parametro 'oid'. Se è stato chiamato 'set_digital_out_pwm_cycle', allora 'on_ticks' è la durata di attivazione (in tick di clock) per il ciclo pwm. Altrimenti, 'on_ticks' dovrebbe essere 0 (per bassa tensione) o 1 (per alta tensione).
zh_hant: `queue_digital_out oid=%c clock=%u on_ticks=%u` : 這個命令將安排在設定的時鐘時間內改變數字輸出GPIO引腳。要使用這條命令，必須在微控制器配置過程中發出具有相同『oid』參數的'config_digital_out'命令。如果'set_digital_out_pwm_cycle'已經被呼叫，那麼'on_ticks'就是pwm週期的開啟時間（以時鐘數為單位）。否則，'on_ticks'應該是0（低電壓）或1（高電壓）。

source: `queue_pwm_out oid=%c clock=%u value=%hu` : Schedules a change to a hardware PWM output pin. See the 'queue_digital_out' and 'config_pwm_out' commands for more info.
it: `queue_pwm_out oid=%c clock=%u value=%hu` : Pianifica una modifica a un pin di uscita PWM hardware. Per ulteriori informazioni, vedere i comandi 'queue_digital_out' e 'config_pwm_out'.
zh_hant: `queue_pwm_out oid=%c clock=%u value=%hu` ：安排改變一個硬體PWM輸出引腳。更多資訊請參考 'queue_digital_out' 和 'config_pwm_out' 命令。

source: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : This command sets up a recurring schedule of analog input samples. To use this command a 'config_analog_in' command with the same 'oid' parameter must have been issued during micro-controller configuration. The samples will start as of 'clock' time, it will report on the obtained value every 'rest_ticks' clock ticks, it will over-sample 'sample_count' number of times, and it will pause 'sample_ticks' number of clock ticks between over-sample samples. The 'min_value' and 'max_value' parameters implement a safety feature - the micro-controller software will verify the sampled value (after any oversampling) is always between the supplied range. This is intended for use with pins attached to thermistors controlling heaters - it can be used to check that a heater is within a temperature range.
it: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu` : Questo comando imposta una pianificazione ricorrente di campionamenti di un ingresso analogico. Per utilizzare questo comando è necessario che durante la configurazione del microcontrollore sia stato emesso un comando 'config_analog_in' con lo stesso parametro 'oid'. I campioni inizieranno a partire dall'ora 'clock', riporterà sul valore ottenuto ogni tick di clock 'rest_ticks', sovracampionerà il numero di 'sample_count' e metterà in pausa il numero di tick di clock 'sample_ticks' tra i sovacampionamenti. I parametri 'min_value' e 'max_value' implementano una funzione di sicurezza: il software del microcontrollore verificherà che il valore campionato (dopo qualsiasi sovracampionamento) sia sempre compreso nell'intervallo fornito. Questo è destinato all'uso con pin collegati a termistori che controllano i riscaldatori: può essere utilizzato per verificare che un riscaldatore rientri in un intervallo di temperatura.
zh_hant: `query_analog_in oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u min_value=%hu max_value=%hu`：此命令設定了一個對模擬輸入的循環採樣。要使用這條命令，必須在微控制器配置時發出具有相同'oid'參數的 'config_analog_in '命令。採樣將從'clock'時間開始，它將每隔'rest_ticks'時鐘數報告獲得的值，'sample_count'是過量採樣次數，'sample_ticks'是在過量採樣之間暫停的時鐘數。"min_value "和 "max_value "參數實現了安全功能--微控制器軟體將驗證採樣值（在每次過採樣之後）總是在安全範圍內。這是為連線到控制加熱器的熱敏電阻的引腳而設計的--它可以用來檢查加熱器是否在一個溫度範圍內。

source: `get_clock` : This command causes the micro-controller to generate a "clock" response message. The host sends this command once a second to obtain the value of the micro-controller clock and to estimate the drift between host and micro-controller clocks. It enables the host to accurately estimate the micro-controller clock.
it: `get_clock` : Questo comando fa sì che il microcontrollore generi un messaggio di risposta "clock". L'host invia questo comando una volta al secondo per ottenere il valore dell'orologio del microcontrollore e per stimare la deriva tra gli orologi dell'host e del microcontrollore. Consente all'host di stimare con precisione l'orologio del microcontrollore.
zh_hant: `get_clock`：該命令使微控制器產生一個 "clock"響應訊息。主機每秒發送一次這個命令，以獲得微控制器的時鐘值，並估計主機和微控制器時鐘之間的漂移。它使主機能夠準確估計微控制器的時鐘。

source: Stepper commands
it: Comandi motori passopasso
zh_hant: 步進器命令

source: `queue_step oid=%c interval=%u count=%hu add=%hi` : This command schedules 'count' number of steps for the given stepper, with 'interval' number of clock ticks between each step. The first step will be 'interval' number of clock ticks since the last scheduled step for the given stepper. If 'add' is non-zero then the interval will be adjusted by 'add' amount after each step. This command appends the given interval/count/add sequence to a per-stepper queue. There may be hundreds of these sequences queued during normal operation. New sequence are appended to the end of the queue and as each sequence completes its 'count' number of steps it is popped from the front of the queue. This system allows the micro-controller to queue potentially hundreds of thousands of steps - all with reliable and predictable schedule times.
it: `queue_step oid=%c interval=%u count=%hu add=%hi` : Questo comando pianifica il 'conteggio' del numero di passi per il dato stepper, con 'intervallo' il numero di tick di clock tra ogni passo. Il primo passo sarà il numero "intervallo" di tick di clock dall'ultimo passo programmato per il dato stepper. Se 'add' è diverso da zero, l'intervallo verrà regolato in base all'importo di 'add' dopo ogni passaggio. Questo comando aggiunge la sequenza intervallo/conteggio/aggiunta data a una coda per stepper. Potrebbero esserci centinaia di queste sequenze in coda durante il normale funzionamento. La nuova sequenza viene aggiunta alla fine della coda e quando ogni sequenza completa il suo numero di "conteggi" di passaggi viene estratta dalla parte anteriore della coda. Questo sistema consente al microcontrollore di mettere in coda potenzialmente centinaia di migliaia di passaggi, il tutto con tempi di pianificazione affidabili e prevedibili.
zh_hant: `queue_step oid=%c interval=%u count=%hu add=%hi`：該命令安排指定的步進電機輸出'count'個步數，'interval'是每步之間的時鐘數間隔。命令中的第一步與上一個步進輸出命令最後一步的時間間隔為'interval'個時鐘數。如果'add'不為零，那麼每步之後的間隔將以'add'的增量調整。該命令將給定的間隔/計數/增量序列附加到每個步進佇列中。在正常操作中，可能有數百個這樣的序列排隊。新的序列被新增到佇列的末尾，當每個序列完成了它的 'count'步數后它就從佇列的前面彈出去。這個系統允許微控制器將幾十萬步排入佇列--所有這些都有可靠且可預測的排程時序。

source: `set_next_step_dir oid=%c dir=%c` : This command specifies the value of the dir_pin that the next queue_step command will use.
it: `set_next_step_dir oid=%c dir=%c` : Questo comando specifica il valore del dir_pin che verrà utilizzato dal comando queue_step successivo.
zh_hant: `set_next_step_dir oid=%c dir=%c`：該命令指定了下一個queue_step命令將使用的dir_pin的值。

source: `reset_step_clock oid=%c clock=%u` : Normally, step timing is relative to the last step for a given stepper. This command resets the clock so that the next step is relative to the supplied 'clock' time. The host usually only sends this command at the start of a print.
it: `reset_step_clock oid=%c clock=%u` : Normalmente, la temporizzazione del passo è relativo all'ultimo passo per un dato stepper. Questo comando azzera l'orologio in modo che il passo successivo sia relativo all'ora fornita. L'host di solito invia questo comando solo all'inizio di una stampa.
zh_hant: `reset_step_clock oid=%c clock=%u`：通常情況下步進時序是相對於給定步進的上一步。這條命令重置了時鐘，使下一步是相對於提供的 'clock' 時間。通常主機只在列印開始時發送此命令。

source: `stepper_get_position oid=%c` : This command causes the micro-controller to generate a "stepper_position" response message with the stepper's current position. The position is the total number of steps generated with dir=1 minus the total number of steps generated with dir=0.
it: `stepper_get_position oid=%c` : Questo comando fa sì che il microcontrollore generi un messaggio di risposta "stepper_position" con la posizione corrente dello stepper. La posizione è il numero totale di passi generati con dir=1 meno il numero totale di passi generati con dir=0.
zh_hant: `stepper_get_position oid=%c`：該命令使微控制器產生一個 "stepper_position "響應訊息，其中包含步進器的當前位置。該位置是dir=1時產生的總步數減去dir=0時的總步數。

source: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : This command is used during stepper "homing" operations. To use this command a 'config_endstop' command with the same 'oid' parameter must have been issued during micro-controller configuration. When this command is invoked, the micro-controller will sample the endstop pin every 'rest_ticks' clock ticks and check if it has a value equal to 'pin_value'. If the value matches (and it continues to match for 'sample_count' additional samples spread 'sample_ticks' apart) then the movement queue for the associated stepper will be cleared and the stepper will come to an immediate halt. The host uses this command to implement homing - the host instructs the endstop to sample for the endstop trigger and then it issues a series of queue_step commands to move a stepper towards the endstop. Once the stepper hits the endstop, the trigger will be detected, the movement halted, and the host notified.
it: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c` : Questo comando viene utilizzato durante le operazioni di "homing" dello stepper. Per utilizzare questo comando è necessario che durante la configurazione del microcontrollore sia stato emesso un comando 'config_endstop' con lo stesso parametro 'oid'. Quando viene invocato questo comando, il microcontrollore campiona il pin finecorsa ogni tick di clock "rest_ticks" e controlla se ha un valore uguale a "pin_value". Se il valore corrisponde (e continua a corrispondere per 'sample_count' campioni aggiuntivi separati da 'sample_ticks'), la coda di movimento per lo stepper associato verrà cancellata e lo stepper si arresterà immediatamente. L'host utilizza questo comando per implementare l'homing: l'host indica al finecorsa di eseguire il campionamento per il trigger endstop e quindi emette una serie di comandi queue_step per spostare uno stepper verso il finecorsa. Una volta che lo stepper raggiunge il finecorsa, il trigger verrà rilevato, il movimento verrà interrotto e l'host verrà informato.
zh_hant: `endstop_home oid=%c clock=%u sample_ticks=%u sample_count=%c rest_ticks=%u pin_value=%c`：該命令用於步進電機 "homing"操作。要使用這條命令，必須在微控制器配置過程中發出具有相同 'oid '參數的 'config_endstop '命令。當這個命令被呼叫時，微控制器將在每一個'rest_ticks'時鐘刻度上對限位開關引腳進行採樣，並檢查它的值是否等於'pin_value'。如果開關被觸發（並且以間隔'sample_ticks'為週期，額外持續'sample_count'次被觸發），那麼相關步進的運動佇列將被清除，步進將立即停止。主機使用該命令實現歸位–主機指示限位開關對限位開關的觸發進行採樣，然後發出一系列queue_step命令，使步進向限位移動。一旦步進電機撞到限位開關，檢測到觸發，運動就會停止並通知主機。

source: Move queue
it: Coda movimento
zh_hant: 運動佇列

source: Each queue_step command utilizes an entry in the micro-controller "move queue". This queue is allocated when it receives the "finalize_config" command, and it reports the number of available queue entries in "config" response messages.
it: Ogni comando queue_step utilizza una voce nella "coda di movimento" del microcontrollore. Questa coda viene allocata quando riceve il comando "finalize_config" e segnala il numero di voci di coda disponibili nei messaggi di risposta "config".
zh_hant: 每個queue_step命令都利用了微控制器 "move queue "中的一個條目。這個佇列是在它收到 "finalize_config "命令時分配的，它在 "config "響應資訊中報告可用佇列條目的數量。

source: It is the responsibility of the host to ensure that there is available space in the queue before sending a queue_step command. The host does this by calculating when each queue_step command completes and scheduling new queue_step commands accordingly.
it: È responsabilità dell'host assicurarsi che ci sia spazio disponibile nella coda prima di inviare un comando queue_step. L'host esegue questa operazione calcolando il completamento di ciascun comando queue_step e pianificando di conseguenza i nuovi comandi queue_step.
zh_hant: 在發送queue_step命令之前，主機有責任確保佇列中有可用空間。這需要主機通過計算每個queue_step命令完成的時間並相應地安排新的queue_step命令來實現。

source: SPI Commands
it: Comandi SPI
zh_hant: SPI 命令

source: `spi_transfer oid=%c data=%*s` : This command causes the micro-controller to send 'data' to the spi device specified by 'oid' and it generates a "spi_transfer_response" response message with the data returned during the transmission.
it: `spi_transfer oid=%c data=%*s` : questo comando fa sì che il microcontrollore invii dati 'data' al dispositivo spi specificato da 'oid' e genera un messaggio di risposta "spi_transfer_response" con i dati restituiti durante la trasmissione .
zh_hant: `spi_transfer oid=%c data=%*s`：這條命令使微控制器向 'oid '指定的spi裝置發送 'data' ，並產生一個 "spi_transfer_response "的響應訊息，其中包括傳輸期間返回的數據。

source: `spi_send oid=%c data=%*s` : This command is similar to "spi_transfer", but it does not generate a "spi_transfer_response" message.
it: `spi_send oid=%c data=%*s` : Questo comando è simile a "spi_transfer", ma non genera un messaggio "spi_transfer_response".
zh_hant: `spi_send oid=%c data=%*s`：這個命令與 "spi_transfer "類似，但它不產生 "spi_transfer_response "訊息。

source: MCU commands
it: Comandi MCU
zh_hant: MCU命令

source: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : This command creates an internal stepper object. The 'step_pin' and 'dir_pin' parameters specify the step and direction pins respectively; this command will configure them in digital output mode. The 'invert_step' parameter specifies whether a step occurs on a rising edge (invert_step=0) or falling edge (invert_step=1). The 'step_pulse_ticks' parameter specifies the minimum duration of the step pulse. If the mcu exports the constant 'STEPPER_BOTH_EDGE=1' then setting step_pulse_ticks=0 and invert_step=-1 will setup for stepping on both the rising and falling edges of the step pin.
it: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u` : Questo comando crea un oggetto stepper interno. I parametri 'step_pin' e 'dir_pin' specificano rispettivamente i pin del passo e della direzione; questo comando li configurerà in modalità uscita digitale. Il parametro 'invert_step' specifica se un passo si verifica su un fronte di salita (invert_step=0) o discendente (invert_step=1). Il parametro 'step_pulse_ticks' specifica la durata minima dell'impulso di passo. Se l'mcu esporta la costante 'STEPPER_BOTH_EDGE=1', l'impostazione di step_pulse_ticks=0 e invert_step=-1 imposterà il passaggio su entrambi i fronti di salita e di discesa dello step pin.
zh_hant: `config_stepper oid=%c step_pin=%c dir_pin=%c invert_step=%c step_pulse_ticks=%u`：該命令建立一個內部步進器對象。'step_pin'和'dir_pin'參數分別指定步進和方向引腳；該命令將把它們配置為數字輸出模式。'invert_step'參數指定步進是發生在上升沿（invert_step=0）還是下降沿（invert_step=1）。'step_pulse_ticks'參數指定了步進脈衝的最小持續時間。如果MCU輸出常數 "STEPPER_BOTH_EDGE=1"，那麼設定step_pulse_ticks=0和invert_step=-1將設定在步進引腳的上升沿和下降沿都進行步進輸出。
