Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Overview.po
Languages: es

source: Welcome to the Klipper documentation. If new to Klipper, start with the [features](Features.md) and [installation](Installation.md) documents.
es: Bienvenido a la documentación de Klipper. Si eres nuevo con Klipper, comienza por leer los documentos [Funcionalidades](Features.md) e [Instalación](Installation.md).

source: Overview information
es: Información general

source: [Features](Features.md): A high-level list of features in Klipper.
es: [Funcionalidades](Features.md): Una lista detallada de las funcionalidades de Klipper.

source: [FAQ](FAQ.md): Frequently asked questions.
es: [Preguntas frecuentes](FAQ.md): Preguntas más frecuentes.

source: [Releases](Releases.md): The history of Klipper releases.
es: [Versiones](Releases.md): El historial de versiones de Klipper.

source: [Config changes](Config_Changes.md): Recent software changes that may require users to update their printer config file.
es: [Cambios en la configuración](Config_Changes.md): Modificaciones recientes del software que pueden requerir que el usuario tenga que actualizar el archivo de configuración de su impresora.

source: [Contact](Contact.md): Information on bug reporting and general communication with the Klipper developers.
es: [Contacto](Contact.md): Información sobre cómo reportar errores o comunicarse con los desarrolladores de Klipper.

source: [Installation](Installation.md): Guide to installing Klipper.
es: [Instalación](Installation.md): Guía de instalación de Klipper.

source: [Config Reference](Config_Reference.md): Description of config parameters.
es: [Referencias para la Configuración](Config_Reference.md): Descripción de los parámetros de la configuración.

source: [Rotation Distance](Rotation_Distance.md): Calculating the rotation_distance stepper parameter.
es: [Distancia de Rotación](Rotation_Distance.md): Cómo calcular el parámetro distancia_de_rotación del motor a pasos.

source: [Config checks](Config_checks.md): Verify basic pin settings in the config file.
es: [Validación de configuración](Config_checks.md): Verificar las configuraciónes básicas del PIN en el archivo de configuración.

source: [Bed level](Bed_Level.md): Information on "bed leveling" in Klipper.
es: [Nivel de la cama](Bed_Level.md): Información sobre la "nivelación de la cama" en Klipper.

source: [Delta calibrate](Delta_Calibrate.md): Calibration of delta kinematics.
es: [Calibración delta](Delta_Calibrate.md): Calibración de la cinemática delta.

source: [Probe calibrate](Probe_Calibrate.md): Calibration of automatic Z probes.
es: [Calibración de la sonda](Probe_Calibrate.md): Calibración de sondas Z automáticas.

source: [BL-Touch](BLTouch.md): Configure a "BL-Touch" Z probe.
es: [BL-Touch](BLTouch.md): Configura una sonda Z "BL-Touch".

source: [Manual level](Manual_Level.md): Calibration of Z endstops (and similar).
es: [Nivel manual](Manual_Level.md): Calibración de paradas finales de Z (y similares).

source: [Bed Mesh](Bed_Mesh.md): Bed height correction based on XY locations.
es: [Cama de malla](Bed_Mesh.md): Corrección de la altura de la cama basada en las coordenadas XY.

source: [Endstop phase](Endstop_Phase.md): Stepper assisted Z endstop positioning.
es: [Fase de parada final](Endstop_Phase.md): Posicionamiento del tope Z asistido por el motor a pasos.

source: [Resonance compensation](Resonance_Compensation.md): A tool to reduce ringing in prints.
es: [Compensación de resonancia](Resonance_Compensation.md): Una herramienta para reducir las irregularidades en las impresiones.

source: [Measuring resonances](Measuring_Resonances.md): Information on using adxl345 accelerometer hardware to measure resonance.
es: [Resonancias de medida](Measuring_Resonances.md): Información sobre el uso del acelerómetro adxl345 para medir la resonancia.

source: [Pressure advance](Pressure_Advance.md): Calibrate extruder pressure.
es: [Avance de presión](Pressure_Advance.md): Calibrar la presión del extrusor.

source: [Slicers](Slicers.md): Configure "slicer" software for Klipper.
es: [Rebanadores](Slicers.md): Configuración del software de "rebanadores" para Klipper.

source: [Command Templates](Command_Templates.md): G-Code macros and conditional evaluation.
es: [Plantillas de comandos](Command_Templates.md): Macros de código G y evaluación condicional.

source: [Status Reference](Status_Reference.md): Information available to macros (and similar).
es: [Referencia de estado](Status_Reference.md): Información disponible para las macros (y similares).

source: [TMC Drivers](TMC_Drivers.md): Using Trinamic stepper motor drivers with Klipper.
es: [Controladores de TMC](TMC_Drivers.md): Usando los controladors del motor a pasos trinámicos con Klipper.

source: [PWM tools](Using_PWM_Tools.md): Guide on how to use PWM controlled tools such as lasers or spindles.
es: [Herramientas PWM](Using_PWM_Tools.md): Guía de uso de herramientas controladas mediante PWM como son los láseres y ejes.

source: [G-Codes](G-Codes.md): Information on commands supported by Klipper.
es: [Códigos G](G-Codes.md): información relativa a las órdenes que Klipper admite.

source: Developer Documentation
es: Documentación para desarrolladores

source: [Code overview](Code_Overview.md): Developers should read this first.
es: [Visión de conjunto del código](Code_Overview.md): lectura primordial para desarrolladores.

source: [Kinematics](Kinematics.md): Technical details on how Klipper implements motion.
es: [Cinematica](Kinematics.md): Detalles tecnicos sobre como Klipper implementa el movimiento.

source: [Protocol](Protocol.md): Information on the low-level messaging protocol between host and micro-controller.
es: [Protocolo](Protocol.md): información sobre el protocolo de mensajería de bajo nivel que hay entre el anfitrión y el microcontrolador.

source: [API Server](API_Server.md): Information on Klipper's command and control API.
es: [Servidor de API](API_Server.md): información relativa a la API de órdenes y control de Klipper.

source: [MCU commands](MCU_Commands.md): A description of low-level commands implemented in the micro-controller software.
es: [Órdenes de MCU](MCU_Commands.md): una descripción de las órdenes de bajo nivel que incluye el sóftwer del microcontrolador.

source: [CAN bus protocol](CANBUS_protocol.md): Klipper CAN bus message format.
es: [Protocolo de bus CAN](CANBUS_protocol.md): el formato de mensajes de bus CAN de Klipper.

source: [Debugging](Debugging.md): Information on how to test and debug Klipper.
es: [Depuración](Debugging.md): información sobre cómo poner a prueba y depurar Klipper.

source: [Benchmarks](Benchmarks.md): Information on the Klipper benchmark method.
es: [Puntos de referencia](Benchmarks.md): Información sobre el método de referencia de Klipper.

source: [Contributing](CONTRIBUTING.md): Information on how to submit improvements to Klipper.
es: [Contribuir](CONTRIBUTING.md): información para enviar mejoras a Klipper.

source: [Packaging](Packaging.md): Information on building OS packages.
es: [Empaquetamiento](Packaging.md): información sobre la creación de paquetes para sistemas operativos.

source: Device Specific Documents
es: Documentos específicos de un dispositivo

source: [Example configs](Example_Configs.md): Information on adding an example config file to Klipper.
es: [Ejemplos de configuración](Example_Configs.md): Información sobre la adición de una configuración de ejemplo a Klipper.

source: [SDCard Updates](SDCard_Updates.md): Flash a micro-controller by copying a binary to an sdcard in the micro-controller.
es: [Actualizaciones de la tarjeta SD](SDCard_Updates.md): Flashear un micro controlador mediante la copia de un binario a una tarjeta SD en el micro controlador.

source: [Raspberry Pi as Micro-controller](RPi_microcontroller.md): Details for controlling devices wired to the GPIO pins of a Raspberry Pi.
es: [Raspberry PI como un micro controlador](RPI_microcontroller.md): Detalles para controlar dispositivos cableados a los pines GPIO de la Raspberry Pi.

source: [Bootloaders](Bootloaders.md): Developer information on micro-controller flashing.
es: [Cargadores de arranque](Bootloaders.md): Información para desarrolladores sobre el flasheo de microcontroladores.

source: [CAN bus](CANBUS.md): Information on using CAN bus with Klipper.
es: [Bus CAN](CANBUS.md): información para utilizar un bus CAN con Klipper.

source: [TSL1401CL filament width sensor](TSL1401CL_Filament_Width_Sensor.md)
es: [Sensor de anchura del filamento TSL1401CL](TSL1401CL_Filament_Width_Sensor.md)

source: Overview
es: Visión de conjunto

source: Installation and Configuration
es: Instalación y configuración

source: [Multi-MCU Homing](Multi_MCU_Homing.md): Homing and probing using multiple micro-controllers.
es: [Busqueda de blancos con varias MCU](Multi_MCU_Homing.md): Búsqueda y sondea usando varios micro controladores.

source: [Skew correction](Skew_Correction.md): Adjustments for axes not perfectly square.
es: [Corrección de sesgos](Skew_Correction.md): Ajustes para los ejes que no estén perfectamente cuadrados.

source: [Beaglebone](Beaglebone.md): Details for running Klipper on the Beaglebone PRU.
es: [Beaglebone](Beaglebone.md): Detalles para correr Klipper en la PRU de Beaglebone.

source: [Hall filament width sensor](Hall_Filament_Width_Sensor.md)
es: [Sensor de anchura del filamento Hall](Hall_Filament_Width_Sensor.md)

source: [Exclude Object](Exclude_Object.md): The guide to the Exclude Objecs implementation.
es: [Excluir Objeto](Exclude_Object.md): La guía sobre la implementación de Excluir Objetos.
