Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Packaging.po
Languages: it, zh_hans, zh_hant

source: Klipper is somewhat of a packaging anomaly among python programs, as it doesn't use setuptools to build and install. Some notes regarding how best to package it are as follows:
it: Klipper è in qualche modo un'anomalia tra i programmi Python per quanto riguarda impacchettamento, in quanto non usa setuptools per costruire e installare. Alcune note riguardanti il modo migliore per impacchettarlo sono le seguenti:
zh_hans: Klipper 是个有点反常的 Python 程序，因为它不使用 setuptools 来构建和安装。关于如何最好地打包它的一些说明如下：
zh_hant: Klipper 是個有點反常的 Python 程式，因為它不使用 setuptools 來構建和安裝。關於如何最好地打包它的一些說明如下：

source: C modules
it: Moduli C
zh_hans: C 模块
zh_hant: C 模組

source: Klipper uses a C module to handle some kinematics calculations more quickly. This module needs to be compiled at packaging time to avoid introducing a runtime dependency on a compiler. To compile the C module, run `python2 klippy/chelper/__init__.py`.
it: Klipper utilizza un modulo C per gestire più rapidamente alcuni calcoli cinematici. Questo modulo deve essere compilato al momento per evitare di introdurre una dipendenza di runtime da un compilatore. Per compilare il modulo C, esegui `python2 klippy/chelper/__init__.py`.
zh_hans: Klipper 使用一个 C 模块来更快地处理一些运动学计算。此模块需要在包装时间进行编译，以避免对编译器的运行环境依赖。要编译 C 模块，请运行 `python2 klippy/chelper/__init__.py`。
zh_hant: Klipper 使用一個 C 模組來更快地處理一些運動學計算。此模組需要在包裝時間進行編譯，以避免對編譯器的執行環境依賴。要編譯 C 模組，請執行 `python2 klippy/chelper/__init__.py`。

source: Compiling python code
it: Compilazione di codice python
zh_hans: 编译 Python 代码
zh_hant: 編譯 Python 程式碼

source: Many distributions have a policy of compiling all python code before packaging to improve startup time. You can do this by running `python2 -m compileall klippy`.
it: Molte distribuzioni hanno una politica di compilazione di tutto il codice Python prima del packaging per migliorare i tempi di avvio. Puoi farlo eseguendo `python2 -m compileall klippy`.
zh_hans: 许多发行版都有在打包之前编译所有 Python 代码以缩短启动时间的规定。您可以通过运行 `python2 -m compileall klippy` 来完成此操作。
zh_hant: 許多發行版都有在打包之前編譯所有 Python 程式碼以縮短啟動時間的規定。您可以通過執行 `python2 -m compileall klippy` 來完成此操作。

source: Versioning
it: Versione
zh_hans: 版本管理
zh_hant: 版本管理

source: If you are building a package of Klipper from git, it is usual practice not to ship a .git directory, so the versioning must be handled without git. To do this, use the script shipped in `scripts/make_version.py` which should be run as follows: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
it: Se stai compilando un pacchetto di Klipper da git, è normale non spedire una directory .git, quindi il controllo delle versioni deve essere gestito senza git. Per fare ciò, usa lo script fornito in `scripts/make_version.py` che dovrebbe essere eseguito come segue: `python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`.
zh_hans: 如果你从 git 构建 Klipper 包，通常的做法是不提供 .git 目录，所以版本管理必须在没有 git 的情况下处理。要做到这一点，请使用 `scripts/make_version.py` 中提供的脚本，该脚本应按如下方式运行：`python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`。
zh_hant: 如果你從 git 構建 Klipper 包，通常的做法是不提供 .git 目錄，所以版本管理必須在沒有 git 的情況下處理。要做到這一點，請使用 `scripts/make_version.py` 中提供的指令碼，該指令碼應按如下方式執行：`python2 scripts/make_version.py YOURDISTRONAME > klippy/.version`。

source: Sample packaging script
it: Esempio di script di packaging
zh_hans: 示例打包脚本
zh_hant: 示例打包指令碼

source: Packaging Klipper
it: Klipper packaging
zh_hans: 打包 Klipper
zh_hant: 打包 Klipper

source: klipper-git is packaged for Arch Linux, and has a PKGBUILD (package build script) available at [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
it: klipper-git è un pacchetto per Arch Linux e ha un PKGBUILD (script di compilazione del pacchetto) disponibile su [Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git).
zh_hans: klipper-git 是 klipper 的 Arch Linux 软件包，在[Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git)上有一个 PKGBUILD（软件包构建脚本）。
zh_hant: klipper-git 是 klipper 的 Arch Linux 軟體包，在[Arch User Repositiory](https://aur.archlinux.org/cgit/aur.git/tree/PKGBUILD?h=klipper-git)上有一個 PKGBUILD（軟體包構建指令碼）。
