Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: hu, it, zh_hant

source: Calibrating probe X and Y offsets
hu: A szonda X és Y eltolásának kalibrálása
it: Calibrazione degli offset X e Y della sonda
zh_hant: 探針X/Y偏移校準

source: To calibrate the X and Y offset, navigate to the OctoPrint "Control" tab, home the printer, and then use the OctoPrint jogging buttons to move the head to a position near the center of the bed.
hu: Az X és Y eltolás kalibrálásához navigáljon az OctoPrint "Control" fülre, állítsd be a nyomtatót, majd az OctoPrint léptető gombjaival mozgasd a fejet a tárgyasztal közepéhez közeli pozícióba.
it: Per calibrare l'offset X e Y, vai alla scheda "Controllo" di OctoPrint, avvia la stampante, quindi usa i pulsanti di spostamento di OctoPrint per spostare la testa in una posizione vicino al centro del piatto.
zh_hant: 為校正X、Y偏移值，首先打開OctoPrint中的「控制（control）」子頁面，進行三軸的歸零，然後用OctoPrint內的手調按鈕將噴嘴移動到熱床的中央位置。

source: Place a piece of blue painters tape (or similar) on the bed underneath the probe. Navigate to the OctoPrint "Terminal" tab and issue a PROBE command:
hu: Helyezzen egy darab kék festőszalagot (vagy hasonlót) a tárgyasztalra a szonda alá. Navigáljon az OctoPrint "Terminal" fülre, és adjon ki egy PROBE parancsot:
it: Metti un pezzo di nastro adesivo blu (o simile) sul piatto sotto la sonda. Passare alla scheda "Terminale" di OctoPrint ed emettere un comando PROBE:
zh_hant: 探針下方的熱床上貼上一片美紋紙（或類似的薄片）。轉到OctoPrint的「命令列（Terminal）」子頁，輸入PROBE 命令並回車：

source: Place a mark on the tape directly under where the probe is (or use a similar method to note the location on the bed).
hu: Helyezzen egy jelet a szalagra közvetlenül a szonda alatt (vagy hasonló módszerrel jegyezze fel a helyet a tárgyasztalon).
it: Metti un segno sul nastro direttamente sotto il punto in cui si trova la sonda (o usa un metodo simile per annotare la posizione sul letto).
zh_hant: 在探針正下方的美紋紙上，用記號筆標註探針觸發的位置（或使用其他方法記錄下探針觸發時的物理位置）。

source: Issue a `GET_POSITION` command and record the toolhead XY location reported by that command. For example if one sees:
hu: Adjon ki egy `GET_POSITION` parancsot, és rögzítse a parancs által jelentett nyomtatófej X-Y pozícióját. Például, ha a következőket látjuk:
it: Emettere un comando `GET_POSITION` e registrare la posizione XY della testa riportata da quel comando. Ad esempio se si vede:
zh_hant: 在命令列中輸入`GET_POSITION`命令，回車，記錄下此時列印頭的XY位置。輸出如下：

source: then one would record a probe X position of 46.5 and probe Y position of 27.
hu: akkor a szonda X pozíciója 46,5 és Y pozíciója 27.
it: quindi si registrerebbe una posizione X della sonda di 46,5 e una posizione Y della sonda di 27.
zh_hant: 此時，我們可以知道探針觸發的X座標為46.5，Y座標為27。

source: After recording the probe position, issue a series of G1 commands until the nozzle is directly above the mark on the bed. For example, one might issue:
hu: A szonda pozíciójának rögzítése után adjon ki egy sor G1 parancsot, amíg a fúvóka közvetlenül a tárgyasztalon lévő jelölés fölé nem kerül. Például a következőket:
it: Dopo aver registrato la posizione della sonda, emettere una serie di comandi G1 fino a quando l'ugello si trova direttamente sopra il segno sul letto. Ad esempio, si potrebbe emettere:
zh_hant: 記錄下上述的座標后，在命令列使用一系列的 G1 命令，使噴嘴移動到熱床的記號的正上方。例如：

source: to move the nozzle to an X position of 57 and Y of 30. Once one finds the position directly above the mark, use the `GET_POSITION` command to report that position. This is the nozzle position.
hu: a fúvóka 57-es X-pozícióba és 30-as Y-pozícióba történő mozgatásához. Ha megtaláltuk a közvetlenül a jelölés feletti pozíciót, a `GET_POSITION` paranccsal jelenthetjük ezt a pozíciót. Ez a fúvóka pozíciója.
it: per spostare l'ugello in una posizione X di 57 e Y di 30. Una volta trovata la posizione direttamente sopra il segno, utilizzare il comando `GET_POSITION` per segnalare quella posizione. Questa è la posizione dell'ugello.
zh_hant: 將噴嘴移動到X 57， Y 30上。當噴嘴的位置剛好位於幾號上時，在命令列鍵入 `GET_POSITION` 獲得此時噴嘴所在的座標。

source: The x_offset is then the `nozzle_x_position - probe_x_position` and y_offset is similarly the `nozzle_y_position - probe_y_position`. Update the printer.cfg file with the given values, remove the tape/marks from the bed, and then issue a `RESTART` command so that the new values take effect.
hu: Az x_offset ekkor a `nozzle_x_position - probe_x_position` és az y_offset hasonlóan a `nozzle_y_position - probe_y_position`. Frissítse a printer.cfg fájlt a megadott értékekkel, távolítsa el a szalagot/jeleket a tárgyasztalról, majd adjon ki egy `RESTART` parancsot, hogy az új értékek hatályba lépjenek.
it: L'offset_x è quindi `posizione_x_ugello - posizione_x_sonda` e l'offset_y è analogamente a `posizione_y_ugello - posizione_y_sonda`. Aggiorna il file printer.cfg con i valori indicati, rimuovi il nastro con i riferimento dal piatto, quindi esegui un comando `RESTART` in modo che i nuovi valori diventino effettivi.
zh_hant: X偏移值為 `噴嘴X座標值 - 探針X座標值`， 類似地， Y偏移值為 `噴嘴Y座標值 - 探針Y座標值`。將上述數值更新到printer.cfg檔案內，掀掉熱床上的美紋紙/膠帶，並重啟Klipper以使設定生效。

source: Calibrating probe Z offset
hu: A szonda Z eltolás kalibrálása
it: Calibrazione Z offset sonda
zh_hant: 探針Z偏移值校準

source: Providing an accurate probe z_offset is critical to obtaining high quality prints. The z_offset is the distance between the nozzle and bed when the probe triggers. The Klipper `PROBE_CALIBRATE` tool can be used to obtain this value - it will run an automatic probe to measure the probe's Z trigger position and then start a manual probe to obtain the nozzle Z height. The probe z_offset will then be calculated from these measurements.
hu: A pontos z_offset beállítása kritikus fontos a jó minőségű nyomatok előállításához. A z_offset a fúvóka és a tárgyasztal közötti távolság, amikor a szonda működésbe lép. A Klipper `PROBE_CALIBRATE` eszköz használható ennek az értéknek a meghatározására - ez egy automatikus szondát futtat a szonda Z kioldási pozíciójának mérésére, majd egy kézi szondát indít a fúvóka Z magasságának meghatározására. A szonda z_offset értékét ezután ezekből a mérésekből számítja ki.
it: Inserire una z_offset accurata per la sonda è fondamentale per ottenere stampe di alta qualità. Lo z_offset è la distanza tra l'ugello e il letto quando la sonda si attiva. Lo strumento Klipper `PROBE_CALIBRATE` può essere utilizzato per ottenere questo valore: eseguirà una sonda automatica per misurare la posizione di trigger Z della sonda e quindi avvierà una sonda manuale per ottenere l'altezza Z dell'ugello. La sonda z_offset verrà quindi calcolata da queste misurazioni.
zh_hant: 準確的探針 z 偏移(z_offset)是高質量列印的基礎。z 偏移是探針觸發時探針和噴嘴之間的高度差。Klipper 中的 `PROBE_CALIBRATE`（探針校準）工具可用於測量這個值——首先，該工具會執行一次自動探測以獲取探針的 z 觸發位置，然後需要手動調整Z座標以獲取噴嘴碰觸到熱床時的 z 高度。然後將根據這些測量值計算探針的 z 偏移。

source: Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_CALIBRATE` command to start the tool.
hu: Kezd a nyomtató alaphelyzetbe állításával, majd mozgasd a fejet a tárgyasztal közepéhez közeli pozícióba. Navigáljon az OctoPrint terminál fülre, és futtassa a `PROBE_CALIBRATE` parancsot az eszköz indításához.
it: Inizia spostando testa in una posizione vicino al centro del piatto. Passare alla scheda del terminale OctoPrint ed eseguire il comando `PROBE_CALIBRATE` per avviare lo strumento.
zh_hant: 首先進行三軸的歸零，然後將噴嘴移動到熱床的中央位置。轉到OctoPrint的「命令列（Terminal）」子頁，輸入 `PROBE_CALIBRATE`以啟動z_offset校準工具。

source: This tool will perform an automatic probe, then lift the head, move the nozzle over the location of the probe point, and start the manual probe tool. If the nozzle does not move to a position above the automatic probe point, then `ABORT` the manual probe tool and perform the XY probe offset calibration described above.
hu: Ez az eszköz automatikus mérést hajt végre, majd felemeli a fejet, mozgatja a fúvókát a mérőpont helye fölé, és elindítja a kézi mérést. Ha a fúvóka nem mozdul el az automatikus mérőpont feletti pozícióba, akkor `ABORT` a kézi mérőeszközzel, hajtsd végre a fent leírt X-Y szondaeltolás kalibrálását.
it: Questo strumento eseguirà una misura automatica con la sonda, quindi solleverà la testina, sposterà l'ugello sulla posizione del punto sonda e avvierà lo strumento sonda manuale. Se l'ugello non si sposta in una posizione al di sopra del punto della sonda automatica, allora `ANNULLA` lo strumento sonda manuale ed eseguire la calibrazione dell'offset della sonda XY descritta sopra.
zh_hant: 工具首先會令探針進行一次自動探測，獲取觸發探針的z位置，之後，控制噴嘴上升，並將噴嘴的X/Y位置移動到探針對應位置上，並開始手動調平流程。如果噴嘴沒有移動到探針進行自動探測的位置，輸入`ABORT`以停止手動調平，並上文根據X、y偏移校準流程進行探針X、Y校準。

source: Once the manual probe tool starts, follow the steps described at ["the paper test"](Bed_Level.md#the-paper-test)) to determine the actual distance between the nozzle and bed at the given location. Once those steps are complete one can `ACCEPT` the position and save the results to the config file with:
hu: Miután a kézi mérő eszköz elindult, kövesse a ["a papírteszt"](Bed_Level.md#the-paper-test)] pontban leírt lépéseket a fúvóka és a tárgyasztal közötti tényleges távolság meghatározásához az adott helyen. Ha ezek a lépések befejeződtek, akkor `ACCEPT` a pozíció és elmentheti az eredményeket a config fájlba a következővel:
it: Una volta avviata manualmente la sonda, seguire i passaggi descritti in ["the paper test"](Bed_Level.md#the-paper-test) per determinare la distanza effettiva tra l'ugello e il letto in una determinata posizione. Una volta completati questi passaggi, è possibile `ACCEPT` la posizione e salvare i risultati nel file di configurazione con:
zh_hant: 進入手動調平的過程后，請按照[「紙片測試」](Bed_Level.md#the-paper-test)的流程，確定在探針探測位置上，噴嘴與熱床之間的距離。完成上述流程后，使用`ACCEPT`命令將測量到的z_offset應用到目前配置，如需要儲存配置到檔案，則鍵入：

source: Note that if a change is made to the printer's motion system, hotend position, or probe location then it will invalidate the results of PROBE_CALIBRATE.
hu: Vedd figyelembe, hogy ha a nyomtató mozgásrendszerét, a nyomtatófej pozícióját vagy a szonda helyét megváltoztatja, az érvényteleníti a PROBE_CALIBRATE eredményeit.
it: Si noti che se viene apportata una modifica al sistema di movimento della stampante, alla posizione dell'hotend o alla posizione della sonda, i risultati di PROBE_CALIBRATE verranno invalidati.
zh_hant: 注意！如果修改了印表機的運動系統、噴嘴位置或探針位置中的任意一項，PROBE_CALIBRATE的結果將會需要重新測量。

source: If the probe has an X or Y offset and the bed tilt is changed (eg, by adjusting bed screws, running DELTA_CALIBRATE, running Z_TILT_ADJUST, running QUAD_GANTRY_LEVEL, or similar) then it will invalidate the results of PROBE_CALIBRATE. After making any of the above adjustments it will be necessary to run PROBE_CALIBRATE again.
hu: Ha a szonda X vagy Y eltolással rendelkezik, és a tárgyasztal dőlése megváltozik (pl. szintezőcsavarok beállításával, DELTA_CALIBRATE futtatásával, Z_TILT_ADJUST futtatásával, QUAD_GANTRY_LEVEL futtatásával vagy hasonlóval), akkor ez érvényteleníti a PROBE_CALIBRATE eredményeit. A fenti beállítások bármelyikének módosítása után újra kell kezdeni a PROBE_CALIBRATE futtatását.
it: Se la sonda ha un offset X o Y e l'inclinazione del letto viene modificata (ad es. regolando le viti del letto, eseguendo DELTA_CALIBRATE, eseguendo Z_TILT_ADJUST, eseguendo QUAD_GANTRY_LEVEL o simili), i risultati di PROBE_CALIBRATE verranno invalidati. Dopo aver apportato una qualsiasi delle modifiche di cui sopra, sarà necessario eseguire nuovamente PROBE_CALIBRATE.
zh_hant: 如果探針的物理X、Y偏移量，或熱床的傾斜度發生變化（如 調整了熱床調平螺母，進行DELTA_CALIBRATE，進行Z_TILT_ADJUST，進行QUAD_GANTRY_LEVEL或其他行為），也應進行一次PROBE_CALiRATE。

source: If the results of PROBE_CALIBRATE are invalidated, then any previous [bed mesh](Bed_Mesh.md) results that were obtained using the probe are also invalidated - it will be necessary to rerun BED_MESH_CALIBRATE after recalibrating the probe.
hu: Ha a PROBE_CALIBRATE eredményei érvénytelenek, akkor a szondával kapott korábbi [tárgyasztal háló](Bed_Mesh.md) eredmények is érvénytelenek. A szonda újrakalibrálása után újra kell futtatni a BED_MESH_CALIBRATE programot.
it: Se i risultati di PROBE_CALIBRATE vengono invalidati, anche tutti i risultati precedenti di [bed mesh](Bed_Mesh.md) ottenuti utilizzando la sonda vengono invalidati: sarà necessario eseguire nuovamente BED_MESH_CALIBRATE dopo aver ricalibrato la sonda.
zh_hant: 上述使PROBE_CALIBRATE結果失效的行為，同樣會使使用探針測量的[床網](Bed_Mesh.md)結果失效。推薦在完成PROBE_CALIBRATE后再進行一次BED_MESH_CALIBRATE。

source: Repeatability check
hu: Ismételt mérési teszt
it: Verifica di ripetibilità
zh_hant: 重複性測試

source: After calibrating the probe X, Y, and Z offsets it is a good idea to verify that the probe provides repeatable results. Start by homing the printer and then move the head to a position near the center of the bed. Navigate to the OctoPrint terminal tab and run the `PROBE_ACCURACY` command.
hu: A szonda X, Y és Z eltolásának kalibrálása után érdemes ellenőrizni, hogy a szonda megismételhető mérési eredményeket szolgáltat-e. Kezd a nyomtató alaphelyzetbe állításával, majd mozgasd a fejet a tárgyasztal közepéhez közeli pozícióba. Navigáljon az OctoPrint terminál fülre, és futtassa a `PROBE_ACCURACY` parancsot.
it: Dopo aver calibrato gli offset X, Y e Z della sonda, è una buona idea verificare che la sonda fornisca risultati ripetibili. Inizia portando a home la stampante e quindi sposta la testa in una posizione vicino al centro del letto. Passare al terminale di OctoPrint ed eseguire il comando `PROBE_ACCURACY`.
zh_hant: 在完成探針的X、Y、Z偏移的校準后，推薦進行探針的重複性測試。首先對印表機進行三週歸零，然後將噴嘴移動到熱床的中央位置。進入OctoPrint的命令列界面，執行`PROBE_ACCURACY`命令。

source: This command will run the probe ten times and produce output similar to the following:
hu: Ez a parancs tízszer futtatja le a mérést, és az alábbiakhoz hasonló kimenetet ad:
it: Questo comando eseguirà il test con la sonda dieci volte e produrrà un output simile al seguente:
zh_hant: 該命令會就地進行10次探針測量，並輸出類似下方的結果：

source: Ideally the tool will report an identical maximum and minimum value. (That is, ideally the probe obtains an identical result on all ten probes.) However, it's normal for the minimum and maximum values to differ by one Z "step distance" or up to 5 microns (.005mm). A "step distance" is `rotation_distance/(full_steps_per_rotation*microsteps)`. The distance between the minimum and the maximum value is called the range. So, in the above example, since the printer uses a Z step distance of .0125, a range of 0.012500 would be considered normal.
hu: Ideális esetben az eszköz azonos maximális és minimális értéket mutat. (Vagyis ideális esetben a szonda mind a tíz mérésen azonos eredményt ad.) Azonban normális, hogy a minimális és maximális értékek egy Z "lépésköz" vagy akár 5 mikron (.005 mm) eltéréssel különböznek. A "lépésköz" `rotation_distance/(full_steps_per_rotation*microsteps)`. A minimális és a maximális érték közötti távolságot nevezzük tartománynak. Tehát a fenti példában, mivel a nyomtató 0,0125 Z-lépéstávolságot használ, a 0,01252500 tartományt tekintjük normálisnak.
it: Idealmente lo strumento riporterà un valore massimo e minimo identico. (Ovvero, idealmente la sonda ottiene un risultato identico su tutte e dieci le prove.) Tuttavia, è normale che i valori minimo e massimo differiscano di una "distanza di passo" Z o fino a 5 micron (0,005 mm). Una "distanza passo" è `rotation_distance/(full_steps_per_rotation*microsteps)`. La distanza tra il valore minimo e quello massimo è chiamata intervallo. Quindi, nell'esempio precedente, poiché la stampante utilizza una distanza di passo Z di 0,0125, un intervallo di 0,012500 sarebbe considerato normale.
zh_hant: 理想狀況下，使用探針測量的所有結果應該一致（也就是10次測量的結果為同一值）。然而，測量結果的最大值和最小值之間差距 「一個z電機步長」或5微米，也是正常的情況。一個「電機步長」是`旋轉一週的長度/(旋轉一週需要的步數*驅動微步設定)`。測量最大值和最小值的差值稱為偏差範圍。故在上述的例子中，因為印表機的z步長為0.0125，因此誤差範圍在0.012500mm可以認為是正常值。

source: If new probe speed, samples count, or other settings are needed, then update the printer.cfg file and issue a `RESTART` command. If so, it is a good idea to [calibrate the z_offset](#calibrating-probe-z-offset) again. If repeatable results can not be obtained then don't use the probe for bed leveling. Klipper has several manual probing tools that can be used instead - see the [Bed Level document](Bed_Level.md) for further details.
hu: Ha új mérési sebességre, mérésszámra vagy egyéb beállításokra van szükség, akkor frissítse a printer.cfg fájlt, és adjon ki egy `RESTART` parancsot. Ha igen, akkor érdemes újra [kalibrálni a z_offsetet](#calibrating-probe-z-offset). Ha nem kap ismétlődő eredményeket, akkor ne használja a szondát tárgyasztal szintezésére. A Klipper számos kézi mérőeszközzel rendelkezik, amelyek helyette használhatók - további részletekért lásd a [Tárgyasztal szintezése dokumentumot](Bed_Level.md).
it: Se sono necessarie una nuova velocità della sonda, diversa quantità di campioni o altre impostazioni, aggiornare il file printer.cfg ed eseguire un comando `RESTART`. In tal caso, è una buona idea anche [calibrare z_offset](#calibrating-probe-z-offset) di nuovo. Se non è possibile ottenere risultati ripetibili, non utilizzare la sonda per livellare il letto. Klipper ha diversi strumenti manuali che possono essere utilizzati in alternativa: vedere il [Bed Level document](Bed_Level.md) per ulteriori dettagli.
zh_hant: 要更改探針測試速度，重複採樣或其他設定，應在修改printer.cfg使用`RESTART`命令以應用修改值。推薦在使用新設定值后再進行一次[Z偏移校準](#calibrating-probe-z-offset)。如果重複性測試結論不能接受，建議不要使用自動熱床調平功能。Klipper提供了數種手動調平的工具，詳情請見[列印床調平](Bed_Level.md)。

source: Location Bias Check
hu: Elhelyezkedés ellenőrzése
it: Verifica scostamenti di posizione
zh_hant: 區域性偏差確定

source: Some probes can have a systemic bias that corrupts the results of the probe at certain toolhead locations. For example, if the probe mount tilts slightly when moving along the Y axis then it could result in the probe reporting biased results at different Y positions.
hu: Egyes szondák rendszerszintű torzítással rendelkezhetnek, amely bizonyos nyomtatófej helyeken elrontja a mérés eredményeit. Például, ha a szonda tartója az Y tengely mentén történő mozgás közben kissé megdől, akkor ez azt eredményezheti, hogy a szonda különböző Y pozíciókban torz eredményeket ad ki.
it: Alcune sonde possono avere una distorsione sistematica che altera i risultati della sonda in determinate posizioni della testa. Ad esempio, se il supporto della sonda si inclina leggermente durante lo spostamento lungo l'asse Y, la sonda potrebbe riportare risultati distorti in differenti posizioni Y.
zh_hant: 一些探針可能具有與位置相關的系統性偏差。比如，由於探針安裝失誤，探針沿Y軸移動會產生傾斜，那麼探針在沿Y軸進行測量得出的結果會存在偏差。

source: This is a common issue with probes on delta printers, however it can occur on all printers.
hu: Ez egy gyakori probléma a delta nyomtatók szondáinál, de más nyomtatónál is előfordulhat.
it: Questo è un problema comune con le sonde sulle stampanti delta, tuttavia può verificarsi su tutte le stampanti.
zh_hant: 上述狀況往往出現在三角洲印表機上，然而，所有印表機均有可能發生上述狀況。

source: One can check for a location bias by using the `PROBE_CALIBRATE` command to measuring the probe z_offset at various X and Y locations. Ideally, the probe z_offset would be a constant value at every printer location.
hu: A helyeltolódás ellenőrzése a `PROBE_CALIBRATE` parancs segítségével történhet a szonda z_offsetjének mérésével különböző X és Y helyeken. Ideális esetben a szonda z_offset értéke minden pozícióban állandó.
it: Si può verificare una distorsione di posizione utilizzando il comando `PROBE_CALIBRATE` per misurare l'offset z della sonda in varie posizioni X e Y. Idealmente, il probe z_offset sarebbe un valore costante in ogni posizione della stampante.
zh_hant: 我們可以在不同的XY位置上使用`PROBE_CALIBRATE`命令測量z_offset來確定位置偏差。理想情況下，z_offset在任意位置均為同一讀值。

source: For delta printers, try measuring the z_offset at a position near the A tower, at a position near the B tower, and at a position near the C tower. For cartesian, corexy, and similar printers, try measuring the z_offset at positions near the four corners of the bed.
hu: A deltanyomtatók esetében próbáld meg a z_offset mérését az A, a B, és a C torony közelében is. Cartesian, corexy és hasonló nyomtatók esetében próbáld meg a z_offsetet a tárgyasztal négy sarkának közelében lévő pozíciókban mérni.
it: Per le stampanti delta, prova a misurare z_offset in una posizione vicino alla torre A, in una posizione vicino alla torre B e in una posizione vicino alla torre C. Per stampanti cartesiane, corexy e simili, prova a misurare z_offset in posizioni vicino ai quattro angoli del letto.
zh_hant: 對於三角洲印表機，請嘗試依次在靠近A柱、B柱和C柱的位置測量z_offset。對於龍門、corexy或類似結構印表機，嘗試在熱床的四個角進行z_offset的測量。

source: Before starting this test, first calibrate the probe X, Y, and Z offsets as described at the beginning of this document. Then home the printer and navigate to the first XY position. Follow the steps at [calibrating probe Z offset](#calibrating-probe-z-offset) to run the `PROBE_CALIBRATE` command, `TESTZ` commands, and `ACCEPT` command, but do not run `SAVE_CONFIG`. Note the reported z_offset found. Then navigate to the other XY positions, repeat these `PROBE_CALIBRATE` steps, and note the reported z_offset.
hu: A vizsgálat megkezdése előtt először kalibrálja a szonda X-, Y- és Z-eltolódását a dokumentum elején leírtak szerint. Ezután állítsd be a nyomtatót, és navigáljon az első X-Y pozícióba. A `PROBE_CALIBRATE` parancs futtatásához kövesse a [calibrating probe Z offset](#calibrating-probe-z-offset) pontban leírt lépéseket, `TESTZ` parancsot, és az `ACCEPT` parancsot, de ne futtassa a `SAVE_CONFIG` parancsot. Figyeljük meg a talált z_offset értéket. Ezután navigáljon a többi X-Y pozícióhoz, ismételje meg ezeket a `PROBE_CALIBRATE` lépéseket, és jegyezze fel a mért z_offsetet.
it: Prima di iniziare questo test, calibrare prima gli offset della sonda X, Y e Z come descritto all'inizio di questo documento. Quindi porta a home la stampante e vai alla prima posizione XY. Seguire i passaggi in [calibrazione dell'offset Z della sonda](#calibrating-probe-z-offset) per eseguire il comando `PROBE_CALIBRATE`, i comandi `TESTZ` e il comando `ACCETTA`, ma non eseguire `SAVE_CONFIG`. Nota lo z_offset segnalato trovato. Quindi passare alle altre posizioni XY, ripetere questi passaggi `PROBE_CALIBRATE` e annotare lo z_offset riportato.
zh_hant: 在進行上述測試前，應先按照本文件的開頭部分對X、Y、Z的偏移值進行校準，然後對印表機進行歸零，並將探針移動到首個目標XY位置。按照[探針Z偏移值校準](#探針Z偏移值校準)的步驟，執行`PROBE_CALIBRATE`，重複多次`TESTZ`命令，並在噴嘴觸床時使用 `ACCEPT`命令，但是**切勿使用 `SAVE_CONFIG`**。手動記下此時的z_offset 。之後將探針移動到其他XY位置，重複上述的`PROBE_CALIBRATE`步驟，並分別記下z_offset。

source: If the difference between the minimum reported z_offset and the maximum reported z_offset is greater than 25 microns (.025mm) then the probe is not suitable for typical bed leveling procedures. See the [Bed Level document](Bed_Level.md) for manual probe alternatives.
hu: Ha a minimálisan és a maximálisan jelentett z_offset közötti különbség nagyobb, mint 25 mikron (.025 mm), akkor a szonda nem alkalmas a tipikus tárgyasztal szintezési műveletekre. A kézi mérési alternatívákat lásd az [Tárgyasztal szintezése dokumentumban](Bed_Level.md).
it: Se la differenza tra l'offset z minimo riportato e l'offset z massimo riportato è maggiore di 25 micron (0,025 mm), la sonda non è adatta per le tipiche procedure di livellamento del letto. Consultare il [Bed Level document](Bed_Level.md) per sonde alternative manuali.
zh_hant: 如果上述方法中測出的最大z_offset 和最小z_offset 之間的差值大於25微米（.025mm），則該探針不適用于常規的熱床調平。此時應參照 [熱床調平](Bed_Level.md) 文件的手動調平部分進行調平。

source: Temperature Bias
hu: Hőmérséklet torzítás
it: Scostamenti per temperatura
zh_hant: 溫度偏差
