Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Probe_Calibrate.po
Languages: hu, it, zh_hant

source: Many probes have a systemic bias when probing at different temperatures. For example, the probe may consistently trigger at a lower height when the probe is at a higher temperature.
hu: Sok szondának van egy rendszerszintű torzítása, amikor különböző hőmérsékleten mérnek. Például a szonda következetesen alacsonyabb magasságban mérhet a magasabb hőmérséklet következtében.
it: Molte sonde hanno una distorsione sistemica quando misurano a temperature diverse. Ad esempio, la sonda può attivarsi costantemente a un'altezza inferiore quando la sonda si trova a una temperatura più elevata.
zh_hant: 對於多種形式的探針，在不同的溫度下工作均具有一定的系統性偏差。比如，在高溫下，探針可能總是在更低的高度下觸發。

source: It is recommended to run the bed leveling tools at a consistent temperature to account for this bias. For example, either always run the tools when the printer is at room temperature, or always run the tools after the printer has obtained a consistent print temperature. In either case, it is a good idea to wait several minutes after the desired temperature is reached, so that the printer apparatus is consistently at the desired temperature.
hu: Javasoljuk, hogy a tárgyasztal szintező szerszámokat állandó hőmérsékleten működtesse, hogy figyelembe vegyék ezt a torzítást. Vagy szobahőmérsékleten szintezzen, vagy szintezzen miután a nyomtató elérte a nyomtatási hőmérsékletet. Mindkét esetben érdemes néhány percet várni a kívánt hőmérséklet elérése után, hogy a berendezés folyamatosan a kívánt hőmérsékleten legyen.
it: Si consiglia di eseguire le procedure di livellamento del piatto a una temperatura costante per tenere conto di questa distorsione. Ad esempio, usare sempre la sonda quando la stampante è a temperatura ambiente oppure eseguire sempre la procedura dopo che la stampante ha raggiunto una temperatura costante. In entrambi i casi, è una buona idea attendere diversi minuti dopo che è stata raggiunta la temperatura desiderata, in modo che tutto apparato stampante sia alla temperatura desiderata costantemente.
zh_hant: 針對這種偏差，建議在恒定的溫度下進行熱床調平。即，要麼總是在室溫下進行床網測量，要麼總要在工作溫度下進行。無論採取哪種方案，都推薦在達到目標溫度數分鐘后再進行測量，以便印表機始終處於目標溫度。

source: To check for a temperature bias, start with the printer at room temperature and then home the printer, move the head to a position near the center of the bed, and run the `PROBE_ACCURACY` command. Note the results. Then, without homing or disabling the stepper motors, heat the printer nozzle and bed to printing temperature, and run the `PROBE_ACCURACY` command again. Ideally, the command will report identical results. As above, if the probe does have a temperature bias then be careful to always use the probe at a consistent temperature.
hu: A hőmérsékleti torzítás ellenőrzéséhez kezd szobahőmérsékleten, majd állítsd be a nyomtatót. Mozgasd a fejet a tárgyasztal közepéhez közeli pozícióba, és futtassa a `PROBE_ACCURACY` parancsot. Figyelje meg az eredményeket. Ezután a léptetőmotorok kezdőpont felvétele vagy kikapcsolása nélkül melegítse fel a nyomtató fúvókáját és tárgyasztalát nyomtatási hőmérsékletre, és futtassa le ismét a `PROBE_ACCURACY` parancsot. Ideális esetben a parancs azonos eredményeket fog mutatni. A fentiekhez hasonlóan, ha a szondának valóban van hőmérsékleti torzítása, akkor ügyelj arra, hogy mindig egyenletes hőmérsékleten használja méréskor.
it: Per verificare la presenza di un errore per temperatura, iniziare con la stampante a temperatura ambiente e poi portare a home la stampante, spostare la testina in una posizione vicino al centro del letto ed eseguire il comando `PROBE_ACCURACY`. Nota i risultati. Quindi, senza eseguire l'homing o disabilitare i motori passo-passo, riscaldare l'ugello della stampante e il piatto alla temperatura di stampa ed eseguire nuovamente il comando `PROBE_ACCURACY`. Idealmente, il comando riporterà risultati identici. Come sopra, se la sonda ha un errore causato dalla temperatura, fare attenzione a usare sempre la sonda a una temperatura costante stabile.
zh_hant: 要測量溫度偏差，首先確保印表機處於室溫，對三軸進行歸零，然後將列印頭移動到熱床中央，執行`PROBE_ACCURACY`命令。記下此時的讀數。之後，在不歸零或關閉電機的情況下，加熱噴嘴和熱床到工作溫度，並再次執行`PROBE_ACCURACY`。理想情況下，兩次探針測量會得出相同的結果。但若溫度偏差存在，建議每次達到工作溫度后再進行測量。

source: Probe calibration
hu: Szonda kalibrálása
it: Calibrazione sonda
zh_hant: 探針校準

source: This document describes the method for calibrating the X, Y, and Z offsets of an "automatic z probe" in Klipper. This is useful for users that have a `[probe]` or `[bltouch]` section in their config file.
hu: Ez a dokumentum a Klipperben található "automatikus z szonda" X, Y és Z eltolásának kalibrálási módszerét írja le. Ez azon felhasználók számára hasznos, akiknek van egy `[probe]` vagy `[bltouch]` szakasz a konfigurációs fájljukban.
it: Questo documento descrive il metodo per calibrare gli offset X, Y e Z di una "sonda z automatica" in Klipper. Questo è utile per gli utenti che hanno una sezione `[probe]` o `[bltouch]` nel loro file di configurazione.
zh_hant: 本文件介紹了在 Klipper 中校準"自動 Z 探針" X、Y 和 Z 偏移的流程。這對於配置檔案中具有 `[probe]` 或 `[bltouch]` 部分的印表機非常有用。

source: If the results of the test show a range value that is greater than 25 microns (.025mm) then the probe does not have sufficient accuracy for typical bed leveling procedures. It may be possible to tune the probe speed and/or probe start height to improve the repeatability of the probe. The `PROBE_ACCURACY` command allows one to run tests with different parameters to see their impact - see the [G-Codes document](G-Codes.md#probe_accuracy) for further details. If the probe generally obtains repeatable results but has an occasional outlier, then it may be possible to account for that by using multiple samples on each probe - read the description of the probe `samples` config parameters in the [config reference](Config_Reference.md#probe) for more details.
hu: Ha a teszt eredménye 25 mikronnál (0,025 mm-nél) nagyobb tartományértéket mutat, akkor a szonda nem elég pontos a tipikus szintezési eljárásokhoz. Lehetséges a szonda sebességének és/vagy indulási magasságának hangolása a mérés ismételhetőségének javítása érdekében. A `PROBE_ACCURACY` parancs lehetővé teszi a tesztek futtatását különböző paraméterekkel, hogy lássa a hatásukat. További részletekért lásd a [G-kódok dokumentumot](G-Codes.md#probe_accuracy). Ha a szonda általában egyforma eredményeket ad, de időnként előfordulnak kiugró értékek, akkor ezt úgy lehet kiküszöbölni, hogy minden egyes mérőponton több mérést hajtunk végre. Olvassa el a szonda `samples` konfigurációs paramétereinek leírását a [config hivatkozásban ](Config_Reference.md#probe) további részletekért.
it: Se i risultati del test mostrano un valore di intervallo maggiore di 25 micron (0,025 mm), la sonda non ha una precisione sufficiente per le procedure tipiche di livellamento del piatto. Potrebbe essere possibile regolare la velocità della sonda e/o l'altezza di inizio della sonda per migliorare la ripetibilità della sonda. Il comando `PROBE_ACCURACY` consente di eseguire test con parametri diversi per vederne l'impatto - vedere il [documento G-Codes](G-Codes.md#probe_accuracy) per ulteriori dettagli. Se la sonda generalmente ottiene risultati ripetibili ma presenta un valore anomalo occasionale, potrebbe essere possibile tenerne conto utilizzando più campioni su ciascuna sonda - leggere la descrizione dei parametri di configurazione dei `campioni` della sonda in [riferimento di configurazione](Config_Reference. md#probe) per maggiori dettagli.
zh_hant: 如果測試結果顯示範圍(range)值大於25微米（0.025毫米），那麼探針不滿足典型的床面調平流程的精確度要求。可以嘗試調整探測速度和/或探測起點高度以提高探頭的重複性。`PROBE_ACCURACY`命令允許使用不同的參數進行測試，以瞭解它們的影響 - 請參閱[G-Code文件](G-Code.md#probe_accuracy)瞭解更多細節。如果探針在大多數情況下能獲得可重複的結果，但偶爾會出現異常值，那麼可以增加在每個探測點的探測次數來解決這個問題--詳見[配置參考](Config_Reference.md#probe)中關於探針`samples`配置參數的描述。
