Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/RPi_microcontroller.po
Languages: it, zh_hant

source: This document describes the process of running Klipper on a RPi and use the same RPi as secondary mcu.
it: Questo documento descrive il processo di esecuzione di Klipper su un RPi e usa lo stesso RPi come mcu secondario.
zh_hant: 這個文件描述了在RPi上執行Klipper的過程，並使用相同的RPi作為輔助MCU。

source: Why use RPi as a secondary MCU?
it: Perché usare RPi come MCU secondario?
zh_hant: 為什麼使用RPi作為輔助MCU？

source: Often the MCUs dedicated to controlling 3D printers have a limited and pre-configured number of exposed pins to manage the main printing functions (thermal resistors, extruders, steppers ...). Using the RPi where Klipper is installed as a secondary MCU gives the possibility to directly use the GPIOs and the buses (i2c, spi) of the RPi inside klipper without using Octoprint plugins (if used) or external programs giving the ability to control everything within the print GCODE.
it: Spesso gli MCU dedicati al controllo delle stampanti 3D hanno un numero limitato e preconfigurato di pin esposti per gestire le principali funzioni di stampa (resistenze termiche, estrusori, stepper...). L'utilizzo dell'RPi dove Klipper è installato come MCU secondario dà la possibilità di utilizzare direttamente i GPIO e i bus (i2c, spi) dell'RPi all'interno di klipper senza utilizzare plugin Octoprint (se utilizzati) o programmi esterni dando la possibilità di controllare tutto all'interno del GCODE di stampa.
zh_hant: 通常情況下，專門用於控制3D印表機的MCU有有限的、預先配置好的引腳來管理主要的列印功能（熱敏電阻、擠出機、步進器...）。使用安裝了Klipper的RPi作為輔助MCU，可以直接使用klipper內的GPIO和RPi的匯流排（i2c，spi），而不需要使用Octoprint外掛（如果使用的話）或外部程式，從而能夠控制列印GCODE內的一切。

source: **Warning**: If your platform is a *Beaglebone* and you have correctly followed the installation steps, the linux mcu is already installed and configured for your system.
it: **Attenzione**: Se la tua piattaforma è un *Beaglebone* e hai seguito correttamente i passi di installazione, la mcu linux è già installata e configurata per il tuo sistema.
zh_hant: **警告**。如果你的平臺是*Beaglebone*，並且你已經正確地按照安裝步驟進行了安裝，那麼linux mcu已經為你的系統安裝和配置了。

source: Install the rc script
it: Installa lo script rc
zh_hant: 安裝 rc 指令碼

source: If you want to use the host as a secondary MCU the klipper_mcu process must run before the klippy process.
it: Se si desidera utilizzare l'host come MCU secondario, il processo di klipper_mcu deve essere eseguito prima del processo klippy.
zh_hant: 如果你想把主機作為一個輔助MCU，klipper_mcu程序必須在klippy程序之前執行。

source: After installing Klipper, install the script. run:
it: Dopo aver installato Klipper, installare lo script. eseguire:
zh_hant: 安裝 Klipper 后，執行以下命令來安裝指令碼：

source: Building the micro-controller code
it: Creazione del codice del microcontrollore
zh_hant: 構建微控制器程式碼

source: To compile the Klipper micro-controller code, start by configuring it for the "Linux process":
it: Per compilare il codice del microcontrollore Klipper, iniziate configurandolo per il "processo Linux":
zh_hant: 要編譯的 Klipper 微控制器程式碼，需要先將編譯配置設定為「Linux Process」：

source: In the menu, set "Microcontroller Architecture" to "Linux process," then save and exit.
it: Nel menu, impostate "Microcontroller Architecture" su "Linux process", poi salvate e uscite.
zh_hant: 在菜單中，設定「Microcontroller Archetecture」（微控制器架構）為「Linux Process」（Linux 程序），然後儲存(save)並退出(exit)。

source: To build and install the new micro-controller code, run:
it: Per compilare e installare il nuovo codice del microcontrollore, eseguire:
zh_hant: 要構建和安裝新的微控制器程式碼，請執行：

source: If klippy.log reports a "Permission denied" error when attempting to connect to `/tmp/klipper_host_mcu` then you need to add your user to the tty group. The following command will add the "pi" user to the tty group:
it: Se klippy.log segnala un errore "Autorizzazione negata" quando si tenta di connettersi a `/tmp/klipper_host_mcu`, è necessario aggiungere l'utente al gruppo tty. Il seguente comando aggiungerà l'utente "pi" al gruppo tty:
zh_hant: 如果klippy.log在試圖連線到`/tmp/klipper_host_mcu`時輸出 "Permission denied" 錯誤，那麼你需要將你的使用者新增到tty使用者組。下面的命令將把 "pi "使用者新增到tty使用者組中：

source: Remaining configuration
it: Configurazione rimanente
zh_hant: 剩餘的配置

source: Complete the installation by configuring Klipper secondary MCU following the instructions in [RaspberryPi sample config](../config/sample-raspberry-pi.cfg) and [Multi MCU sample config](../config/sample-multi-mcu.cfg).
it: Completare l'installazione configurando l'MCU secondario di Klipper seguendo le istruzioni in [RaspberryPi sample config](../config/sample-raspberry-pi.cfg) e [Multi MCU sample config](../config/sample-multi-mcu.cfg).
zh_hant: 按照[RaspberryPi 參考配置](../config/sample-raspberry-pi.cfg)和[多微控制器參考配置](../config/sample-multi-mcu.cfg)中的說明配置Klipper 二級微控制器來完成安裝。

source: Optional: Identify the correct gpiochip
it: Opzionale: Identificare il gpiochip corretto
zh_hant: 可選步驟：識別正確的 gpiochip

source: To install the *Linux GPIO character device - binary* on a debian based distro like octopi run:
it: Per installare il *Linux GPIO character device - binary* su una distro basata su debian come octopi eseguire:
zh_hant: 要在基於 Debian 的發行版（如 OctoPi）上安裝 *Linux GPIO character device - binary*，請執行：

source: To check available gpiochip run:
it: Per controllare i gpiochip disponibili eseguire:
zh_hant: 要檢查可用的gpiochip，請執行：

source: To check the pin number and the pin availability tun:
it: Per verificare il numero di pin e la disponibilità dei pin:
zh_hant: 要檢查針腳編號和針腳可用性，請執行：

source: ***Warning:*** only gpio marked as `unused` can be used. It is not possible for a *line* to be used by multiple processes simultaneously.
it: ***Attenzione:*** solo i gpio contrassegnati come `inutilizzati` possono essere utilizzati. Non è possibile che una *linea* sia usata da più processi contemporaneamente.
zh_hant: ***警告：***只有標記為`unused`的 gpio 才可以被使用。一條*線路*不可能被多個程序同時使用。

source: For example on a RPi 3B+ where klipper use the GPIO20 for a switch:
it: Per esempio su un RPi 3B+ dove klipper usa il GPIO20 per un interruttore:
zh_hant: 例如，在樹莓派 3B+上 將GPIO20作為 Klipper 的一個開關：

source: Optional: Hardware PWM
it: Opzionale: Hardware PWM
zh_hant: 可選功能：硬體 PWM

source: Raspberry Pi's have two PWM channels (PWM0 and PWM1) which are exposed on the header or if not, can be routed to existing gpio pins. The Linux mcu daemon uses the pwmchip sysfs interface to control hardware pwm devices on Linux hosts. The pwm sysfs interface is not exposed by default on a Raspberry and can be activated by adding a line to `/boot/config.txt`:
it: I Raspberry Pi hanno due canali PWM (PWM0 e PWM1) che sono esposti sull'intestazione o, in caso contrario, possono essere instradati ai pin gpio esistenti. Il demone mcu Linux utilizza l'interfaccia sysfs pwmchip per controllare i dispositivi hardware pwm sugli host Linux. L'interfaccia sysfs pwm non è esposta per impostazione predefinita su un Raspberry e può essere attivata aggiungendo una riga a `/boot/config.txt`:
zh_hant: 樹莓派有兩個PWM通道（PWM0和PWM1），它們通常暴露在header中上，如果沒有，可以路由到現有的 gpio 引腳。Linux mcu 守護程式使用 pwmchip sysfs 介面來控制 Linux 主機上的硬體 PWM 裝置。pwm sysfs 介面在樹莓上預設是隱藏的，可以通過在`/boot/config.txt`中加入一行設定來啟用：

source: # Enable pwmchip sysfs interface dtoverlay=pwm,pin=12,func=4
it: # Abilita l'interfaccia sysfs di pwmchip dtoverlay=pwm,pin=12,func=4
zh_hant: # 啟用 pwmchip sysfs 介面 dtoverlay=pwm,pin=12,func=4

source: This example enables only PWM0 and routes it to gpio12. If both PWM channels need to be enabled you can use `pwm-2chan`.
it: Questo esempio abilita solo PWM0 e lo indirizza a gpio12. Se entrambi i canali PWM devono essere abilitati potete usare `pwm-2chan`.
zh_hant: 此示例僅啟用 PWM0 並將其路由到 gpio12。如果需要同時啟用兩個 PWM 通道，則可以使用 `pwm-2chan`。

source: The overlay does not expose the pwm line on sysfs on boot and needs to be exported by echo'ing the number of the pwm channel to `/sys/class/pwm/pwmchip0/export`:
it: L'overlay non espone la riga pwm sui sysfs all'avvio e deve essere esportata facendo eco al numero del canale pwm in `/sys/class/pwm/pwmchip0/export`:
zh_hant: overlay 在啟動時不會在 sysfs 上暴露出 PWM 線路，需要通過echo將 PWM 通道的編號導出到 `/sys/class/pwm/pwmchip0/export`：

source: This will create device `/sys/class/pwm/pwmchip0/pwm0` in the filesystem. The easiest way to do this is by adding this to `/etc/rc.local` before the `exit 0` line.
it: Questo creerà il dispositivo `/sys/class/pwm/pwmchip0/pwm0` nel filesystem. Il modo più semplice per farlo è aggiungerlo a `/etc/rc.local` prima della riga `exit 0`.
zh_hant: 這將在檔案系統中建立裝置`/sys/class/pwm/kwmchip0/pwm0`。最簡單的方法是在`/etc/rc.local`的`exit 0`行之前新增這行。

source: With the sysfs in place, you can now use either the pwm channel(s) by adding the following piece of configuration to your `printer.cfg`:
it: Con il sysfs a posto, potete ora utilizzare il canale o i canali pwm aggiungendo il seguente pezzo di configurazione al vostro `printer.cfg`:
zh_hant: 有了 sysfs，現在可以通過將以下配置新增到 `printer.cfg` 來使用 PWM 通道：

source: This will add hardware pwm control to gpio12 on the Pi (because the overlay was configured to route pwm0 to pin=12).
it: Questo aggiungerà il controllo pwm hardware a gpio12 sul Pi (perché l'overlay è stato configurato per instradare pwm0 a pin = 12).
zh_hant: 這將為樹莓派上的 gpio12 引腳新增硬體 PWM 控制（因為overlay被配置為將 pwm0 路由到 pin=12）。

source: RPi microcontroller
it: Microcontrollore RPi
zh_hant: RPi 微控制器

source: PWM0 can be routed to gpio12 and gpio18, PWM1 can be routed to gpio13 and gpio19:
it: PWM0 può essere indirizzato su gpio12 e gpio18, PWM1 può essere indirizzato su gpio13 e gpio19:
zh_hant: PWM0 可以被路由到 gpio12 和 gpio18，PWM1 可以被路由到 gpio13 和 gpio19：

source: gpio PIN
zh_hant: GPIO 引腳

source: Func
zh_hant: 功能

source: Optional: Enabling SPI
it: Facoltativo: abilitazione di SPI
zh_hant: 可選：啟用 SPI

source: Make sure the Linux SPI driver is enabled by running `sudo raspi-config` and enabling SPI under the "Interfacing options" menu.
it: Assicurati che il driver SPI di Linux sia abilitato eseguendo `sudo raspi-config` e abilitando SPI nel menu "Opzioni di interfaccia".
zh_hant: 通過執行`sudo raspi-config` 后的 "Interfacing options"菜單中啟用 SPI 以確保Linux SPI 驅動已啟用。

source: The chosen pin can thus be used within the configuration as `gpiochip<n>/gpio<o>` where **n** is the chip number as seen by the `gpiodetect` command and **o** is the line number seen by the`gpioinfo` command.
it: Il pin scelto può quindi essere utilizzato all'interno della configurazione come `gpiochip<n>/gpio<o>` dove **n** è il numero del chip visto dal comando `gpiodetect` e **o** è il numero di riga visto dal comando `gpioinfo`.
zh_hant: 因此，所選引腳可以在配置中可以通過 `gpiochip<n>/gpio<o>`引用，其中 **n** 是由 `gpiodetect` 命令看到的晶片編號**o** 是 ` gpioinfo` 命令看到的行號。

source: On Raspberry Pi and on many clones the pins exposed on the GPIO belong to the first gpiochip. They can therefore be used on klipper simply by referring them with the name `gpio0..n`. However, there are cases in which the exposed pins belong to gpiochips other than the first. For example in the case of some OrangePi models or if a Port Expander is used. In these cases it is useful to use the commands to access the *Linux GPIO character device* to verify the configuration.
it: Su Raspberry Pi e su molti cloni i pin esposti sul GPIO appartengono al primo gpiochip. Possono quindi essere utilizzati su klipper semplicemente riferendoli con il nome `gpio0..n`. Tuttavia, ci sono casi in cui i pin esposti appartengono a gpiochip diversi dal primo. Ad esempio nel caso di alcuni modelli OrangePi o se viene utilizzato un Port Expander. In questi casi è utile utilizzare i comandi per accedere al *dispositivo a caratteri GPIO Linux* per verificarne la configurazione.
zh_hant: 在 Raspberry Pi 和許多類似主板上，GPIO 上露出的引腳屬於第一個 gpiochip。因此，它們可以在 klipper 上使用，只需使用名稱 `gpio0..n` 引用它們。但是，有些情況下，露出的引腳屬於第一個以外的 gpiochips。例如，在某些 OrangePi 型號的情況下或使用端口擴展器的情況下。在這些情況下，使用命令訪問 *Linux GPIO 字符設備* 以驗證配置很有用。

source: Optional: Enabling I2C
it: Opzionale: abilitazione di I2C
zh_hant: 可選：啟用 I2C

source: Make sure the Linux I2C driver is enabled by running `sudo raspi-config` and enabling I2C under the "Interfacing options" menu. If planning to use I2C for the MPU accelerometer, it is also required to set the baud rate to 400000 by: adding/uncommenting `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` in `/boot/config.txt` (or `/boot/firmware/config.txt` in some distros).
it: Assicurati che l'interfaccia Linux I2C sia abilitato eseguendo `sudo raspi-config` e abilitando I2C nel menu "Opzioni di interfaccia". Se si intende utilizzare I2C per l'accelerometro MPU, è anche necessario impostare il baud rate su 400000: aggiungendo/deselezionando `dtparam=i2c_arm=on,i2c_arm_baudrate=400000` in `/boot/config.txt` (o `/ boot/firmware/config.txt` in alcune distribuzioni).
zh_hant: 通過運行 `sudo raspi-config` 並在“接口選項”菜單下啟用 I2C，確保啟用了 Linux I2C 驅動程序。如果計劃將 I2C 用於 MPU 加速度計，還需要通過以下方式將波特率設置為 400000：在 `/boot/config.txt`（或 `/ boot/firmware/config.txt` 在某些發行版中）。
