Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Status_Reference.po
Languages: it, zh_hant

source: This document is a reference of printer status information available in Klipper [macros](Command_Templates.md), [display fields](Config_Reference.md#display), and via the [API Server](API_Server.md).
it: Questo documento è un riferimento alle informazioni sullo stato della stampante disponibili in Klipper [macro](Command_Templates.md), [display fields](Config_Reference.md#display) e tramite [API Server](API_Server.md).
zh_hant: 本文件是可用於 Klipper [宏](Command_Templates.md)、[顯示欄位](Config_Reference.md#display)以及[API伺服器](API_Server.md) 的印表機狀態資訊的參考。

source: The fields in this document are subject to change - if using an attribute be sure to review the [Config Changes document](Config_Changes.md) when upgrading the Klipper software.
it: I campi in questo documento sono soggetti a modifiche: se si utilizza un attributo, assicurarsi di rivedere il [documento Modifiche alla configurazione](Config_Changes.md) durante l'aggiornamento del software Klipper.
zh_hant: 本文件中的欄位可能會發生變化 - 如果使用了任何欄位，在更新 Klipper 時，請務必檢視[配置變化文件](Config_Changes.md)。

source: The following information is available in the [bed_mesh](Config_Reference.md#bed_mesh) object:
it: Le seguenti informazioni sono disponibili in [bed_mesh](Config_Reference.md#bed_mesh):
zh_hant: [bed_mesh](Config_Reference.md#bed_mesh) 對像中提供了以下資訊：

source: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: Information on the currently active bed_mesh.
it: `profile_name`, `mesh_min`, `mesh_max`, `probed_matrix`, `mesh_matrix`: informazioni sulla bed_mesh attualmente attiva.
zh_hant: `profile_name`、`mesh_min`、`mesh_max`、`probed_matrix`、`mesh_matrix`：關於目前活躍的 bed_mesh 配置資訊。

source: The following information is available in the `configfile` object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto `configfile` (questo oggetto è sempre disponibile):
zh_hant: `configfile` 對像中提供了以下資訊（該對像始終可用）：

source: `settings.<section>.<option>`: Returns the given config file setting (or default value) during the last software start or restart. (Any settings changed at run-time will not be reflected here.)
it: `settings.<section>.<option>`: Restituisce l'impostazione del file di configurazione data (o il valore predefinito) durante l'ultimo avvio o riavvio del software. (Qualsiasi impostazione modificata in fase di esecuzione non si rifletterà qui.)
zh_hant: `settings.<分段>.<選項>`：返回最後一次軟體啟動或重啟時給定的配置檔案設定（或預設值）。(不會反映執行時的修改。）

source: `config.<section>.<option>`: Returns the given raw config file setting as read by Klipper during the last software start or restart. (Any settings changed at run-time will not be reflected here.) All values are returned as strings.
it: `config.<section>.<option>`: Restituisce l'impostazione del file di configurazione non elaborato come letta da Klipper durante l'ultimo avvio o riavvio del software. (Qualsiasi impostazione modificata in fase di esecuzione non si rifletterà qui.) Tutti i valori vengono restituiti come stringhe.
zh_hant: `config.<分段>.<選項>`：返回Klipper在上次軟體啟動或重啟時讀取的原始配置檔案設定。(不會反映執行時的修改。)所有值都以字串形式返回。

source: The following information is available in the `display_status` object (this object is automatically available if a [display](Config_Reference.md#display) config section is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `display_status` (questo oggetto è automaticamente disponibile se è definita una sezione di configurazione [display](Config_Reference.md#display)):
zh_hant: `display_status` 對像中提供以下資訊（如果定義了 [display](Config_Reference.md#display) 配置分段，則該對像自動可用）：

source: `progress`: The progress value of the last `M73` G-Code command (or `virtual_sdcard.progress` if no recent `M73` received).
it: `progress`: il valore di avanzamento dell'ultimo comando G-Code `M73` (o `virtual_sdcard.progress` se non è stato ricevuto alcun `M73` recente).
zh_hant: `progress`：最後一個 `M73` G程式碼命令報告的進度（如果沒有收到`M73`，則會用`virtual_sdcard.progress`替代）。

source: `message`: The message contained in the last `M117` G-Code command.
it: `message`: il messaggio contenuto nell'ultimo comando G-Code `M117`.
zh_hant: `message`：最後一條 `M117` G程式碼命令中包含的訊息。

source: The following information is available in the [endstop_phase](Config_Reference.md#endstop_phase) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [endstop_phase](Config_Reference.md#endstop_phase):
zh_hant: [endstop_phase](Config_Reference.md#endstop_phase) 對像中提供了以下資訊：

source: `last_home.<stepper name>.phase`: The phase of the stepper motor at the end of the last home attempt.
it: `last_home.<nome stepper>.phase`: La fase del motore passo-passo al termine dell'ultimo tentativo di home.
zh_hant: `last_home.<步進電機名>.phase`：最後一次歸為嘗試結束時步進電機的相位。

source: `last_home.<stepper name>.phases`: The total number of phases available on the stepper motor.
it: `last_home.<stepper name>.phases`: il numero totale di fasi disponibili sul motore passo-passo.
zh_hant: `last_home.<步進電機名稱>.phase`：步進電機上可用的總相數。

source: `last_home.<stepper name>.mcu_position`: The position (as tracked by the micro-controller) of the stepper motor at the end of the last home attempt. The position is the total number of steps taken in a forward direction minus the total number of steps taken in the reverse direction since the micro-controller was last restarted.
it: `last_home.<stepper name>.mcu_position`: la posizione (tracciata dal microcontrollore) del motore passo-passo alla fine dell'ultimo tentativo di home. La posizione è il numero totale di passi effettuati in avanti meno il numero totale di passi effettuati in senso inverso dall'ultimo riavvio del microcontrollore.
zh_hant: `last_home.<步進電機名稱>.mcu_position`：步進電機在上次歸位嘗試結束時的位置（由微控制器跟蹤）。該位置是自微控制器最後一次重啟以來，向前走的總步數減去反向走的總步數。

source: The following information is available in [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) and [controller_fan some_name](Config_Reference.md#controller_fan) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [fan](Config_Reference.md#fan), [heater_fan some_name](Config_Reference.md#heater_fan) e [controller_fan some_name](Config_Reference.md#controller_fan):
zh_hant: [fan](Config_Reference.md#fan)、[heater_fan some_name](Config_Reference.md#heater_fan)和[controller_fan some_name](Config_Reference.md#controller_fan)對像提供了以下資訊：

source: `speed`: The fan speed as a float between 0.0 and 1.0.
it: `speed`: La velocità della ventola come float tra 0.0 e 1.0.
zh_hant: `speed`：風扇速度，0.0和1.0之間的浮點數。

source: `rpm`: The measured fan speed in rotations per minute if the fan has a tachometer_pin defined.
it: `rpm`: la velocità della ventola misurata in rotazioni al minuto se la ventola ha un pin tachimetro definito.
zh_hant: `rpm`：如果風扇有一個 tachometer_pin，則測量的風扇速度，單位是每分鐘轉數。

source: The following information is available in [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor):
zh_hant: [filament_switch_sensor some_name](Config_Reference.md#filament_switch_sensor) 對像提供了以下資訊：

source: `enabled`: Returns True if the switch sensor is currently enabled.
it: `enabled`: Restituisce True se il sensore interruttore è attualmente abilitato.
zh_hant: `enabled`：如果開關感測器目前已啟用，則返回True。

source: `filament_detected`: Returns True if the sensor is in a triggered state.
it: `filament_detected`: restituisce True se il sensore è in uno stato attivato.
zh_hant: `filament_detected`：如果感測器處於觸發狀態，則返回 True。

source: The following information is available in [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [filament_motion_sensor some_name](Config_Reference.md#filament_motion_sensor):
zh_hant: [filament_motion_sensor 感測器名](Config_Reference.md#filament_motion_sensor) 對像提供了以下資訊：

source: `enabled`: Returns True if the motion sensor is currently enabled.
it: `abilitato`: Restituisce True se il sensore di movimento è attualmente abilitato.
zh_hant: `enabled`：如果目前啟用了運動感測器，則返回 True。

source: The following information is available in the [firmware_retraction](Config_Reference.md#firmware_retraction) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [firmware_retraction](Config_Reference.md#firmware_retraction):
zh_hant: [firmware_retraction](Config_Reference.md#firmware_retraction) 對像提供了以下資訊：

source: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: The current settings for the firmware_retraction module. These settings may differ from the config file if a `SET_RETRACTION` command alters them.
it: `retract_length`, `retract_speed`, `unretract_extra_length`, `unretract_speed`: le impostazioni correnti per il modulo firmware_retraction. Queste impostazioni possono differire dal file di configurazione se un comando `SET_RETRACTION` le altera.
zh_hant: `retract_length`、`retract_speed`、`unretract_extra_length`、`unretract_speed`：firmware_retraction 模組的當前設定。如果 `SET_RETRACTION` 命令改變它們，這些設定可能與配置檔案不同。

source: The following information is available in [gcode_macro some_name](Config_Reference.md#gcode_macro) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [gcode_macro some_name](Config_Reference.md#gcode_macro):
zh_hant: [gcode_macro <名稱>](Config_Reference.md#gcode_macro) 對像提供了以下資訊：

source: `<variable>`: The current value of a [gcode_macro variable](Command_Templates.md#variables).
it: `<variabile>`: il valore corrente di una [variabile gcode_macro](Command_Templates.md#variables).
zh_hant: `<變數名>`：[gcode_macro 變數](Command_Templates.md#variables) 的當前值。

source: The following information is available in the `gcode_move` object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto `gcode_move` (questo oggetto è sempre disponibile):
zh_hant: `gcode_move` 對像中提供了以下資訊（該對像始終可用）：

source: `gcode_position`: The current position of the toolhead relative to the current G-Code origin. That is, positions that one might directly send to a `G1` command. It is possible to access the x, y, z, and e components of this position (eg, `gcode_position.x`).
it: `gcode_position`: la posizione corrente della testa di stampa rispetto all'origine del Gcode corrente. Cioè, posizioni che si potrebbero inviare direttamente a un comando `G1`. È possibile accedere ai componenti x, y, z ed e di questa posizione (ad esempio, `gcode_position.x`).
zh_hant: `gcode_position`：工具頭相對於目前 G 程式碼原點的當前位置。也就是可以直接被髮送到`G1`命令的位置。可以分別訪問這個位置的x、y、z和e份量（例如，`gcode_position.x`）。

source: `position`: The last commanded position of the toolhead using the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
it: `position`: l'ultima posizione comandata della testina utilizzando il sistema di coordinate specificato nel file di configurazione. È possibile accedere alle componenti x, y, z ed e di questa posizione (ad esempio, `position.x`).
zh_hant: `position`：列印頭在配置檔案中定義的座標系中的最後指令位置。可以訪問這個位置的x、y、z和e份量（例如，`position.x`）。

source: `homing_origin`: The origin of the gcode coordinate system (relative to the coordinate system specified in the config file) to use after a `G28` command. The `SET_GCODE_OFFSET` command can alter this position. It is possible to access the x, y, and z components of this position (eg, `homing_origin.x`).
it: `homing_origin`: l'origine del sistema di coordinate gcode (relativo al sistema di coordinate specificato nel file di configurazione) da utilizzare dopo un comando `G28`. Il comando `SET_GCODE_OFFSET` può alterare questa posizione. È possibile accedere ai componenti x, y e z di questa posizione (ad esempio, `homing_origin.x`).
zh_hant: `homing_origin`：在`G28`命令之後要使用的 G-Code 座標系的原點（相對於配置檔案中定義的座標系）。`SET_GCODE_OFFSET` 命令可以改變這個位置。可以分別訪問這個位置的x、y和z份量（例如，`homing_origin.x`）。

source: `speed`: The last speed set in a `G1` command (in mm/s).
it: `speed`: l'ultima velocità impostata in un comando `G1` (in mm/s).
zh_hant: `speed`：在`G1`命令中最後一次設定的速度（單位：mm/s）。

source: `speed_factor`: The "speed factor override" as set by an `M220` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested speed.
it: `speed_factor`: La"speed factor override" come impostato da un comando `M220`. Questo è un valore in virgola mobile tale che 1,0 significa nessun override e, ad esempio, 2,0 raddoppierebbe la velocità richiesta.
zh_hant: `speed_factor`：通過 `M220` 命令設定的"速度因子覆蓋"。這是一個浮點值，1.0 意味著沒有覆蓋，例如，2.0 將請求的速度翻倍。

source: `extrude_factor`: The "extrude factor override" as set by an `M221` command. This is a floating point value such that 1.0 means no override and, for example, 2.0 would double requested extrusions.
it: `extrude_factor`: L'"extrude factor override" come impostato da un comando `M221`. Questo è un valore in virgola mobile tale che 1,0 significa nessun override ad esempio 2,0 raddoppierebbe le estrusioni richieste.
zh_hant: `extrude_factor`：由`M221`命令設定的"擠出倍率覆蓋" 。這是一個浮點值，1.0意味著沒有覆蓋，例如，2.0將使要求的擠出量翻倍。

source: `absolute_coordinates`: This returns True if in `G90` absolute coordinate mode or False if in `G91` relative mode.
it: `absolute_coordinates`: restituisce True se in modalità coordinate assolute `G90` o False se in modalità relativa `G91`.
zh_hant: `absolute_coordinates`：如果在 `G90` 絕對座標模式下，則返回 True；如果在 `G91` 相對模式下，則返回 False。

source: `absolute_extrude`: This returns True if in `M82` absolute extrude mode or False if in `M83` relative mode.
it: `absolute_extrude`: restituisce True se in modalità di estrusione assoluta `M82` o False se in modalità relativa `M83`.
zh_hant: `absolute_extrude`：如果在`M82`絕對擠出模式，則返回True；如果在`M83`相對模式，則返回False。

source: The following information is available in the [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor):
zh_hant: [hall_filament_width_sensor](Config_Reference.md#hall_filament_width_sensor) 對像提供了以下資訊：

source: `is_active`: Returns True if the sensor is currently active.
it: `is_active`: Restituisce True se il sensore è attualmente attivo.
zh_hant: `is_active`：如果感測器目前處於活動狀態，返回True。

source: heater
it: Riscaldatore

source: The following information is available for heater objects such as [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed), and [heater_generic](Config_Reference.md#heater_generic):
it: Le seguenti informazioni sono disponibili per oggetti riscaldatore come [extruder](Config_Reference.md#extruder), [heater_bed](Config_Reference.md#heater_bed) e [heater_generic](Config_Reference.md#heater_generic):
zh_hant: 加熱器對象，如[extruder](Config_Reference.md#extruder)、[heater_bed](Config_Reference.md#heater_bed)和[heater_generic](Config_Reference.md#heater_generic)，提供了以下資訊：

source: `temperature`: The last reported temperature (in Celsius as a float) for the given heater.
it: `temperature`: l'ultima temperatura riportata (in gradi Celsius come float) per il dato riscaldatore.
zh_hant: `temperature`：給定加熱器最後報告的溫度（以攝氏度為單位的浮點數）。

source: `target`: The current target temperature (in Celsius as a float) for the given heater.
it: `target`: la temperatura target attuale (in gradi Celsius come float) per il riscaldatore dato.
zh_hant: `target`：給定加熱器的當前目標溫度（以攝氏度為單位的浮點數）。

source: `power`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the heater.
it: `power`: l'ultima impostazione del pin PWM (un valore compreso tra 0.0 e 1.0) associato al riscaldatore.
zh_hant: `power`：與加熱器相關的 PWM 引腳的最後設定（0.0和1.0之間的數值）。

source: `can_extrude`: If extruder can extrude (defined by `min_extrude_temp`), available only for [extruder](Config_Reference.md#extruder)
it: `can_extrude`: Se l'estrusore può estrudere (definito da `min_extrude_temp`), disponibile solo per [extruder](Config_Reference.md#extruder)
zh_hant: `can_extrude`：擠出機是否可以擠出（由`min_extrude_temp`定義），僅可用於[extruder](Config_Reference.md#extruder)

source: heaters
it: Riscaldatori

source: The following information is available in the `heaters` object (this object is available if any heater is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `heaters` (questo oggetto è disponibile se è definito un riscaldatore):
zh_hant: `heaters` 對像中提供以下資訊（如果定義了任何加熱器，則該對象可用）：

source: `available_heaters`: Returns a list of all currently available heaters by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
it: `disponibili_riscaldatori`: restituisce un elenco di tutti i riscaldatori attualmente disponibili in base ai nomi completi delle sezioni di configurazione, ad es. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
zh_hant: `available_heaters`：返回所有當前可用加熱器的完整配置分段名稱，例如 `["extruder"、"heater_bed"、"heater_generic my_custom_heater"]`。

source: `available_sensors`: Returns a list of all currently available temperature sensors by their full config section names, e.g. `["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"]`.
it: `available_sensors`: restituisce un elenco di tutti i riscaldatori attualmente disponibili in base ai nomi completi delle sezioni di configurazione, ad es. `["extruder", "heater_bed", "heater_generic my_custom_heater"]`.
zh_hant: `available_sensors`：返回所有當前可用的溫度感測器的完整配置分段名稱列表，例如：`["extruder", "heater_bed", "heater_generic my_custom_heater", "temperature_sensor electronics_temp"] `。

source: The following information is available in the [idle_timeout](Config_Reference.md#idle_timeout) object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto [idle_timeout](Config_Reference.md#idle_timeout) (questo oggetto è sempre disponibile):
zh_hant: [idle_timeout](Config_Reference.md#idle_timeout) 對像中提供了以下資訊（該對像始終可用）：

source: `state`: The current state of the printer as tracked by the idle_timeout module. It is one of the following strings: "Idle", "Printing", "Ready".
it: `state`: lo stato corrente della stampante monitorato dal modulo idle_timeout. È una delle seguenti stringhe: "Idle", "Printing", "Ready".
zh_hant: `state`：由 idle_timeout 模組跟蹤的印表機的當前狀態。它可以是以下字串之一："Idle", "Printing", "Ready"。

source: `printing_time`: The amount of time (in seconds) the printer has been in the "Printing" state (as tracked by the idle_timeout module).
it: `printing_time`: la quantità di tempo (in secondi) in cui la stampante è rimasta nello stato "Printing" (come tracciato dal modulo idle_timeout).
zh_hant: `printing_time`：印表機處於「Printing」狀態的時間（以秒為單位）（由 idle_timeout 模組跟蹤）。

source: The following information is available in [mcu](Config_Reference.md#mcu) and [mcu some_name](Config_Reference.md#mcu-my_extra_mcu) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [mcu](Config_Reference.md#mcu) e [mcu some_name](Config_Reference.md#mcu-my_extra_mcu):
zh_hant: [mcu](Config_Reference.md#mcu)和[mcu some_name](Config_Reference.md#mcu-my_extra_mcu)對像提供了以下資訊：

source: `mcu_version`: The Klipper code version reported by the micro-controller.
it: `mcu_version`: la versione del codice Klipper riportata dal microcontrollore.
zh_hant: `mcu_version`：由微控制器報告的 Klipper 程式碼版本。

source: `mcu_build_versions`: Information on the build tools used to generate the micro-controller code (as reported by the micro-controller).
it: `mcu_build_versions`: informazioni sugli strumenti di compilazione utilizzati per generare il codice del microcontrollore (come riportato dal microcontrollore).
zh_hant: `mcu_build_versions`：有關用於產生微控制器程式碼的構建工具的資訊（由微控制器報告）。

source: `mcu_constants.<constant_name>`: Compile time constants reported by the micro-controller. The available constants may differ between micro-controller architectures and with each code revision.
it: `mcu_constants.<constant_name>`: Elenca le costanti di tempo riportate dal microcontrollore. Le costanti disponibili possono differire tra le architetture del microcontrollore e con ogni revisione del codice.
zh_hant: `mcu_constants.<常量名>`：由微控制器報告編譯時使用的常量。可用的常量在不同的微控制器架構和每個程式碼修訂版中可能有所不同。

source: `last_stats.<statistics_name>`: Statistics information on the micro-controller connection.
it: `last_stats.<statistics_name>`: informazioni statistiche sulla connessione del microcontrollore.
zh_hant: `last_stats.<統計資訊名>`：關於微控制器連線的統計資訊。

source: The following information is available in [output_pin some_name](Config_Reference.md#output_pin) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [output_pin some_name](Config_Reference.md#output_pin):
zh_hant: [output_pin <配置名稱>](Config_Reference.md#output_pin) 對像提供以下資訊：

source: `value`: The "value" of the pin, as set by a `SET_PIN` command.
it: `value`: Il "valore" del pin, come impostato da un comando `SET_PIN`.
zh_hant: `value`：由`SET_PIN`指令設定的引腳「值」。

source: The following information is available in the [palette2](Config_Reference.md#palette2) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [palette2](Config_Reference.md#palette2):
zh_hant: [palette2](Config_Reference.md#palette2) 對像提供了以下資訊：

source: `ping`: Amount of the last reported Palette 2 ping in percent.
it: `ping`: Valore dell'ultimo ping di Palette 2 riportato in percentuale.
zh_hant: `ping`。最後一次報告的Palette 2 ping值（百分比）。

source: `remaining_load_length`: When starting a Palette 2 print, this will be the amount of filament to load into the extruder.
it: `remaining_load_length`: Quando si avvia una stampa della Palette 2, questa sarà la quantità di filamento da caricare nell'estrusore.
zh_hant: `remaining_load_length`：當開始一個使用 Palette 2 的列印時，這是需要載入到擠出機中的耗材長度。

source: `is_splicing`: True when the Palette 2 is splicing filament.
it: `is_splicing`: Vero quando la Palette 2 sta giuntando il filamento.
zh_hant: `is_splicing`：當Palette 2正在拼接耗材時為 True。

source: The following information is available in the [pause_resume](Config_Reference.md#pause_resume) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [pause_resume](Config_Reference.md#pause_resume):
zh_hant: [palette2](Config_Reference.md#palette2) 對像提供了以下資訊：

source: `is_paused`: Returns true if a PAUSE command has been executed without a corresponding RESUME.
it: `is_paused`: Restituisce vero se un comando PAUSE è stato eseguito senza un corrispondente RESUME.
zh_hant: `is_paused`：如果執行了 PAUSE 命令而沒有執行 RESUME，則返回 True。

source: The following information is available in the `print_stats` object (this object is automatically available if a [virtual_sdcard](Config_Reference.md#virtual_sdcard) config section is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `print_stats` (questo oggetto è automaticamente disponibile se è definita una sezione di configurazione [virtual_sdcard](Config_Reference.md#virtual_sdcard)):
zh_hant: `print_stats` 對像提供了以下資訊（如果定義了 [virtual_sdcard](Config_Reference.md#virtual_sdcard) 配置分段，則此對像自動可用）：

source: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: Estimated information about the current print when a virtual_sdcard print is active.
it: `filename`, `total_duration`, `print_duration`, `filament_used`, `state`, `message`: informazioni stimate sulla stampa corrente quando è attiva una stampa da virtual_sdcard.
zh_hant: `filename`、`total_duration`、`print_duration`、`filament_used`、`state`、`message`：virtual_sdcard 列印處於活動狀態時有關目前列印的估測。
