Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Status_Reference.po
Languages: it, zh_hant

source: The following information is available in the [probe](Config_Reference.md#probe) object (this object is also available if a [bltouch](Config_Reference.md#bltouch) config section is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto [probe](Config_Reference.md#probe) (questo oggetto è disponibile anche se è definita una sezione di configurazione [bltouch](Config_Reference.md#bltouch)):
zh_hant: [probe](Config_Reference.md#probe) 對像中提供了以下資訊（如果定義了 [bltouch](Config_Reference.md#bltouch) 配置分段，則此對象也可用）：

source: `last_query`: Returns True if the probe was reported as "triggered" during the last QUERY_PROBE command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_PROBE command must be run prior to the macro containing this reference.
it: `last_query`: Restituisce True se il probe è stato segnalato come "attivato" durante l'ultimo comando QUERY_PROBE. Nota, se questo viene utilizzato in una macro, a causa dell'ordine di espansione del modello, il comando QUERY_PROBE deve essere eseguito prima della macro contenente questo riferimento.
zh_hant: `last_query`：如果探針在上一個 QUERY_PROBE 命令期間報告為"已觸發"，則返回 True。請注意，如果在宏中使用它，根據模板展開的順序，必須在包含此引用的宏之前執行 QUERY_PROBE 命令。

source: `last_z_result`: Returns the Z result value of the last PROBE command. Note, if this is used in a macro, due to the order of template expansion, the PROBE (or similar) command must be run prior to the macro containing this reference.
it: `last_z_result`: Restituisce il valore del risultato Z dell'ultimo comando PROBE. Nota, se questo viene utilizzato in una macro, a causa dell'ordine di espansione del modello, il comando PROBE (o simile) deve essere eseguito prima della macro contenente questo riferimento.
zh_hant: `last_z_result`：返回上一次 PROBE 命令的結果 Z 值。請注意，由於模板展開的順序，在宏中使用時必須在包含此引用的宏之前執行 PROBE（或類似）命令。

source: The following information is available in the `quad_gantry_level` object (this object is available if quad_gantry_level is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `quad_gantry_level` (questo oggetto è disponibile se quad_gantry_level è definito):
zh_hant: `quad_gantry_level` 對像提供了以下資訊（如果定義了 quad_gantry_level，則該對象可用）：

source: `applied`: True if the gantry leveling process has been run and completed successfully.
it: `applied`: Vero se il processo di livellamento del gantry è stato eseguito e completato con successo.
zh_hant: `applied`：如果龍門調平已執行併成功完成，則為 True。

source: The following information is available in the `query_endstops` object (this object is available if any endstop is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `query_endstops` (questo oggetto è disponibile se è definito un finecorsa):
zh_hant: `query_endstops` 對像提供以下資訊（如果定義了任何限位，則該對象可用）：

source: `last_query["<endstop>"]`: Returns True if the given endstop was reported as "triggered" during the last QUERY_ENDSTOP command. Note, if this is used in a macro, due to the order of template expansion, the QUERY_ENDSTOP command must be run prior to the macro containing this reference.
it: `last_query["<endstop>"]`: Restituisce True se l'endstop specificato è stato segnalato come "attivato-triggered" durante l'ultimo comando QUERY_ENDSTOP. Nota, se questo viene utilizzato in una macro, a causa dell'ordine di espansione del modello, il comando QUERY_ENDSTOP deve essere eseguito prima della macro contenente questo riferimento.
zh_hant: `last_query["<限位>"]`：如果在最後一次 QUERY_ENDSTOP 命令中，給定的 endstop 處於「觸發」狀態，則返回 True。注意，如果在宏中使用，由於模板擴充套件的順序，QUERY_ENDSTOP 命令必須在包含這個引用的宏之前執行。

source: The following information is available in [servo some_name](Config_Reference.md#servo) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [servo some_name](Config_Reference.md#servo):
zh_hant: [servo some_name](Config_Reference.md#servo) 對像提供了以下資訊：

source: `printer["servo <config_name>"].value`: The last setting of the PWM pin (a value between 0.0 and 1.0) associated with the servo.
it: `printer["servo <config_name>"].value`: l'ultima impostazione del pin PWM (un valore compreso tra 0.0 e 1.0) associata al servo.
zh_hant: `printer["servo <配置名>"].value`：與指定伺服相關 PWM 引腳的上一次設定的值（0.0 和 1.0 之間的值）。

source: The following information is available in the `system_stats` object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto `system_stats` (questo oggetto è sempre disponibile):
zh_hant: `system_stats` 對像提供了以下資訊（該對像始終可用）：

source: `sysload`, `cputime`, `memavail`: Information on the host operating system and process load.
it: `sysload`, `cputime`, `memavail`: informazioni sul sistema operativo del host e sul carico del processo.
zh_hant: `sysload`、`cputime`、`memavail`：關於主機操作系統和程序負載的資訊。

source: temperature sensors
it: sensori di temperatura
zh_hant: 溫度感測器

source: The following information is available in
it: Le seguenti informazioni sono disponibili in
zh_hant: 以下資訊可在

source: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor), and [temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) objects:
it: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor), [htu21d config_section_name](Config_Reference.md#htu21d-sensor), [lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor) e [temperature_host config_section_name ](Config_Reference.md#host-temperature-sensor):
zh_hant: [bme280 config_section_name](Config_Reference.md#bmp280bme280bme680-temperature-sensor)、[htu21d config_section_name](Config_Reference.md#htu21d-sensor)、[lm75 config_section_name](Config_Reference.md#lm75-temperature-sensor)和[temperature_host config_section_name](Config_Reference.md#host-temperature-sensor) 對像：

source: `temperature`: The last read temperature from the sensor.
it: `temperature`: l'ultima temperatura letta dal sensore.
zh_hant: `temperature`：上一次從感測器讀取的溫度。

source: `humidity`, `pressure`, `gas`: The last read values from the sensor (only on bme280, htu21d, and lm75 sensors).
it: `humidity`, `pressure`, `gas`: gli ultimi valori letti dal sensore (solo sui sensori bme280, htu21d e lm75).
zh_hant: `hemidity`、`pressure`和`gas`：感測器上一次讀取的值（僅在bme280、htu21d和lm75感測器上）。

source: The following information is available in [temperature_fan some_name](Config_Reference.md#temperature_fan) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [temperature_fan some_name](Config_Reference.md#temperature_fan):
zh_hant: [temperature_fan some_name](Config_Reference.md#temperature_fan) 對像提供了以下資訊：

source: `target`: The target temperature for the fan.
it: `target`: La temperatura target per la ventola.
zh_hant: `target`：風扇目標溫度。

source: The following information is available in [temperature_sensor some_name](Config_Reference.md#temperature_sensor) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [temperature_sensor some_nome](Config_Reference.md#sensore_temperatura):
zh_hant: [temperature_sensor some_name](Config_Reference.md#temperature_sensor) 對像提供了以下資訊：

source: `measured_min_temp`, `measured_max_temp`: The lowest and highest temperature seen by the sensor since the Klipper host software was last restarted.
it: `measured_min_temp`, `measured_max_temp`: la temperatura più bassa e più alta vista dal sensore dall'ultimo riavvio del software host Klipper.
zh_hant: `measured_min_temp`和`measured_max_temp`：自Klipper主機軟體上次重新啟動以來，感測器測量的最低和最高溫度。

source: The following information is available in the `toolhead` object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto `toolhead` (questo oggetto è sempre disponibile):
zh_hant: `toolhead` 對像提供了以下資訊（該對像始終可用）：

source: `position`: The last commanded position of the toolhead relative to the coordinate system specified in the config file. It is possible to access the x, y, z, and e components of this position (eg, `position.x`).
it: `position`: l'ultima posizione comandata della testa di stampa relativa al sistema di coordinate specificato nel file di configurazione. È possibile accedere alle componenti x, y, z di questa posizione (ad esempio, `position.x`).
zh_hant: `position`：列印頭相對於配置檔案中指定的座標系的最後命令位置。可以訪問該位置的 x、y、z 和 e 份量（例如，`position.x`）。

source: `extruder`: The name of the currently active extruder. For example, in a macro one could use `printer[printer.toolhead.extruder].target` to get the target temperature of the current extruder.
it: `extruder`: il nome dell'estrusore attualmente attivo. Ad esempio, in una macro si potrebbe usare `printer[printer.toolhead.extruder].target` per ottenere la temperatura target dell'estrusore corrente.
zh_hant: `extruder`：目前活躍的擠出機的名稱。例如，在宏中可以使用`printer[printer.toolhead.extruder].target`來獲取目前擠出機的目標溫度。

source: `homed_axes`: The current cartesian axes considered to be in a "homed" state. This is a string containing one or more of "x", "y", "z".
it: `homed_axes`: Gli assi cartesiani correnti considerati in uno stato "homed". Questa è una stringa contenente uno o più di "x", "y", "z".
zh_hant: `homed_axes`：目前被認為處於「已歸位」狀態的車軸。這是一個包含一個或多個"x"、"y"、"z"的字串。

source: `axis_minimum`, `axis_maximum`: The axis travel limits (mm) after homing. It is possible to access the x, y, z components of this limit value (eg, `axis_minimum.x`, `axis_maximum.z`).
it: `axis_minimum`, `axis_maximum`: i limiti di corsa dell'asse (mm) dopo la corsa di homing. È possibile accedere alle componenti x, y, z di questo valore limite (ad es. `axis_minimum.x`, `axis_minimum.z`).
zh_hant: `axis_minimum`、`axis_maximum`：歸位后的軸的行程限制（毫米）。可以訪問此極限值的 x、y、z 份量（例如，`axis_minimum.x`、`axis_maximum.z`）。

source: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: The current printing limits that are in effect. This may differ from the config file settings if a `SET_VELOCITY_LIMIT` (or `M204`) command alters them at run-time.
it: `max_velocity`, `max_accel`, `max_accel_to_decel`, `square_corner_velocity`: gli attuali limiti di stampa in vigore. Questo può differire dalle impostazioni del file di configurazione se un comando `SET_VELOCITY_LIMIT` (o `M204`) le altera in fase di esecuzione.
zh_hant: `max_velocity`、`max_accel`、`max_accel_to_decel`和`square_corner_velocity`：目前生效的印表機限制。如果 `SET_VELOCITY_LIMIT`（或 `M204`）命令在執行時改變它們，這些值可能與配置檔案設定不同。

source: `stalls`: The total number of times (since the last restart) that the printer had to be paused because the toolhead moved faster than moves could be read from the G-Code input.
it: `stalls`: il numero totale di volte (dall'ultimo riavvio) che la stampante ha dovuto essere messa in pausa perché la testina si muoveva più velocemente di quanto fosse possibile leggere i movimenti dall'input del G-code.
zh_hant: `stalls`：由於工具頭移動速度快于從 G 程式碼輸入讀取的移動速度，因此印表機必須暫停的總次數（自上次重新啟動以來）。

source: The following information is available in the [virtual_sdcard](Config_Reference.md#virtual_sdcard) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [virtual_sdcard](Config_Reference.md#virtual_sdcard):
zh_hant: [virtual_sdcard](Config_Reference.md#virtual_sdcard)對像提供了以下資訊：

source: `is_active`: Returns True if a print from file is currently active.
it: `is_active`: Restituisce True se una stampa da file è attualmente attiva.
zh_hant: `is_active`：如果正在從檔案進行列印，則返回 True。

source: `progress`: An estimate of the current print progress (based of file size and file position).
it: `progress`: una stima dello stato di avanzamento della stampa corrente (in base alla dimensione del file e alla posizione del file).
zh_hant: `progress`：對當前列印進度的估計（基於檔案大小和檔案位置）。

source: `file_position`: The current position (in bytes) of an active print.
it: `file_position`: la posizione corrente (in byte) di una stampa attiva.
zh_hant: `file_position`：目前列印的位置（以位元組為單位）。

source: The following information is available in the `webhooks` object (this object is always available):
it: Le seguenti informazioni sono disponibili nell'oggetto `webhooks` (questo oggetto è sempre disponibile):
zh_hant: `system_stats` 對像提供了以下資訊（該對像始終可用）：

source: `state`: Returns a string indicating the current Klipper state. Possible values are: "ready", "startup", "shutdown", "error".
it: `state`: restituisce una stringa che indica lo stato corrente di Klipper. I valori possibili sono: "ready", "startup", "shutdown", "error".
zh_hant: `state`：返回一個表示目前 Klipper 狀態的字串。可能的值為："ready"、"startup"、"shutdown"和"error"。

source: `state_message`: A human readable string giving additional context on the current Klipper state.
it: `state_message`: una stringa leggibile dall'uomo che fornisce un contesto aggiuntivo sullo stato corrente di Klipper.
zh_hant: `state_message`：提供了一個包含目前 Klipper 狀態和上下文的可讀字串。

source: The following information is available in the `z_tilt` object (this object is available if z_tilt is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `z_tilt` (questo oggetto è disponibile se z_tilt è definito):
zh_hant: `z_tilt` 對像提供了以下資訊（如果定義了 z_tilt，則該對象可用）：

source: `applied`: True if the z-tilt leveling process has been run and completed successfully.
it: `applied`: Vero se il processo di livellamento z-tilt è stato eseguito e completato con successo.
zh_hant: `applied`：如果 z 傾斜調平過程已執行併成功完成，則為 True。

source: The following information is available in [dual_carriage](Config_Reference.md#dual_carriage) on a hybrid_corexy or hybrid_corexz robot
it: Le seguenti informazioni sono disponibili in [dual_carriage](Config_Reference.md#dual_carriage) su una macchina hybrid_corexy o hybrid_corexz
zh_hant: 使用了 hybrid_corexy 或 hybrid_corexz 運動學的 [dual_carriage](Config_Reference.md#dual_carriage) 對像提供了以下資訊

source: `mode`: The current mode. Possible values are: "FULL_CONTROL"
it: `mode`: la modalità corrente. I valori possibili sono: "FULL_CONTROL"
zh_hant: `mode`：目前模式。可能的值："FULL_CONTROL"

source: `active_carriage`: The current active carriage. Possible values are: "CARRIAGE_0", "CARRIAGE_1"
it: `active_carriage`: il carrello attivo corrente. I valori possibili sono: "CARRIAGE_0", "CARRIAGE_1"
zh_hant: `active_carriage`：目前的活躍的滑車。可能的值是"CARRIAGE_0"和"CARRIAGE_1"

source: `file_path`: A full path to the file of currently loaded file.
it: `file_path`: un percorso completo del file per il file attualmente caricato.
zh_hant: `file_path`：目前載入的檔案的完整路徑。

source: `file_size`: The file size (in bytes) of currently loaded file.
it: `file_size`: la dimensione (in byte) del file attualmente caricato.
zh_hant: `file_size`：目前載入的檔案的大小（以位元組為單位）。

source: The following information is available in the `motion_report` object (this object is automatically available if any stepper config section is defined):
it: Le seguenti informazioni sono disponibili nell'oggetto `motion_report` (questo oggetto è automaticamente disponibile se è definita una sezione di configurazione stepper):
zh_hant: `motion_report` 對像提供了以下資訊（如果定義了任何步進器配置分段，則該對像自動可用）：

source: `live_position`: The requested toolhead position interpolated to the current time.
it: `live_position`: la posizione richiesta della testa di stampa interpolata all'ora corrente.
zh_hant: `live_position`：請求的列印頭位置插值到目前時間后的位置。

source: `live_velocity`: The requested toolhead velocity (in mm/s) at the current time.
it: `live_velocity`: la velocità della testa di stampa richiesta (in mm/s) al momento attuale.
zh_hant: `live_velocity`：目前請求的列印頭速度（以毫米/秒為單位）。

source: `live_extruder_velocity`: The requested extruder velocity (in mm/s) at the current time.
it: `live_extruder_velocity`: la velocità dell'estrusore richiesta (in mm/s) al momento attuale.
zh_hant: `live_extruder_velocity`：目前請求的擠出機速度（單位：mm/s）。

source: `save_config_pending`: Returns true if there are updates that a `SAVE_CONFIG` command may persist to disk.
it: `save_config_pending`: Restituisce vero se ci sono aggiornamenti che un comando `SAVE_CONFIG` potrebbe rendere persistenti sul disco.
zh_hant: `save_config_pending`：如果存在可以通過 `SAVE_CONFIG` 命令儲存到配置檔案的更新，則返回 True。

source: `warnings`: A list of warnings about config options. Each entry in the list will be a dictionary containing a `type` and `message` field (both strings). Additional fields may be available depending on the type of warning.
it: `warnings`: un elenco di avvisi sulle opzioni di configurazione. Ogni voce nell'elenco sarà un dizionario contenente un campo `type` e `message` (entrambe le stringhe). Ulteriori campi potrebbero essere disponibili a seconda del tipo di avviso.
zh_hant: `warnings`：有關配置選項的警告列表。列表中的每個條目都將是一個 dictionary，其中包含 ` type` 和 `message` 欄位（都是字串）。根據警告型別，可能還有其他可用欄位。

source: tmc drivers
it: driver tmc
zh_hant: tmc 驅動

source: The following information is available in [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) objects (eg, `[tmc2208 stepper_x]`):
it: Le seguenti informazioni sono disponibili negli oggetti [TMC stepper driver](Config_Reference.md#tmc-stepper-driver-configuration) (ad esempio, `[tmc2208 stepper_x]`):
zh_hant: [TMC 步進驅動](Config_Reference.md#tmc-stepper-driver-configuration)對像（例如，`[tmc2208 stepper_x]`）提供了以下資訊：

source: `mcu_phase_offset`: The micro-controller stepper position corresponding with the driver's "zero" phase. This field may be null if the phase offset is not known.
it: `mcu_phase_offset`: La posizione dello stepper del microcontrollore corrispondente alla fase "zero" del driver. Questo campo può essere nullo se l'offset di fase non è noto.
zh_hant: `mcu_phase_offset`：微控制器步進位置與驅動器的"零"相位的相對位置。如果相位偏移未知，則此欄位可能為空。

source: `phase_offset_position`: The "commanded position" corresponding to the driver's "zero" phase. This field may be null if the phase offset is not known.
it: `phase_offset_position`: La "posizione comandata" corrispondente alla fase "zero" del driver. Questo campo può essere nullo se l'offset di fase non è noto.
zh_hant: `phase_offset_position`：對應電機「零」相位的「指令位置」。如果相位偏移未知，則該欄位可以為空。

source: `drv_status`: The results of the last driver status query. (Only non-zero fields are reported.) This field will be null if the driver is not enabled (and thus is not periodically queried).
it: `drv_status`: i risultati dell'ultima query sullo stato del driver. (Sono riportati solo i campi diversi da zero.) Questo campo sarà nullo se il driver non è abilitato (e quindi non viene interrogato periodicamente).
zh_hant: `drv_status`：上次驅動狀態查詢結果。（僅報告非零欄位。如果驅動沒有被啟用（因此沒有輪詢），則此欄位將為 null。

source: `run_current`: The currently set run current.
it: `run_current`: La corrente di esecuzione attualmente impostata.
zh_hant: `run_current`：目前設定的執行電流。

source: `hold_current`: The currently set hold current.
it: `hold_current`: La corrente di mantenimento attualmente impostata.
zh_hant: `hold_current`：目前設定的保持電流。

source: `Diameter`: The last reading from the sensor in mm.
it: `Diameter`: l'ultima lettura dal sensore in mm.
zh_hant: `Diameter`：上一次感測器讀數，單位為 mm。

source: `Raw`: The last raw ADC reading from the sensor.
it: `Raw`: l'ultima lettura grezza dell'ADC dal sensore.
zh_hant: `Raw`：上一次感測器原始 ADC 讀數。

source: `profiles`: The set of currently defined profiles as setup using BED_MESH_PROFILE.
it: `profiles`: l'insieme dei profili attualmente definiti come setup usando BED_MESH_PROFILE.
zh_hant: `profiles`：使用 BED_MESH_PROFILE 設置的當前定義的配置文件集。

source: The following information is available in [angle some_name](Config_Reference.md#angle) objects:
it: Le seguenti informazioni sono disponibili negli oggetti [angle some_name](Config_Reference.md#angle):
zh_hant: [angle some_name](Config_Reference.md#angle) 對像中提供了以下信息：

source: `temperature`: The last temperature reading (in Celsius) from a tle5012b magnetic hall sensor. This value is only available if the angle sensor is a tle5012b chip and if measurements are in progress (otherwise it reports `None`).
it: `temperature`: l'ultima lettura della temperatura (in gradi Celsius) da un sensore magnetico Hall tle5012b. Questo valore è disponibile solo se il sensore angolare è un chip tle5012b e se le misurazioni sono in corso (altrimenti segnala `None`).

source: The following information is available for each `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]`, and `[pca9632 led_name]` config section defined in printer.cfg:
it: Le seguenti informazioni sono disponibili per ogni sezione di configurazione `[led led_name]`, `[neopixel led_name]`, `[dotstar led_name]`, `[pca9533 led_name]` e `[pca9632 led_name]` definita in printer.cfg:

source: `color_data`: A list of color lists containing the RGBW values for a led in the chain. Each value is represented as a float from 0.0 to 1.0. Each color list contains 4 items (red, green, blue, white) even if the underyling LED supports fewer color channels. For example, the blue value (3rd item in color list) of the second neopixel in a chain could be accessed at `printer["neopixel <config_name>"].color_data[1][2]`.
it: `color_data`: un elenco di lista di colori contenenti i valori RGBW per ogni led nella catena. Ogni valore è rappresentato come un float da 0,0 a 1,0. Ciascuna lista di colori contiene 4 voci (rosso, verde, blu, bianco) anche se il LED sottostante supporta meno canali di colore. Ad esempio, è possibile accedere al valore blu (3° elemento nell'elenco dei colori) del secondo neopixel in una catena in `printer["neopixel <config_name>"].color_data[1][2]`.

source: `save_config_pending_items`: Contains the sections and options that were changed and would be persisted by a `SAVE_CONFIG`.
it: `save_config_pending_items`: contiene le sezioni e le opzioni che sono state modificate e sarebbero mantenute da un `SAVE_CONFIG`.

source: The following information is available in the [exclude_object](Exclude_Object.md) object:
it: Le seguenti informazioni sono disponibili nell'oggetto [exclude_object](Exclude_Object.md):

source: `objects`: An array of the known objects as provided by the `EXCLUDE_OBJECT_DEFINE` command. This is the same information provided by the `EXCLUDE_OBJECT VERBOSE=1` command. The `center` and `polygon` fields will only be present if provided in the original `EXCLUDE_OBJECT_DEFINE`
it: `objects`: un array di oggetti conosciuti come fornito dal comando `EXCLUDE_OBJECT_DEFINE`. Queste sono le stesse informazioni fornite dal comando `EXCLUDE_OBJECT VERBOSE=1`. I campi `center` e `polygon` saranno presenti solo se forniti nell'originale `EXCLUDE_OBJECT_DEFINE`

source: Here is a JSON sample:
it: Ecco un esempio JSON:

source: `excluded_objects`: An array of strings listing the names of excluded objects.
it: `excluded_objects`: un array di stringhe che elenca i nomi degli oggetti esclusi.

source: `current_object`: The name of the object currently being printed.
it: `current_object`: il nome dell'oggetto attualmente in fase di stampa.

source: The following information is available in the `manual_probe` object:
it: Le seguenti informazioni sono disponibili nell'oggetto `manual_probe`:

source: `is_active`: Returns True if a manual probing helper script is currently active.
it: `is_active`: Restituisce True se è attualmente attivo uno script di supporto per il rilevamento manuale.

source: `z_position`: The current height of the nozzle (as the printer currently understands it).
it: `z_position`: l'altezza corrente dell'ugello (come la sta attualmente interpretando la stampante).

source: `z_position_lower`: Last probe attempt just lower than the current height.
it: `z_position_lower`: ultimo tentativo di sonda appena inferiore all'altezza corrente.

source: `z_position_upper`: Last probe attempt just greater than the current height.
it: `z_position_upper`: ultimo tentativo di sonda appena maggiore dell'altezza corrente.

source: The following information is available in the `Config_Reference.md#bed_screws` object:
it: Le seguenti informazioni sono disponibili nell'oggetto `Config_Reference.md#bed_screws`:
