Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Status_Reference.po
Languages: it, zh_hant

source: `is_active`: Returns True if the bed screws adjustment tool is currently active.
it: `is_active`: Restituisce True se lo strumento di regolazione delle viti del letto è attualmente attivo.

source: `state`: The bed screws adjustment tool state. It is one of the following strings: "adjust", "fine".
it: `state`: lo stato dello strumento di regolazione delle viti del piatto. È una delle seguenti stringhe: "adjust", "fine".

source: `current_screw`: The index for the current screw being adjusted.
it: `current_screw`: l'indice per la vite corrente in corso di regolazione.

source: `accepted_screws`: The number of accepted screws.
it: `accepted_screws`: il numero di viti accettate.

source: The following information is available for extruder_stepper objects (as well as [extruder](Config_Reference.md#extruder) objects):
it: Le seguenti informazioni sono disponibili per gli oggetti extruder_stepper (così come per gli oggetti [extruder](Config_Reference.md#extruder)):

source: `pressure_advance`: The current [pressure advance](Pressure_Advance.md) value.
it: `pressure_advance`: il valore corrente di [pressure advance](Pressure_Advance.md).

source: `smooth_time`: The current pressure advance smooth time.
it: `smooth_time`: il tempo di avanzamento graduale della pressure advance corrente.

source: For Delta printers the `cone_start_z` is the max z height at maximum radius (`printer.toolhead.cone_start_z`).
it: Per le stampanti Delta, `cone_start_z` è l'altezza z massima al raggio massimo (`printer.toolhead.cone_start_z`).

source: Status reference
zh_hant: 狀態參考

source: angle
zh_hant: 角度
