Repository: GregO1778/klipper
Catalog: gh_pages/locales/*/LC_MESSAGES/Using_PWM_Tools.po
Languages: fr, it

source: This document describes how to setup a PWM-controlled laser or spindle using `output_pin` and some macros.
fr: Ce document décrit comment configurer un laser ou une broche contrôlée par PWM en utilisant `output_pin` et quelques macros.
it: Questo documento descrive come impostare un laser o un mandrino controllato da PWM usando `output_pin` e alcune macro.

source: How does it work?
fr: Comment ça marche ?
it: Come funziona?

source: With re-purposing the printhead's fan pwm output, you can control lasers or spindles. This is useful if you use switchable print heads, for example the E3D toolchanger or a DIY solution. Usually, cam-tools such as LaserWeb can be configured to use `M3-M5` commands, which stand for *spindle speed CW* (`M3 S[0-255]`), *spindle speed CCW* (`M4 S[0-255]`) and *spindle stop* (`M5`).
fr: En ré-utilisant la sortie pwm du ventilateur de la tête d'impression, vous pouvez contrôler des lasers ou des broches. Ceci est utile si vous utilisez des têtes d'impression commutables, par exemple le changeur d'outils E3D ou une solution DIY. Habituellement, les outils à came tels que LaserWeb peuvent être configurés pour utiliser les commandes `M3-M5`, qui correspondent à *vitesse de broche CW* (`M3 S[0-255]`), *vitesse de broche CCW* (`M4 S[0-255]`) et *arrêt de broche* (`M5`).
it: Riutilizzando l'output pwm della ventola della testina di stampa, è possibile controllare laser o mandrini. Ciò è utile se si utilizzano testine di stampa intercambiabili, ad esempio il cambio utensile E3D o una soluzione fai-da-te. Di solito, gli strumenti cam come LaserWeb possono essere configurati per utilizzare i comandi `M3-M5`, che stanno per *velocità mandrino CW* (`M3 S[0-255]`), *velocità mandrino CCW* (`M4 S[ 0-255]`) e *arresto mandrino* (`M5`).

source: **Warning:** When driving a laser, keep all security precautions that you can think of! Diode lasers are usually inverted. This means, that when the MCU restarts, the laser will be *fully on* for the time it takes the MCU to start up again. For good measure, it is recommended to *always* wear appropriate laser-goggles of the right wavelength if the laser is powered; and to disconnect the laser when it is not needed. Also, you should configure a safety timeout, so that when your host or MCU encounters an error, the tool will stop.
fr: **Avertissement :** Lorsque vous pilotez un laser, prenez toutes les précautions de sécurité auxquelles vous pouvez penser ! Les lasers à diodes sont généralement inversés. Cela signifie que lorsque l'unité centrale redémarre, le laser sera *complètement allumé* pendant le temps nécessaire à l'unité centrale pour redémarrer. Pour faire bonne mesure, il est recommandé de *toujours* porter des lunettes laser appropriées de la bonne longueur d'onde si le laser est alimenté ; et de déconnecter le laser lorsqu'il n'est pas nécessaire. Vous devriez également configurer un délai de sécurité, de sorte que lorsque votre hôte ou votre MCU rencontre une erreur, l'outil s'arrête.
it: **Attenzione:** Quando utilizzi un laser, mantieni tutte le precauzioni di sicurezza che ti vengono in mente! I laser a diodi sono generalmente invertiti. Ciò significa che quando l'MCU si riavvia, il laser sarà *completamente acceso* per il tempo necessario al riavvio dell'MCU. Per buona misura, si raccomanda di indossare *sempre* occhiali laser appropriati della giusta lunghezza d'onda se il laser è alimentato e per disconnettere il laser quando non è necessario. Inoltre, dovresti configurare un timeout di sicurezza, in modo che quando l'host o l'MCU riscontrano un errore, lo strumento si arresti.

source: Current Limitations
fr: Limites actuelles
it: Limitazioni attuali

source: There is a limitation of how frequent PWM updates may occur. While being very precise, a PWM update may only occur every 0.1 seconds, rendering it almost useless for raster engraving. However, there exists an [experimental branch](https://github.com/Cirromulus/klipper/tree/laser_tool) with its own tradeoffs. In long term, it is planned to add this functionality to main-line klipper.
fr: La fréquence des mises à jour PWM est limitée. Bien qu'elle soit très précise, une mise à jour PWM ne peut se produire que toutes les 0,1 seconde, ce qui la rend presque inutile pour la gravure tramée. Cependant, il existe une [branche expérimentale](https://github.com/Cirromulus/klipper/tree/laser_tool) avec ses propres compromis. A long terme, il est prévu d'ajouter cette fonctionnalité au klipper principal.
it: Esiste una limitazione della frequenza degli aggiornamenti PWM. Pur essendo molto preciso, un aggiornamento PWM può verificarsi solo ogni 0,1 secondi, rendendolo quasi inutile per l'incisione raster. Tuttavia, esiste un [ramo sperimentale](https://github.com/Cirromulus/klipper/tree/laser_tool) con i propri compromessi. A lungo termine, si prevede di aggiungere questa funzionalità al klipper principale.

source: Commands
fr: Commandes
it: Comandi

source: `M3/M4 S<value>` : Set PWM duty-cycle. Values between 0 and 255. `M5` : Stop PWM output to shutdown value.
fr: `M3/M4 S<valeur>` : Définit le cycle de travail PWM. Valeurs comprises entre 0 et 255. `M5` : Arrête la sortie PWM à la valeur d'arrêt.
it: `M3/M4 S<value>` : Imposta il duty-cycle PWM. Valori compresi tra 0 e 255. `M5` : Arresta l'uscita PWM al valore di spegnimento.

source: Laserweb Configuration
fr: Configuration de Laserweb
it: Configurazione Laserweb

source: If you use Laserweb, a working configuration would be:
fr: Si vous utilisez Laserweb, une configuration fonctionnelle serait la suivante :
it: Se utilizzi Laserweb, una configurazione funzionante sarebbe:

source: GCODE START: M5 ; Disable Laser G21 ; Set units to mm G90 ; Absolute positioning G0 Z0 F7000 ; Set Non-Cutting speed GCODE END: M5 ; Disable Laser G91 ; relative G0 Z+20 F4000 ; G90 ; absolute GCODE HOMING: M5 ; Disable Laser G28 ; Home all axis TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Disable Laser LASER INTENSITY: S
fr: GCODE START : M5 ; Désactiver le laser G21 ; Définir les unités en mm G90 ; Positionnement absolu G0 Z0 F7000 ; Régler la vitesse de non coupe GCODE END : M5 ; Désactiver le laser G91 ; relatif G0 Z+20 F4000 ; G90 ; absolu GCODE HOMING : M5 ; Désactiver le laser G28 ; Déplacement sur tous les axes TOOL ON : M3 $INTENSITÉ TOOL OFF : M5 ; Désactiver le laser INTENSITÉ DU LASER : S
it: GCODE START: M5 ; Disabilita Laser G21 ; Set units to mm G90 ; Absolute positioning G0 Z0 F7000 ; Set Non-Cutting speed GCODE END: M5 ; Disabilita Laser G91 ; relative G0 Z+20 F4000 ; G90 ; absolute GCODE HOMING: M5 ; Disabilita Laser G28 ; Home all axis TOOL ON: M3 $INTENSITY TOOL OFF: M5 ; Disabilita Laser LASER INTENSITY: S

source: Using PWM tools
it: Utilizzo dei strumenti PWM

source: For an example configuration, see [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
it: Per un esempio di configurazione, vedere [config/sample-pwm-tool.cfg](/config/sample-pwm-tool.cfg).
